Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
#include <M5Unified.h>
#include <M5EchoBase.h>
#include <math.h>
#include <Wire.h>
#include <M5UnitENV.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <ArduinoJson.h>
#include <mbedtls/sha256.h>
#include <Preferences.h>

constexpr uint32_t JANUS_REMOTE_JOB_TTL_MS = 12000;     // v8.30: Buzz can be busy; keep remote jobs fresh longer.
constexpr uint32_t JANUS_REMOTE_LOCAL_GRACE_MS = 1800;   // v8.30: do not sit at H=0 for 9s between Buzz ranges.

// v8.30 KENSHI TACHYON AUDIOFIX: Core2 opens AUDIO page -> sends A/C ON.
// TRON streams EchoBase mic as 20 ms u-law speech frames only while Core2 asks for it.
// Goal: intelligible speech over ESP-NOW: ULAW20, anti-clip TX gain, self-contained frames.
#define JANUS_AUDIO_LIVE_TX_ENABLE     1
#define JANUS_AUDIO_CODEC_ULAW         1
#define JANUS_AUDIO_CODEC_ADPCM4       2
#define JANUS_AUDIO_CODEC_ACTIVE       JANUS_AUDIO_CODEC_ULAW
#define JANUS_AUDIO_SAMPLE_RATE        8000
#define JANUS_AUDIO_FRAME_MS           20
#define JANUS_AUDIO_FRAME_SAMPLES      160      // 20 ms @ 8 kHz
#define JANUS_AUDIO_FRAME_MAX_BYTES    180      // u-law payload: 160 samples -> 160 bytes + spare
#define JANUS_AUDIO_SNAPSHOT_MODE      1        // v8.29: buffered speech clip mode, not fragile live monitor
#define JANUS_AUDIO_SNAPSHOT_FRAMES    20       // v8.30: 0.40 s clip. Lower latency; Core2 still gets prebuffer.
#define JANUS_AUDIO_SNAPSHOT_SEND_GAP_MS 10UL   // send clip faster than realtime; Core2 buffers then plays
#define JANUS_AUDIO_TX_PCM_SAMPLES     (JANUS_AUDIO_FRAME_SAMPLES * 2)  // 20 ms @ 16 kHz -> downsample to 8 kHz
#define JANUS_AUDIO_CONTROL_TIMEOUT_MS 12000UL
#define JANUS_AUDIO_AGC_TARGET_ABS     9800.0f
#define JANUS_AUDIO_AGC_MIN_GAIN       0.60f
#define JANUS_AUDIO_AGC_MAX_GAIN       12.0f
#define JANUS_AUDIO_NOISE_GATE_ABS     6.0f

// v8.30: Kenshi/Tachyon bus compatible with Blind Eye v2.8.
// Swarm can now hear/send prophecy packets and use the first available memory-rich node as shared context.
#define JANUS_TACHYON_PROPHECY_ENABLE  1
#define JANUS_TACHYON_TX_BG_MS         3000UL
#define JANUS_TACHYON_TX_ALERT_MS      900UL
#define JANUS_KENSHI_BUBBLE_TX_MS      4200UL
#define JANUS_SWARM_MEMORY_SAVE_MS     60000UL
#define JANUS_SWARM_MEMORY_SLOTS       12
#define JANUS_SWARM_REMOTE_PROPHECIES  8


// ==============================================================================
// JANUS: GROUNDOPS v8.30-AUDIO-SNAPSHOT-SPEECH-TX (RTS BASE + ALIEN SHOOTER HERO RAID + THRONE DEFENSE + ADAPTIVE MINER)
// Roles: Core2 = galactic president/commander; Stick3S = pilot/smuggler/mech carrier; ATOMS3R = planetary command post, base defender and hero raid executor.
// Hardware: M5Stack ATOM S3R + ATOM Echo + ENV/BPS Sensor (QMP6988)
// Architecture: EchoBase Mic Telemetry + ESP-NOW AudioLive TX Smooth/AGC, Original Graphics, Single Remote/Local Mining, BPS Telemetry
// ==============================================================================

namespace Config {
  constexpr int SCREEN_W = 128;
  constexpr int SCREEN_H = 128;
  constexpr int MAX_UNITS = 120;
  constexpr int MAX_RESOURCES = 40;
  constexpr int MAX_PARTICLES = 150;
  constexpr int MAX_SPITS = 42;

  constexpr float PICKUP_DIST_SQ = 4.0f;       
  constexpr float BASE_UNLOAD_DIST_SQ = 25.0f; 
  constexpr float SIGHT_SQ = 2500.0f;          
  constexpr float RANGE_MELEE_SQ = 100.0f;     
  constexpr float RANGE_SPIT_SQ = 225.0f;      
  constexpr float BASE_ATTACK_RANGE_SQ = 300.0f; 
  constexpr float SEPARATION_DIST_SQ = 16.0f;

  constexpr float MAX_DT = 0.05f;
  constexpr float FIXED_DT = 1.0f / 30.0f;
  constexpr float MAX_FRAME_DT = 0.25f;
  constexpr uint8_t MAX_CATCHUP_STEPS = 4;
  constexpr float SPIT_LIFETIME = 0.2f;
  constexpr float BASE_BUILD_COOLDOWN = 1.0f;  
  constexpr float BOREDOM_TIME = 5.0f; 
}

enum class Role : uint8_t { SCAVENGER, GUARD, ARCHER, MAGE, BRUTE, REPAIR, HEALER, HERO, TOWER };
enum class GameState : uint8_t { PLAYING, BETWEEN_WAVES, GAME_OVER };

struct Base {
  float x, y;
  float hp, maxHp;
  int resources;
  uint8_t team;
  uint16_t color;
  float buildCooldown;
};

struct Unit {
  bool active;
  float x, y;
  float vx, vy;
  float hp, maxHp;
  float mana, maxMana;   // v8.15B: hero mana pool, drawn as blue bar under HP
  float speed, dmg, rangeSq;
  uint8_t team;      // 0 = Janus defenders, 1 = wave enemies
  Role role;
  int targetResId;
  bool carrying;
  float cooldown;
  float skillCooldown;   // legacy aggregate indicator only; real skill CDs are per-skill below
  float skillCd[11];      // v8.15B: independent cooldown for each hero skill
  float skillCdMax[11];
  float idleTime;    // used as carried loot / small state memory
  uint16_t heroXp;
  uint8_t heroLv;
  uint8_t heroClass;
  uint16_t skillMask;
  uint16_t lastSkillUsed;
  float skillCooldownMax;
  uint8_t visualSeed;
};

struct Resource { bool active; float x, y; int amount; };
struct Particle { bool active; float x, y, vx, vy, life; uint16_t color; };
struct SpitFX { bool active; float startX, startY, endX, endY, life, maxLife; uint16_t color; };

struct BgDrop {
  float x, y;
  float radius;
  float speed;
  float phase;
};

struct SwarmMicroAI {
  uint32_t tick = 0;
  uint8_t mode[2] = {0, 0};
  int16_t energy[2] = {70, 70};
  int16_t stress[2] = {0, 0};
  int16_t curiosity[2] = {40, 40};
  int16_t confidence[2] = {50, 50};
  uint32_t lastMs = 0;
};


// ==============================================================================
// JANUS NERD MINER / PUBLIC-POOL.IO
// Worker visible in pool as: 1F1Y6CdkApZboDF6g1DYrQ8Dke2E5gWiP1.Swarm_<chipid>
// Set your WiFi credentials before flashing.
// ==============================================================================
const char* WIFI_SSID = "YOUR_WIFI";
const char* WIFI_PASS = "YOUR_PASSWORD";

const char* POOL_HOST = "public-pool.io";
const uint16_t POOL_PORT = 3333;   // public-pool.io TCP stratum; TLS 4333 needs WiFiClientSecure
const char* BTC_WALLET = "1F1Y6CdkApZboDF6g1DYrQ8Dke2E5gWiP1";
char BTC_WORKER[32] = "Swarm";
char MINER_USER[96] = "";

