Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
volatile uint32_t minerRealHashrate = 0;   // LOCAL/POOL H/s (direct public-pool worker)
volatile uint32_t minerRemoteHashrate = 0; // REMOTE H/s (Buzz colony job worker)
float hudRemoteHashrate = 0.0f;
float hudLocalHashrate = 0.0f;
volatile uint32_t minerShares = 0;
volatile double minerCurrentDiff = 1.0;
volatile bool stratumConnected = false;
TaskHandle_t minerTaskHandle = NULL;

// Local real-hash fallback.
// If Stratum has not produced a job yet, we still run a REAL double-SHA256 local workload.
volatile uint32_t minerLocalHashrate = 0;
volatile uint32_t minerBestBits = 0;
volatile uint64_t minerTotalHashes = 0;
volatile bool minerLocalFallback = true;
volatile uint32_t minerSubmitAttempts = 0;
volatile uint32_t minerSubmitRejects = 0;
constexpr uint16_t MIN_POOL_SHARE_BITS = 16; // debug only; v6 submits only shares that meet pool target
volatile uint16_t minerShareTargetBits = 0;
uint8_t minerShareTarget[32];
volatile uint32_t minerLastPoolConnectMs = 0;
volatile uint32_t minerLastJobMs = 0;
volatile uint32_t minerLastSubmitMs = 0;
volatile uint32_t minerLastAcceptMs = 0;
volatile uint32_t minerWifiReconnects = 0;
char minerStatus[20] = "BOOT";
uint32_t lastWifiKickMs = 0;

// v8.12B CORE0->GAME reward bridge.
// This mutex is declared here because janusMinerGameReward() is above
// the main miner shared-state mutex in the file.
portMUX_TYPE minerGameRewardMux = portMUX_INITIALIZER_UNLOCKED;

// kind: 1 remote/Buzz share sent, 2 local pool candidate submitted,
//       3 pool ACCEPT, 4 local fallback omen, 5 Buzz Agent gameplay reward.
volatile uint32_t minerGameRewardSeq = 0;
volatile uint8_t  minerGameRewardKind = 0;
volatile uint16_t minerGameRewardBits = 0;
volatile uint32_t minerGameRewardAtMs = 0;

// v8.22: личное состояние устройства.
// Это не "фейковая удача" и не подмена pool ACCEPT.
// Это внутренний агентный слой: личная энтропия, настроение, усталость и бодрость.
portMUX_TYPE janusPersonalMux = portMUX_INITIALIZER_UNLOCKED;
volatile float janusPersonalEntropy = 0.22f;  // 0..1: внутренний хаос/новизна/перегруз
volatile float janusMood = 0.62f;             // 0..1: эмоциональный тон агента
volatile float janusFatigue = 0.10f;          // 0..1: накопленная усталость от жары/боёв/хеша
volatile float janusVigor = 0.76f;            // 0..1: бодрость/готовность
volatile uint8_t janusMoodCode = 1;           // 0 tired, 1 ready, 2 focused, 3 excited, 4 stressed, 5 proud
volatile uint32_t janusPersonalLastTickMs = 0;
char janusPersonalLine[40] = "READY E22 M62 F10 V76";

float janusClampF(float v, float lo, float hi) {
  if (!isfinite(v)) return lo;
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

uint8_t janusMoodCodeFrom(float mood, float fatigue, float vigor, float entropy) {
  if (fatigue > 0.72f || vigor < 0.22f) return 0;      // tired
  if (entropy > 0.72f || mood < 0.34f) return 4;       // stressed
  if (mood > 0.78f && vigor > 0.58f) return 5;         // proud
  if (vigor > 0.70f && entropy > 0.38f) return 3;      // excited
  if (mood > 0.55f && entropy < 0.62f) return 2;       // focused
  return 1;                                            // ready
}

const char* janusMoodName(uint8_t code) {
  switch (code) {
    case 0: return "TIRED";
    case 2: return "FOCUS";
    case 3: return "ALIVE";
    case 4: return "TENSE";
    case 5: return "PROUD";
    default: return "READY";
  }
}

void janusRefreshPersonalLine() {
  float e, m, f, v;
  uint8_t code;
  portENTER_CRITICAL(&janusPersonalMux);
  e = janusPersonalEntropy;
  m = janusMood;
  f = janusFatigue;
  v = janusVigor;
  code = janusMoodCode;
  portEXIT_CRITICAL(&janusPersonalMux);
  snprintf(janusPersonalLine, sizeof(janusPersonalLine), "%s E%02d M%02d F%02d V%02d",
           janusMoodName(code), (int)(e * 100.0f), (int)(m * 100.0f),
           (int)(f * 100.0f), (int)(v * 100.0f));
}

void janusPersonalSnapshot(float& entropy, float& mood, float& fatigue, float& vigor, uint8_t& code) {
  portENTER_CRITICAL(&janusPersonalMux);
  entropy = janusPersonalEntropy;
  mood = janusMood;
  fatigue = janusFatigue;
  vigor = janusVigor;
  code = janusMoodCode;
  portEXIT_CRITICAL(&janusPersonalMux);
}

void janusPersonalReset() {
  portENTER_CRITICAL(&janusPersonalMux);
  janusPersonalEntropy = 0.22f;
  janusMood = 0.62f;
  janusFatigue = 0.10f;
  janusVigor = 0.76f;
  janusMoodCode = janusMoodCodeFrom(janusMood, janusFatigue, janusVigor, janusPersonalEntropy);
  janusPersonalLastTickMs = millis();
  portEXIT_CRITICAL(&janusPersonalMux);
  janusRefreshPersonalLine();
}

// kind: 1 Buzz ticket sent, 2 pool candidate sent, 3 direct pool ACCEPT,
//       4 local hash omen, 5 Buzz-confirmed pool ACCEPT, 6 reject, 7 mission complete, 8 Buzz praise only.
void janusPersonalNudge(uint8_t kind, uint16_t bits) {
  float bitEnergy = janusClampF((float)bits / 64.0f, 0.0f, 1.4f);
  portENTER_CRITICAL(&janusPersonalMux);
  if (kind == 5) {
    janusMood += 0.18f + bitEnergy * 0.08f;
    janusVigor += 0.16f + bitEnergy * 0.06f;
    janusFatigue -= 0.10f;
    janusPersonalEntropy = janusPersonalEntropy * 0.72f + 0.18f;
  } else if (kind == 3) {
    janusMood += 0.15f + bitEnergy * 0.06f;
    janusVigor += 0.12f + bitEnergy * 0.05f;
    janusFatigue -= 0.08f;
    janusPersonalEntropy = janusPersonalEntropy * 0.76f + 0.20f;
  } else if (kind == 2) {
    janusMood += 0.025f;
    janusVigor += 0.010f;
    janusFatigue += 0.020f;
    janusPersonalEntropy += 0.035f + bitEnergy * 0.015f;
  } else if (kind == 1) {
    janusMood += 0.015f;
    janusFatigue += 0.018f;
    janusPersonalEntropy += 0.025f + bitEnergy * 0.012f;
  } else if (kind == 6) {
    janusMood -= 0.080f;
    janusVigor -= 0.050f;
    janusFatigue += 0.070f;
    janusPersonalEntropy += 0.095f;
  } else if (kind == 8) {
    janusMood += 0.018f + bitEnergy * 0.010f;
    janusVigor += 0.006f;
    janusFatigue += 0.006f;
    janusPersonalEntropy += 0.012f;
  } else if (kind == 7) {
    janusMood += 0.050f;
    janusVigor += 0.030f;
    janusFatigue -= 0.035f;
    janusPersonalEntropy *= 0.90f;
  } else {
    janusMood += 0.008f;
    janusFatigue += 0.006f;
    janusPersonalEntropy += 0.018f;
  }
  janusPersonalEntropy = janusClampF(janusPersonalEntropy, 0.02f, 1.00f);
  janusMood = janusClampF(janusMood, 0.02f, 1.00f);
  janusFatigue = janusClampF(janusFatigue, 0.00f, 1.00f);
  janusVigor = janusClampF(janusVigor, 0.00f, 1.00f);
  janusMoodCode = janusMoodCodeFrom(janusMood, janusFatigue, janusVigor, janusPersonalEntropy);
  portEXIT_CRITICAL(&janusPersonalMux);
  janusRefreshPersonalLine();
}

void janusPersonalMetabolism(uint32_t now, uint32_t totalHashRate, bool combat, float tempC, float gameSurprise) {
  static uint32_t lastRejects = 0;
  if (janusPersonalLastTickMs && now - janusPersonalLastTickMs < 750UL) return;
  uint32_t last = janusPersonalLastTickMs ? janusPersonalLastTickMs : now;
  float dt = janusClampF((float)(now - last) / 1000.0f, 0.05f, 3.0f);
  janusPersonalLastTickMs = now;

  float load = janusClampF((float)totalHashRate / 22000.0f, 0.0f, 1.8f);
  float heat = (tempC > 28.0f) ? janusClampF((tempC - 28.0f) / 12.0f, 0.0f, 1.0f) : 0.0f;
  float surprise = janusClampF(gameSurprise / 3.0f, 0.0f, 1.0f);
  uint32_t rejectsNow = minerSubmitRejects;
  if (rejectsNow > lastRejects) janusPersonalNudge(6, 0);
  lastRejects = rejectsNow;

