Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  portENTER_CRITICAL(&janusPersonalMux);
  janusFatigue += (0.010f * load + 0.012f * heat + (combat ? 0.006f : -0.012f)) * dt;
  janusVigor += ((load > 0.05f ? 0.006f : -0.010f) - heat * 0.010f - janusFatigue * 0.010f) * dt;
  janusPersonalEntropy += (surprise * 0.014f + load * 0.006f + heat * 0.010f - 0.012f) * dt;
  janusMood += ((0.58f - janusMood) * 0.010f + janusVigor * 0.006f - janusFatigue * 0.010f - heat * 0.005f) * dt;
  janusPersonalEntropy = janusClampF(janusPersonalEntropy, 0.02f, 1.00f);
  janusMood = janusClampF(janusMood, 0.02f, 1.00f);
  janusFatigue = janusClampF(janusFatigue, 0.00f, 1.00f);
  janusVigor = janusClampF(janusVigor, 0.00f, 1.00f);
  janusMoodCode = janusMoodCodeFrom(janusMood, janusFatigue, janusVigor, janusPersonalEntropy);
  portEXIT_CRITICAL(&janusPersonalMux);
  janusRefreshPersonalLine();
}

void janusMinerGameReward(uint8_t kind, uint16_t bits) {
  janusPersonalNudge(kind, bits);
  portENTER_CRITICAL(&minerGameRewardMux);
  minerGameRewardKind = kind;
  minerGameRewardBits = bits;
  minerGameRewardAtMs = millis();
  minerGameRewardSeq++;
  portEXIT_CRITICAL(&minerGameRewardMux);
}


// ============================================================================
// JANUS COLONY BUS v6.0
// - Buzz-compatible ESP-NOW protocol.
// - Swarm can run LOCAL Stratum or REMOTE worker mode from Buzz JobPacket.
// - Game/mic/BPS "surprise" becomes EntropyReport fuel for colony AI.
// ============================================================================
#define JANUS_ENABLE_COLONY 1
#define JANUS_COLONY_PULSE_MS 1500UL
#define JANUS_COLONY_ENTROPY_MS 2400UL
#define JANUS_MASTER_TIMEOUT_MS 9000UL

char JANUS_NODE_ID[24] = "ATOM_SWARM_TRON";
uint8_t JANUS_BROADCAST_MAC[6] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};

struct __attribute__((packed)) JanusColonyPacket {
  char magic[6];       // "JANUS"
  char nodeId[24];
  char role[12];       // BuzzLighter / GroundOps / Swarm
  uint32_t seq;
  uint32_t hashRate;
  uint32_t shares;
  uint32_t rejects;
  uint32_t bestBits;
  float diff;
  uint16_t targetBits;
  uint16_t aiBatch;
  uint8_t aiHint;      // 0 observe, 1 stable, 2 slow-down, 3 boost
  uint32_t jobAgeMs;
  int8_t rssi;
  uint32_t uptime;
};

struct __attribute__((packed)) JobPacket {
  uint8_t magic[2];       // 'J','B'
  uint8_t job_id[8];
  uint8_t header[80];
  uint32_t start_nonce;
  uint32_t range_size;
  uint8_t target[32];
  uint32_t extranonce2;
};

struct __attribute__((packed)) ShareResponse {
  uint8_t magic[2];       // 'S','R'
  uint8_t job_id[8];
  uint32_t nonce;
  uint16_t worker_id;
};

// v8.16: future Core2/Buzz mission order. Current Core2 may ignore this until patched,
// but ATOM is already ready to accept explicit ground orders.
struct __attribute__((packed)) GroundOrderPacket {
  uint8_t magic[2];       // 'G','O'
  uint8_t version;        // 1
  uint8_t mode;           // 0 base defense, 1 hero/mecha raid
  uint8_t sector;         // galaxy/planet sector hint
  uint8_t priority;       // 0..255
  uint16_t flags;
  uint32_t mission_id;
  char target[16];
};

volatile uint32_t janusGroundOrderSeq = 0;
volatile uint8_t janusGroundOrderMode = 0;
volatile uint8_t janusGroundOrderSector = 0;
volatile uint8_t janusGroundOrderPriority = 0;
volatile uint32_t janusGroundOrderMission = 0;
volatile uint32_t janusGroundOrderAtMs = 0;
volatile uint16_t janusGroundOrderFlags = 0;
char janusGroundOrderTarget[16] = "BASE_HOLD";

struct __attribute__((packed)) EntropyReport {
  uint8_t magic[2];       // 'E','R'
  uint16_t worker_id;
  float local_entropy;
  uint8_t sensor_flags;   // bit0=mic, bit1=bps/env, bit2=game/ai, bit3=prediction
  float values[4];        // v[0]=mic_rms, v[1]=pressure_hpa, v[2]=game_surprise, v[3]=prediction_error
};

struct __attribute__((packed)) EntropyReportV2 {
  uint8_t magic[2];       // 'E','2'
  uint16_t worker_id;
  char nodeId[24];
  float local_entropy;
  float prediction_error;
  float sync_hint;
  float fit;
  uint8_t sensor_flags;   // bit0=mic, bit1=bps/env, bit2=game/ai, bit3=prediction
  float values[8];        // v0=mic_rms, v1=pressure_hpa, v2=temp_c, v3=game_surprise, v4=prediction_error, v5=hashrate, v6=bestBits, v7=agent_mood_x100
  uint32_t uptime_ms;
};

// v8.22C: EchoMic compatibility bridge + Buzz Agent reward packet shared with Blind Eye and Stick.
// Praise packets are only visual morale. Real game buffs require deltaShares>0 from Buzz after pool ACCEPT.
struct __attribute__((packed)) JanusAgentRewardPacket {
  uint8_t magic[2];        // 'A','R'
  uint8_t version;         // 1
  char source[16];         // BuzzAgent
  char targetNode[24];     // ATOM_SWARM_TRON / Swarm / GroundOps / all / *
  uint32_t seq;
  uint8_t rewardLevel;     // 0 observe, 1 praise, 2 boost, 3 golden/share-ticket reward
  uint8_t aiHint;          // 1 stable, 2 slow, 3 boost
  uint16_t rewardPoints;
  uint16_t targetBatch;
  uint32_t entropySeed;
  float score;
  float predictedHashRate;
  float predictionError;
  uint32_t deltaShares;
  uint32_t uptime_ms;
};

// v8.26 AUDIO LIVE RADIO: packets compatible by magic; codec 1 u-law is the speech-first path, codec 2 remains fallback.
// Core2 -> TRON: 'A','C' control. TRON -> Core2: 'A','F' compressed audio frame.
struct __attribute__((packed)) JanusAudioControlPacket {
  uint8_t magic[2];        // 'A','C'
  uint8_t version;         // 1
  uint8_t enable;          // 0 stop, 1 stream while Core2 is on AUDIO page
  uint8_t codec;           // 1 = u-law, 2 = ADPCM4
  uint16_t sampleRate;     // 8000
  uint16_t frameMs;        // 40 for ADPCM radio mode
  uint32_t seq;
  char source[16];         // Core2Home
  char target[16];         // EchoMic / ATOM_SWARM / all
};

struct __attribute__((packed)) JanusAudioFramePacket {
  uint8_t magic[2];        // 'A','F'
  uint8_t version;         // 2 for ADPCM radio mode
  uint8_t codec;           // 1 = u-law, 2 = ADPCM4
  uint16_t seq;
  uint16_t sampleRate;
  uint16_t samples;        // decoded PCM samples in this frame
  int16_t predictor;       // ADPCM starting predictor for this frame
  uint8_t stepIndex;       // ADPCM starting step index for this frame
  uint8_t flags;           // bit0: speech/open gate
  uint8_t data[JANUS_AUDIO_FRAME_MAX_BYTES];
};

// v8.30: shared low-cost world-state packets. Layout matches Blind Eye v2.8.
struct __attribute__((packed)) JanusKenshiPacket {
  uint8_t magic[2];        // 'K','2'
  uint8_t version;         // 1
  uint8_t flags;           // bit0=active bubble, bit1=alert, bit2=virtual summary, bit3=motion-base ready
  char nodeId[24];
  uint32_t seq;
  uint16_t worker_id;
  uint32_t uptime_ms;
  uint8_t activeBubbleNodes;
  uint8_t virtualNodes;
  uint32_t worldFlags;
  uint8_t sector;
  uint8_t predictedSector;
  uint8_t jobState;        // 0 idle, 1 watch, 2 track, 3 alert, 4 learn, 5 relay
  uint8_t priority;
  int8_t rssi;
  float entropy;
  float activity;
  float confidence;
  float values[6];         // mic, pressure, temp, game surprise, pred error, fit/mood
};

struct __attribute__((packed)) JanusTachyonProphecyPacket {
  uint8_t magic[2];        // 'T','P'
  uint8_t version;         // 1
  uint8_t flags;           // bit0=presence/audio now, bit1=motion/game now, bit2=alert, bit3=remote-assisted
  char nodeId[24];
  uint32_t seq;
  uint16_t worker_id;
  uint32_t uptime_ms;
  uint16_t horizon_ms;
  uint8_t sector;
  uint8_t predictedSector;
  uint8_t confidence;      // 0..100
  uint8_t jobState;
  float presence_now;
  float motion_now;
  float pred_presence_1;
  float pred_motion_1;
  float pred_presence_2;
  float pred_motion_2;
  float pred_presence_3;
  float pred_motion_3;
  float event_eta_ms;
  float future_stress;
  float swarm_pressure;
};

