Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
struct JanusRemoteProphecyState {
  bool active = false;
  char nodeId[24] = "";
  uint32_t lastSeenMs = 0;
  uint32_t seq = 0;
  uint8_t sector = 0;
  uint8_t predictedSector = 0;
  uint8_t confidence = 0;
  uint8_t flags = 0;
  float presence_now = 0.0f;
  float motion_now = 0.0f;
  float pred_presence_1 = 0.0f;
  float pred_motion_1 = 0.0f;
  float pred_presence_2 = 0.0f;
  float pred_motion_2 = 0.0f;
  float pred_presence_3 = 0.0f;
  float pred_motion_3 = 0.0f;
  float future_stress = 0.0f;
  float swarm_pressure = 0.0f;
  int8_t rssi = 0;
};

struct SwarmRecentMemorySlot {
  bool used = false;
  char nodeId[24] = "";
  uint32_t lastSeenMs = 0;
  float entropy = 0.0f;
  float predError = 0.0f;
  float sync = 0.0f;
  float fit = 0.0f;
  float v0 = 0.0f;
  float v1 = 0.0f;
  float v2 = 0.0f;
  float v3 = 0.0f;
  uint8_t kind = 0;        // 1=E2, 2=TP, 3=Kenshi
};

volatile uint32_t colonySeq = 0;
volatile uint32_t colonyPeersSeen = 0;
volatile uint32_t colonyLastRxMs = 0;
volatile uint32_t colonyLastTxMs = 0;
volatile uint32_t colonyLastEntropyMs = 0;
volatile uint32_t colonyTxFail = 0;
volatile uint32_t colonyTxOk = 0;
volatile uint16_t colonyMiningBatch = 180;
volatile uint8_t colonyAIMode = 0;
volatile uint8_t colonyConfidence = 50;
volatile uint32_t colonyBestPeerBits = 0;
volatile uint32_t colonyBestPeerHash = 0;
volatile uint32_t colonyEntropyRx = 0;
volatile float colonyPeerEntropy = 0.0f;
volatile float swarmLocalEntropy = 0.0f;
volatile float swarmPredictionError = 0.0f;
volatile float swarmMicRms = 0.0f;
volatile float swarmMicPeak = 0.0f;
volatile uint32_t swarmMicFrames = 0;
volatile uint32_t swarmMicFails = 0;
volatile float swarmPressureHpa = 0.0f;
volatile float swarmTempC = 0.0f;
volatile float swarmGameSurprise = 0.0f;
char colonyLastPeer[24] = "none";

// v8.22: Buzz Agent feedback mirrored into the game loop.
// Only Buzz-confirmed pool ACCEPT packets (deltaShares>0, rewardLevel>=3) become buffs.
volatile uint32_t colonyAgentRewardsRx = 0;
volatile uint32_t colonyAgentShareRewardsRx = 0;      // Buzz-confirmed pool ACCEPT rewards only
volatile uint32_t colonyAgentPointsTotal = 0;
volatile uint32_t colonyAgentLastRewardMs = 0;
volatile uint32_t colonyAgentLastSeq = 0;
volatile uint8_t colonyAgentLevel = 0;
volatile uint8_t colonyAgentHint = 1;
volatile uint16_t colonyAgentTargetBatch = 0;
float colonyAgentScore = 0.0f;
float colonyAgentPredictionError = 0.0f;
char colonyAgentSource[16] = "-";

// v8.28 AUDIO ULAW20 VOICEFORMANT TX state.
volatile bool janusAudioTxEnabled = false;
volatile uint32_t janusAudioTxLastControlMs = 0;
volatile uint32_t janusAudioTxControlsRx = 0;
volatile uint32_t janusAudioTxFrames = 0;
volatile uint32_t janusAudioTxSendFail = 0;
volatile uint32_t janusAudioTxReadFail = 0;
uint32_t janusAudioTxLastFrameMs = 0;
uint32_t janusAudioTxLastLogMs = 0;
uint32_t janusAudioTxLastControlLogMs = 0;
uint16_t janusAudioTxSeq = 0;
float janusAudioTxDc = 0.0f;
float janusAudioTxPreemphPrev = 0.0f;
float janusAudioTxSpeechLp = 0.0f;
float janusAudioTxLastShaped = 0.0f;
float janusAudioTxAgcGain = 3.0f;
float janusAudioTxNoiseFloor = 80.0f;
char janusAudioTxSource[16] = "-";
int16_t janusAudioTxAdpcmPredictor = 0;
uint8_t janusAudioTxAdpcmIndex = 0;
bool janusAudioTxAdpcmReady = false;
#if JANUS_AUDIO_SNAPSHOT_MODE
static uint8_t janusAudioSnapData[JANUS_AUDIO_SNAPSHOT_FRAMES][JANUS_AUDIO_FRAME_MAX_BYTES];
static uint16_t janusAudioSnapPayload[JANUS_AUDIO_SNAPSHOT_FRAMES];
static uint16_t janusAudioSnapSamples[JANUS_AUDIO_SNAPSHOT_FRAMES];
static uint8_t janusAudioSnapFlags[JANUS_AUDIO_SNAPSHOT_FRAMES];
uint8_t janusAudioSnapCaptureIdx = 0;
uint8_t janusAudioSnapSendIdx = 0;
uint8_t janusAudioSnapReadyFrames = 0;
bool janusAudioSnapSending = false;
uint32_t janusAudioSnapLastSendMs = 0;
volatile uint32_t janusAudioSnapClips = 0;
#endif

// v8.30: tiny shared memory and prophecy state. This lets a memory-poor rover use the swarm's last known states.
JanusRemoteProphecyState swarmRemoteProphecies[JANUS_SWARM_REMOTE_PROPHECIES];
SwarmRecentMemorySlot swarmRecentMemory[JANUS_SWARM_MEMORY_SLOTS];
Preferences janusSwarmMemoryPrefs;
uint32_t tachyonProphecySeq = 0;
uint32_t tachyonProphecyRx = 0;
uint32_t tachyonProphecyTx = 0;
uint32_t tachyonLastTxMs = 0;
uint32_t kenshiBubbleSeq = 0;
uint32_t kenshiBubbleRx = 0;
uint32_t kenshiBubbleTx = 0;
uint32_t kenshiLastTxMs = 0;
uint32_t lastSwarmMemorySaveMs = 0;
uint8_t swarmVirtualSector = 0;
uint8_t swarmPredictedSector = 0;
uint8_t swarmJobState = 1;
float swarmPredMic1 = 0.0f;
float swarmPredMic2 = 0.0f;
float swarmPredMic3 = 0.0f;
float swarmPredMotion1 = 0.0f;
float swarmPredMotion2 = 0.0f;
float swarmPredMotion3 = 0.0f;
float swarmFutureStress = 0.0f;
float swarmRemotePressure = 0.0f;
float swarmProphecyConfidence = 0.0f;
char swarmMemoryLine[48] = "MEM LOCAL";

// REMOTE worker state from Buzz master.
volatile bool colonyMasterPresent = false;
volatile uint32_t colonyLastMasterMs = 0;
volatile bool remoteJobActive = false;
volatile uint32_t remoteJobRxMs = 0;
uint8_t remoteJobId[8] = {};
uint8_t remoteHeader[80] = {};
uint8_t remoteTarget[32] = {};
uint32_t remoteStartNonce = 0;
uint32_t remoteRangeSize = 0;
uint32_t remoteNonce = 0;
uint32_t remoteRangeEnd = 0;
uint32_t remoteSharesSent = 0;

// v8.0: hot shared state is touched by loop(), ESP-NOW callbacks and miner task.
// Keep this sketch single-file for Arduino, but protect the worst offenders.
portMUX_TYPE swarmSharedMux = portMUX_INITIALIZER_UNLOCKED;

uint16_t getColonyMiningBatch() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint16_t v = colonyMiningBatch;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

void setColonyMiningBatch(uint16_t v) {
  v = constrain(v, (uint16_t)60, (uint16_t)700);
  portENTER_CRITICAL(&swarmSharedMux);
  colonyMiningBatch = v;
  portEXIT_CRITICAL(&swarmSharedMux);
}

void adjustColonyMiningBatch(int delta) {
  portENTER_CRITICAL(&swarmSharedMux);
  int v = (int)colonyMiningBatch + delta;
  if (v < 60) v = 60;
  if (v > 700) v = 700;
  colonyMiningBatch = (uint16_t)v;
  portEXIT_CRITICAL(&swarmSharedMux);
}

bool getRemoteJobActive() {
  portENTER_CRITICAL(&swarmSharedMux);
  bool v = remoteJobActive;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

void setRemoteJobActive(bool v) {
  portENTER_CRITICAL(&swarmSharedMux);
  remoteJobActive = v;
  portEXIT_CRITICAL(&swarmSharedMux);
}

void setMinerStatus(const char* s) {
  portENTER_CRITICAL(&swarmSharedMux);
  strlcpy(minerStatus, s ? s : "?", sizeof(minerStatus));
  portEXIT_CRITICAL(&swarmSharedMux);
}

void copyMinerStatus(char* out, size_t outLen) {
  if (!out || outLen == 0) return;
  portENTER_CRITICAL(&swarmSharedMux);
  strlcpy(out, minerStatus, outLen);
  portEXIT_CRITICAL(&swarmSharedMux);
}


uint32_t getMinerSharesSafe() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint32_t v = minerShares;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

