Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
uint32_t getMinerRejectsSafe() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint32_t v = minerSubmitRejects;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

uint32_t getMinerBestBitsSafe() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint32_t v = minerBestBits;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

uint32_t incMinerSharesSafe() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint32_t v = ++minerShares;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

uint32_t incMinerRejectsSafe() {
  portENTER_CRITICAL(&swarmSharedMux);
  uint32_t v = ++minerSubmitRejects;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

uint32_t updateMinerBestBitsSafe(uint32_t bits) {
  // v8.10 HOTFIX:
  // v8.01 accidentally called updateMinerBestBitsSafe(bits) from inside itself.
  // That infinite recursion overflowed the SwarmMiner task stack and caused
  // "Stack canary watchpoint triggered (SwarmMiner)" reboots.
  portENTER_CRITICAL(&swarmSharedMux);
  if (bits > minerBestBits) minerBestBits = bits;
  uint32_t v = minerBestBits;
  portEXIT_CRITICAL(&swarmSharedMux);
  return v;
}

void copyMinerCoreStats(uint32_t& shares, uint32_t& rejects, uint32_t& bestBits) {
  portENTER_CRITICAL(&swarmSharedMux);
  shares = minerShares;
  rejects = minerSubmitRejects;
  bestBits = minerBestBits;
  portEXIT_CRITICAL(&swarmSharedMux);
}

uint16_t swarmWorkerId() {
  return (uint16_t)(ESP.getEfuseMac() & 0xFFFF);
}

bool jobIdEquals(const uint8_t a[8], const uint8_t b[8]) {
  for (int i=0;i<8;i++) if (a[i] != b[i]) return false;
  return true;
}

bool hashMeetsTargetBytes(const uint8_t hash[32], const uint8_t target[32]) {
  for (int i=0;i<32;i++) {
    if (hash[i] < target[i]) return true;
    if (hash[i] > target[i]) return false;
  }
  return true;
}



bool remoteJobFresh() {
#if JANUS_ENABLE_COLONY
  return getRemoteJobActive() && remoteJobRxMs > 0 && (millis() - remoteJobRxMs <= JANUS_REMOTE_JOB_TTL_MS);
#else
  return false;
#endif
}

bool shouldStayRemoteMode() {
#if JANUS_ENABLE_COLONY
  if (!colonyMasterPresent) return false;
  if (remoteJobFresh()) return true;
  if (remoteJobRxMs > 0 && (millis() - remoteJobRxMs <= JANUS_REMOTE_LOCAL_GRACE_MS)) return true;
  return false;
#else
  return false;
#endif
}

// v8.17: local adaptive miner governor for the ground command post.
// Buzz still gives the baseline batch, but ATOMS3R protects UI/ESP-NOW/thermal load.
uint16_t getAdaptiveMiningBatch() {
  uint16_t b = getColonyMiningBatch();
  uint32_t now = millis();

  // Live audio needs a steadier loop and cleaner ESP-NOW airtime. Keep mining alive, but lighter while Core2 listens.
  if (janusAudioTxEnabled && b > 12) b = 12;

  // Recent high-priority ground orders mean the screen/AI is busy: keep hashing alive but lighter.
  bool recentCrisis = (janusGroundOrderAtMs > 0 && now - janusGroundOrderAtMs < 90000UL && janusGroundOrderPriority >= 210);
  if (recentCrisis && b > 420) b = 420;

  // Hero raid / sabotage needs more frame time than static base defense.
  if (janusGroundOrderMode && b > 360) b = 360;

  // ENV temperature is not chip temperature, but it is a useful homeostatic proxy.
  if (swarmTempC > 31.5f && b > 260) b = 260;
  else if (swarmTempC > 29.5f && b > 420) b = 420;

  // If Buzz went away, do not burn the device on local fallback.
  if (!shouldStayRemoteMode() && !stratumConnected && b > 180) b = 180;

  if (janusAudioTxEnabled) return constrain(b, (uint16_t)16, (uint16_t)120);
  return constrain(b, (uint16_t)60, (uint16_t)700);
}

uint8_t minerStatusCode() {
  if (getMinerSharesSafe() > 0) return 4;
  if (!stratumConnected) return WiFi.status() == WL_CONNECTED ? 1 : 0;
  if (minerLastJobMs > 0) return 3;
  return 2;
}

bool janusAgentRewardTargetsThisSwarm(const char* targetNode) {
  if (!targetNode || !targetNode[0]) return true;
  if (!strcasecmp(targetNode, "all")) return true;
  if (!strcmp(targetNode, "*")) return true;
  if (!strncasecmp(targetNode, JANUS_NODE_ID, sizeof(JANUS_NODE_ID))) return true;
  if (strstr(targetNode, "ATOM_SWARM") || strstr(targetNode, "Swarm") || strstr(targetNode, "GroundOps")) return true;
  return false;
}

// Use void* in the public signature so Arduino .ino auto-prototypes cannot fail
// with: 'JanusAgentRewardPacket' does not name a type.
void janusApplyAgentRewardPacket(const void* pktPtr) {
  if (!pktPtr) return;
  const JanusAgentRewardPacket& ar = *(const JanusAgentRewardPacket*)pktPtr;
  if (ar.magic[0] != 'A' || ar.magic[1] != 'R' || ar.version != 1) return;
  if (!janusAgentRewardTargetsThisSwarm(ar.targetNode)) return;

  const bool realPoolAccept = (ar.deltaShares > 0 && ar.rewardLevel >= 3);

  colonyAgentRewardsRx++;
  if (realPoolAccept) colonyAgentShareRewardsRx += ar.deltaShares;
  colonyAgentPointsTotal += realPoolAccept ? ar.rewardPoints : 0;
  colonyAgentLastRewardMs = millis();
  colonyAgentLastSeq = ar.seq;
  colonyAgentLevel = ar.rewardLevel;
  colonyAgentHint = ar.aiHint ? ar.aiHint : 1;
  colonyAgentTargetBatch = ar.targetBatch;
  colonyAgentScore = ar.score;
  colonyAgentPredictionError = ar.predictionError;
  strlcpy(colonyAgentSource, ar.source[0] ? ar.source : "BuzzAgent", sizeof(colonyAgentSource));

  // Real buff path: only Buzz-confirmed public-pool ACCEPT may tune the worker or reward the game.
  if (realPoolAccept) {
    if (ar.targetBatch >= 60 && ar.targetBatch <= 700) {
      uint16_t cur = getColonyMiningBatch();
      setColonyMiningBatch((uint16_t)((cur * 2 + ar.targetBatch) / 3));
    }
    if (ar.aiHint == 2 && getColonyMiningBatch() > 80) adjustColonyMiningBatch(-8);
    else if (ar.aiHint == 3) adjustColonyMiningBatch(+12);

    uint32_t dShareCap = ar.deltaShares > 4UL ? 4UL : ar.deltaShares;
    uint16_t bits = (uint16_t)constrain(18 + (int)ar.rewardLevel * 6 + (int)ar.rewardPoints / 18 + (int)dShareCap * 10, 16, 96);
    janusMinerGameReward(5, bits);
    Serial.printf("[AGENT] POOL_ACCEPT_BUFF rx src=%s target=%s lvl=%u pts=%u batch=%u dShares=%lu bits=%u score=%.2f err=%.3f\n",
                  colonyAgentSource, ar.targetNode, (unsigned)ar.rewardLevel,
                  (unsigned)ar.rewardPoints, (unsigned)ar.targetBatch,
                  (unsigned long)ar.deltaShares, (unsigned)bits, ar.score, ar.predictionError);
    return;
  }

