Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  // Praise path: visible feedback only. No gold, no XP, no batch boost, no game buff.
  // Route visual praise through the existing miner-event mailbox.
  uint16_t praiseBits = (uint16_t)constrain(8 + (int)ar.rewardLevel * 5 + (int)ar.rewardPoints / 32 + (int)(ar.score / 12.0f), 8, 96);
  janusMinerGameReward(8, praiseBits);
  Serial.printf("[AGENT] praise-only rx src=%s target=%s lvl=%u pts=%u batch=%u dShares=%lu score=%.2f err=%.3f\n",
                colonyAgentSource, ar.targetNode, (unsigned)ar.rewardLevel,
                (unsigned)ar.rewardPoints, (unsigned)ar.targetBatch,
                (unsigned long)ar.deltaShares, ar.score, ar.predictionError);
}

bool janusAudioControlTargetsThisNode(const char* target) {
  if (!target || !target[0]) return true;
  if (!strcasecmp(target, "all")) return true;
  if (!strcmp(target, "*")) return true;
  if (!strncasecmp(target, JANUS_NODE_ID, sizeof(JANUS_NODE_ID))) return true;
  if (!strcasecmp(target, "EchoMic")) return true;
  if (strstr(target, "ATOM") || strstr(target, "SWARM") || strstr(target, "Swarm") || strstr(target, "GroundOps")) return true;
  return false;
}

// Use void* in the public signature so Arduino .ino auto-prototypes cannot break on packet type ordering.
void janusHandleAudioControlPacket(const void* pktPtr) {
#if JANUS_AUDIO_LIVE_TX_ENABLE
  if (!pktPtr) return;
  const JanusAudioControlPacket& ac = *(const JanusAudioControlPacket*)pktPtr;
  if (ac.magic[0] != 'A' || ac.magic[1] != 'C' || ac.version != 1) return;
  if (ac.codec != JANUS_AUDIO_CODEC_ULAW && ac.codec != JANUS_AUDIO_CODEC_ADPCM4) return;
  if (!janusAudioControlTargetsThisNode(ac.target)) return;

  uint32_t now = millis();
  janusAudioTxControlsRx++;
  janusAudioTxLastControlMs = now;
  strlcpy(janusAudioTxSource, ac.source[0] ? ac.source : "Core2Home", sizeof(janusAudioTxSource));
  bool oldState = janusAudioTxEnabled;
  janusAudioTxEnabled = ac.enable != 0;
  if (!janusAudioTxEnabled) {
#if JANUS_AUDIO_SNAPSHOT_MODE
    janusAudioSnapCaptureIdx = 0;
    janusAudioSnapSendIdx = 0;
    janusAudioSnapReadyFrames = 0;
    janusAudioSnapSending = false;
    janusAudioSnapLastSendMs = 0;
#endif
    if (oldState || now - janusAudioTxLastControlLogMs > 2500UL) {
      janusAudioTxLastControlLogMs = now;
      Serial.printf("[AUDIO-TX] Core2 AC OFF src=%s seq=%lu\n", janusAudioTxSource, (unsigned long)ac.seq);
    }
  } else {
#if JANUS_AUDIO_SNAPSHOT_MODE
    if (!oldState) {
      janusAudioSnapCaptureIdx = 0;
      janusAudioSnapSendIdx = 0;
      janusAudioSnapReadyFrames = 0;
      janusAudioSnapSending = false;
      janusAudioSnapLastSendMs = 0;
    }
#endif
    if (!oldState || now - janusAudioTxLastControlLogMs > 5000UL) {
      janusAudioTxLastControlLogMs = now;
      Serial.printf("[AUDIO-TX] Core2 AC ON src=%s target=%s seq=%lu codec=%u %uHz/%ums gain=%.1f\n",
                    janusAudioTxSource, ac.target, (unsigned long)ac.seq, (unsigned)ac.codec,
                    (unsigned)ac.sampleRate, (unsigned)ac.frameMs, janusAudioTxAgcGain);
    }
  }
#endif
}

void swarmRememberNodeState(const char* nodeId, uint8_t kind, float entropy, float predErr, float sync, float fit, float v0, float v1, float v2, float v3);
void onJanusTachyonProphecy(const JanusTachyonProphecyPacket& tp, int8_t rxRssi);
void onJanusKenshiPacket(const JanusKenshiPacket& kp, int8_t rxRssi);
void tachyonProphecyTick();
void loadSwarmMemoryState();
void saveSwarmMemoryState(bool force=false);

#if JANUS_ENABLE_COLONY
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onColonyRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
#else
void onColonyRecv(const uint8_t *mac, const uint8_t *data, int len) {
#endif
  if (!data || len < 2) return;
  int8_t rxRssi = 0;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  if (info && info->rx_ctrl) rxRssi = info->rx_ctrl->rssi;
#endif

  if (len == sizeof(JanusTachyonProphecyPacket) && data[0] == 'T' && data[1] == 'P') {
    JanusTachyonProphecyPacket tp{};
    memcpy(&tp, data, sizeof(tp));
    onJanusTachyonProphecy(tp, rxRssi);
    return;
  }

  if (len == sizeof(JanusKenshiPacket) && data[0] == 'K' && data[1] == '2') {
    JanusKenshiPacket kp{};
    memcpy(&kp, data, sizeof(kp));
    onJanusKenshiPacket(kp, rxRssi);
    return;
  }

  if (len == sizeof(JanusAudioControlPacket) && data[0] == 'A' && data[1] == 'C') {
    JanusAudioControlPacket ac{};
    memcpy(&ac, data, sizeof(ac));
    janusHandleAudioControlPacket(&ac);
    return;
  }

  if (len == sizeof(JanusColonyPacket)) {
    JanusColonyPacket pkt;
    memcpy(&pkt, data, sizeof(pkt));
    if (memcmp(pkt.magic, "JANUS", 5) != 0) return;
    if (!strncmp(pkt.nodeId, JANUS_NODE_ID, sizeof(pkt.nodeId))) return;

    colonyPeersSeen++;
    colonyLastRxMs = millis();
    strlcpy(colonyLastPeer, pkt.nodeId, sizeof(colonyLastPeer));

    if (!strncmp(pkt.role, "BuzzLighter", sizeof(pkt.role))) {
      colonyMasterPresent = true;
      colonyLastMasterMs = millis();
    }

    if (pkt.bestBits > colonyBestPeerBits) colonyBestPeerBits = pkt.bestBits;
    if (pkt.hashRate > colonyBestPeerHash) colonyBestPeerHash = pkt.hashRate;

    if (pkt.rejects == 0 && pkt.aiBatch >= 80 && pkt.aiBatch <= 700 && pkt.hashRate > 0) {
      uint16_t cur = getColonyMiningBatch();
      setColonyMiningBatch((uint16_t)((cur * 3 + pkt.aiBatch) / 4));
      if (colonyConfidence < 95) colonyConfidence++;
    } else if (pkt.rejects > 0 && getColonyMiningBatch() > 80) {
      adjustColonyMiningBatch(-10);
      if (colonyConfidence > 5) colonyConfidence--;
    }
    return;
  }

  if (len == sizeof(JanusAgentRewardPacket) && data[0] == 'A' && data[1] == 'R') {
    JanusAgentRewardPacket ar{};
    memcpy(&ar, data, sizeof(ar));
    janusApplyAgentRewardPacket(&ar);
    return;
  }

  if (len == sizeof(EntropyReportV2) && data[0] == 'E' && data[1] == '2') {
    EntropyReportV2 er2{};
    memcpy(&er2, data, sizeof(er2));
    colonyEntropyRx++;
    colonyLastRxMs = millis();
    colonyPeerEntropy = colonyPeerEntropy * 0.84f + er2.local_entropy * 0.16f;
    swarmRememberNodeState(er2.nodeId, 1, er2.local_entropy, er2.prediction_error, er2.sync_hint, er2.fit, er2.values[0], er2.values[1], er2.values[2], er2.values[3]);
    if (er2.values[6] > colonyBestPeerBits) colonyBestPeerBits = (uint32_t)er2.values[6];
    if (er2.values[5] > colonyBestPeerHash) colonyBestPeerHash = (uint32_t)er2.values[5];
    return;
  }

  if (len == sizeof(GroundOrderPacket) && data[0] == 'G' && data[1] == 'O') {
    GroundOrderPacket go;
    memcpy(&go, data, sizeof(go));
    janusGroundOrderMode = go.mode ? 1 : 0;
    janusGroundOrderSector = go.sector;
    janusGroundOrderPriority = go.priority;
    janusGroundOrderMission = go.mission_id;
    janusGroundOrderFlags = go.flags;
    strlcpy(janusGroundOrderTarget, go.target[0] ? go.target : "BASE_HOLD", sizeof(janusGroundOrderTarget));
    janusGroundOrderAtMs = millis();
    janusGroundOrderSeq++;
    Serial.printf("[GROUNDOPS] ORDER rx mode=%u sector=%u prio=%u mission=%lu target=%s\n",
                  (unsigned)janusGroundOrderMode, (unsigned)janusGroundOrderSector,
                  (unsigned)janusGroundOrderPriority, (unsigned long)janusGroundOrderMission, go.target);
    return;
  }

  if (len == sizeof(JobPacket) && data[0] == 'J' && data[1] == 'B') {
    JobPacket job;
    memcpy(&job, data, sizeof(job));
    memcpy(remoteJobId, job.job_id, 8);
    memcpy(remoteHeader, job.header, 80);
    memcpy(remoteTarget, job.target, 32);
    remoteStartNonce = job.start_nonce;
    remoteRangeSize = job.range_size;
    remoteNonce = remoteStartNonce;
    remoteRangeEnd = remoteStartNonce + remoteRangeSize;
    remoteJobRxMs = millis();
    setRemoteJobActive(true);
    colonyMasterPresent = true;
    colonyLastMasterMs = millis();
    setMinerStatus("REMOTE");
    return;
  }

  if (len == sizeof(EntropyReport) && data[0] == 'E' && data[1] == 'R') {
    EntropyReport er;
    memcpy(&er, data, sizeof(er));
    colonyEntropyRx++;
    colonyLastRxMs = millis();
    colonyPeerEntropy = colonyPeerEntropy * 0.86f + er.local_entropy * 0.14f;
    char memId[24]; snprintf(memId, sizeof(memId), "ER1-%u", er.worker_id);
    swarmRememberNodeState(memId, 1, er.local_entropy, er.values[3], 0.0f, 0.0f, er.values[0], er.values[1], er.values[2], er.values[3]);
    return;
  }
}

#endif

uint8_t swarmMemoryFindSlot(const char* nodeId) {
  if (!nodeId || !nodeId[0]) nodeId = "node";
  for (uint8_t i = 0; i < JANUS_SWARM_MEMORY_SLOTS; ++i) {
    if (swarmRecentMemory[i].used && strncmp(swarmRecentMemory[i].nodeId, nodeId, sizeof(swarmRecentMemory[i].nodeId)) == 0) return i;
  }
  uint8_t freeSlot = 255;
  uint32_t oldest = 0xFFFFFFFFUL;
  uint8_t oldestSlot = 0;
  for (uint8_t i = 0; i < JANUS_SWARM_MEMORY_SLOTS; ++i) {
    if (!swarmRecentMemory[i].used && freeSlot == 255) freeSlot = i;
    if (swarmRecentMemory[i].lastSeenMs < oldest) { oldest = swarmRecentMemory[i].lastSeenMs; oldestSlot = i; }
  }
  return freeSlot != 255 ? freeSlot : oldestSlot;
}

void swarmRememberNodeState(const char* nodeId, uint8_t kind, float entropy, float predErr, float sync, float fit, float v0, float v1, float v2, float v3) {
  uint8_t slot = swarmMemoryFindSlot(nodeId);
  SwarmRecentMemorySlot& m = swarmRecentMemory[slot];
  m.used = true;
  strlcpy(m.nodeId, nodeId && nodeId[0] ? nodeId : "node", sizeof(m.nodeId));
  m.lastSeenMs = millis();
  m.kind = kind;
  m.entropy = isfinite(entropy) ? entropy : 0.0f;
  m.predError = isfinite(predErr) ? predErr : 0.0f;
  m.sync = isfinite(sync) ? sync : 0.0f;
  m.fit = isfinite(fit) ? fit : 0.0f;
  m.v0 = isfinite(v0) ? v0 : 0.0f;
  m.v1 = isfinite(v1) ? v1 : 0.0f;
  m.v2 = isfinite(v2) ? v2 : 0.0f;
  m.v3 = isfinite(v3) ? v3 : 0.0f;
}

void saveSwarmMemoryState(bool force) {
  uint32_t now = millis();
  if (!force && now - lastSwarmMemorySaveMs < JANUS_SWARM_MEMORY_SAVE_MS) return;
  lastSwarmMemorySaveMs = now;
  if (!janusSwarmMemoryPrefs.begin("swrm_mem", false)) return;
  janusSwarmMemoryPrefs.putBytes("slots", swarmRecentMemory, sizeof(swarmRecentMemory));
  janusSwarmMemoryPrefs.end();
}

