Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
void loadSwarmMemoryState() {
  if (!janusSwarmMemoryPrefs.begin("swrm_mem", true)) return;
  size_t n = janusSwarmMemoryPrefs.getBytesLength("slots");
  if (n == sizeof(swarmRecentMemory)) janusSwarmMemoryPrefs.getBytes("slots", swarmRecentMemory, sizeof(swarmRecentMemory));
  janusSwarmMemoryPrefs.end();
}

uint8_t swarmFindRemoteProphecySlot(const char* nodeId) {
  if (!nodeId || !nodeId[0]) nodeId = "node";
  for (uint8_t i = 0; i < JANUS_SWARM_REMOTE_PROPHECIES; ++i) {
    if (swarmRemoteProphecies[i].active && strncmp(swarmRemoteProphecies[i].nodeId, nodeId, sizeof(swarmRemoteProphecies[i].nodeId)) == 0) return i;
  }
  uint8_t freeSlot = 255;
  uint32_t oldest = 0xFFFFFFFFUL;
  uint8_t oldestSlot = 0;
  for (uint8_t i = 0; i < JANUS_SWARM_REMOTE_PROPHECIES; ++i) {
    if (!swarmRemoteProphecies[i].active && freeSlot == 255) freeSlot = i;
    if (swarmRemoteProphecies[i].lastSeenMs < oldest) { oldest = swarmRemoteProphecies[i].lastSeenMs; oldestSlot = i; }
  }
  return freeSlot != 255 ? freeSlot : oldestSlot;
}

void onJanusTachyonProphecy(const JanusTachyonProphecyPacket& tp, int8_t rxRssi) {
#if JANUS_TACHYON_PROPHECY_ENABLE
  if (tp.magic[0] != 'T' || tp.magic[1] != 'P' || tp.version != 1) return;
  if (strncmp(tp.nodeId, JANUS_NODE_ID, sizeof(tp.nodeId)) == 0) return;
  uint8_t slot = swarmFindRemoteProphecySlot(tp.nodeId);
  JanusRemoteProphecyState& r = swarmRemoteProphecies[slot];
  r.active = true;
  strlcpy(r.nodeId, tp.nodeId[0] ? tp.nodeId : "node", sizeof(r.nodeId));
  r.lastSeenMs = millis();
  r.seq = tp.seq;
  r.sector = tp.sector & 7;
  r.predictedSector = tp.predictedSector & 7;
  r.confidence = tp.confidence;
  r.flags = tp.flags;
  r.presence_now = isfinite(tp.presence_now) ? tp.presence_now : 0.0f;
  r.motion_now = isfinite(tp.motion_now) ? tp.motion_now : 0.0f;
  r.pred_presence_1 = isfinite(tp.pred_presence_1) ? tp.pred_presence_1 : 0.0f;
  r.pred_motion_1 = isfinite(tp.pred_motion_1) ? tp.pred_motion_1 : 0.0f;
  r.pred_presence_2 = isfinite(tp.pred_presence_2) ? tp.pred_presence_2 : 0.0f;
  r.pred_motion_2 = isfinite(tp.pred_motion_2) ? tp.pred_motion_2 : 0.0f;
  r.pred_presence_3 = isfinite(tp.pred_presence_3) ? tp.pred_presence_3 : 0.0f;
  r.pred_motion_3 = isfinite(tp.pred_motion_3) ? tp.pred_motion_3 : 0.0f;
  r.future_stress = isfinite(tp.future_stress) ? tp.future_stress : 0.0f;
  r.swarm_pressure = isfinite(tp.swarm_pressure) ? tp.swarm_pressure : 0.0f;
  r.rssi = rxRssi;
  tachyonProphecyRx++;
  swarmRememberNodeState(tp.nodeId, 2, tp.presence_now + tp.motion_now, tp.future_stress, (float)tp.confidence / 100.0f, 0.0f, tp.pred_presence_1, tp.pred_motion_1, tp.pred_presence_2, tp.pred_motion_2);
#endif
}

void onJanusKenshiPacket(const JanusKenshiPacket& kp, int8_t rxRssi) {
  if (kp.magic[0] != 'K' || kp.magic[1] != '2' || kp.version != 1) return;
  if (strncmp(kp.nodeId, JANUS_NODE_ID, sizeof(kp.nodeId)) == 0) return;
  colonyLastRxMs = millis();
  colonyPeersSeen++;
  strlcpy(colonyLastPeer, kp.nodeId[0] ? kp.nodeId : "Kenshi", sizeof(colonyLastPeer));
  colonyPeerEntropy = colonyPeerEntropy * 0.88f + kp.entropy * 0.12f;
  swarmRemotePressure = swarmRemotePressure * 0.86f + kp.entropy * 0.02f + kp.confidence * 0.03f;
  kenshiBubbleRx++;
  swarmRememberNodeState(kp.nodeId, 3, kp.entropy, kp.values[4], kp.confidence, kp.values[5], kp.values[0], kp.values[1], kp.values[2], kp.values[3]);
  (void)rxRssi;
}

// Forward declarations for EchoBase microphone state.
// Real definitions live lower near EchoBase globals; tachyon/Kenshi code is above them.
extern float micNoiseFloor;
extern float micSignal;

float swarmMemoryEntropyBias() {
  float sum = 0.0f, wsum = 0.0f;
  uint32_t now = millis();
  for (uint8_t i = 0; i < JANUS_SWARM_MEMORY_SLOTS; ++i) {
    SwarmRecentMemorySlot& m = swarmRecentMemory[i];
    if (!m.used) continue;
    uint32_t age = now - m.lastSeenMs;
    if (age > 60000UL) continue;
    float w = constrain(1.0f - (float)age / 60000.0f, 0.05f, 1.0f) * (0.35f + constrain(m.sync, 0.0f, 1.2f));
    sum += m.entropy * w;
    wsum += w;
  }
  if (wsum <= 0.001f) return swarmLocalEntropy;
  return sum / wsum;
}

void updateSwarmTachyonPrediction() {
#if JANUS_TACHYON_PROPHECY_ENABLE
  static float lastMic = 0.0f;
  static float lastMotion = 0.0f;
  float remoteP = 0.0f, remoteM = 0.0f, wsum = 0.0f;
  uint32_t now = millis();
  for (uint8_t i = 0; i < JANUS_SWARM_REMOTE_PROPHECIES; ++i) {
    JanusRemoteProphecyState& r = swarmRemoteProphecies[i];
    if (!r.active) continue;
    uint32_t age = now - r.lastSeenMs;
    if (age > 20000UL) continue;
    float w = constrain((float)r.confidence / 100.0f, 0.05f, 1.0f) * constrain(1.0f - (float)age / 22000.0f, 0.05f, 1.0f);
    remoteP += r.pred_presence_1 * w;
    remoteM += r.pred_motion_1 * w;
    wsum += w;
  }
  if (wsum > 0.001f) { remoteP /= wsum; remoteM /= wsum; }
  float micNow = swarmMicRms;
  float motionNow = swarmGameSurprise + micSignal * 0.02f + (float)getMinerBestBitsSafe() * 0.015f;
  float trendMic = constrain(micNow - lastMic, -1800.0f, 1800.0f);
  float trendMotion = constrain(motionNow - lastMotion, -3.0f, 3.0f);
  lastMic = micNow;
  lastMotion = motionNow;
  float memE = swarmMemoryEntropyBias();
  swarmPredMic1 = max(0.0f, micNow * 0.62f + (micNow + trendMic * 1.2f) * 0.20f + remoteP * 0.18f);
  swarmPredMic2 = max(0.0f, swarmPredMic1 * 0.70f + (micNow + trendMic * 2.0f) * 0.16f + remoteP * 0.14f);
  swarmPredMic3 = max(0.0f, swarmPredMic2 * 0.74f + memE * 38.0f + remoteP * 0.12f);
  swarmPredMotion1 = max(0.0f, motionNow * 0.58f + (motionNow + trendMotion) * 0.24f + remoteM * 0.18f);
  swarmPredMotion2 = max(0.0f, swarmPredMotion1 * 0.72f + (motionNow + trendMotion * 1.6f) * 0.16f + remoteM * 0.12f);
  swarmPredMotion3 = max(0.0f, swarmPredMotion2 * 0.76f + memE * 0.12f + remoteM * 0.10f);
  swarmFutureStress = constrain(swarmPredictionError * 0.55f + janusPersonalEntropy * 0.35f + swarmRemotePressure * 0.25f + (janusAudioTxEnabled ? 0.08f : 0.0f), 0.0f, 3.0f);
  swarmProphecyConfidence = constrain(0.38f + (1.0f / (1.0f + swarmPredictionError)) * 0.34f + janusVigor * 0.16f + (wsum > 0.01f ? 0.12f : 0.0f), 0.0f, 1.0f);
  uint8_t sectorRaw = (uint8_t)((uint32_t)(micNow * 0.01f + swarmGameSurprise * 3.0f + millis() / 9000UL + getMinerBestBitsSafe()) & 7);
  swarmVirtualSector = sectorRaw;
  swarmPredictedSector = (uint8_t)((sectorRaw + (swarmPredMotion1 > motionNow + 0.35f ? 1 : 0) + (swarmFutureStress > 1.1f ? 2 : 0)) & 7);
  swarmJobState = swarmFutureStress > 1.1f ? 3 : (janusAudioTxEnabled ? 5 : (swarmProphecyConfidence > 0.72f ? 4 : 1));
  snprintf(swarmMemoryLine, sizeof(swarmMemoryLine), "MEM %.1f TP%lu/%lu K%lu/%lu", memE, (unsigned long)tachyonProphecyRx, (unsigned long)tachyonProphecyTx, (unsigned long)kenshiBubbleRx, (unsigned long)kenshiBubbleTx);
#endif
}

void sendSwarmTachyonProphecyPacket(bool force=false) {
#if JANUS_TACHYON_PROPHECY_ENABLE
  uint32_t now = millis();
  uint32_t interval = (swarmFutureStress > 1.1f || janusAudioTxEnabled) ? JANUS_TACHYON_TX_ALERT_MS : JANUS_TACHYON_TX_BG_MS;
  if (!force && now - tachyonLastTxMs < interval) return;
  JanusTachyonProphecyPacket tp{};
  tp.magic[0] = 'T'; tp.magic[1] = 'P';
  tp.version = 1;
  tp.flags = 0;
  if (swarmMicRms > max(260.0f, micNoiseFloor * 2.2f)) tp.flags |= 0x01;
  if (swarmGameSurprise > 0.75f) tp.flags |= 0x02;
  if (swarmFutureStress > 1.1f) tp.flags |= 0x04;
  if (tachyonProphecyRx > 0) tp.flags |= 0x08;
  strlcpy(tp.nodeId, JANUS_NODE_ID, sizeof(tp.nodeId));
  tp.seq = ++tachyonProphecySeq;
  tp.worker_id = swarmWorkerId();
  tp.uptime_ms = now;
  tp.horizon_ms = 2200;
  tp.sector = swarmVirtualSector;
  tp.predictedSector = swarmPredictedSector;
  tp.confidence = (uint8_t)constrain((int)(swarmProphecyConfidence * 100.0f), 0, 100);
  tp.jobState = swarmJobState;
  tp.presence_now = swarmMicRms;
  tp.motion_now = swarmGameSurprise;
  tp.pred_presence_1 = swarmPredMic1;
  tp.pred_motion_1 = swarmPredMotion1;
  tp.pred_presence_2 = swarmPredMic2;
  tp.pred_motion_2 = swarmPredMotion2;
  tp.pred_presence_3 = swarmPredMic3;
  tp.pred_motion_3 = swarmPredMotion3;
  tp.event_eta_ms = (swarmFutureStress > 1.1f) ? 350.0f : 9999.0f;
  tp.future_stress = swarmFutureStress;
  tp.swarm_pressure = swarmRemotePressure;
  if (esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&tp, sizeof(tp)) == ESP_OK) {
    tachyonProphecyTx++;
    tachyonLastTxMs = now;
  }
#else
  (void)force;
#endif
}

