Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
void sendSwarmKenshiPacket(bool force=false) {
  uint32_t now = millis();
  if (!force && now - kenshiLastTxMs < JANUS_KENSHI_BUBBLE_TX_MS) return;
  JanusKenshiPacket kp{};
  kp.magic[0] = 'K'; kp.magic[1] = '2';
  kp.version = 1;
  kp.flags = 0x04; // virtual summary: this node abstracts the game/ground battle outside active Core view
  if (janusAudioTxEnabled || swarmMicRms > max(260.0f, micNoiseFloor * 2.2f)) kp.flags |= 0x01;
  if (swarmFutureStress > 1.1f) kp.flags |= 0x02;
  kp.flags |= 0x08; // future motion base ready / compatible with Blind Eye v2.8
  strlcpy(kp.nodeId, JANUS_NODE_ID, sizeof(kp.nodeId));
  kp.seq = ++kenshiBubbleSeq;
  kp.worker_id = swarmWorkerId();
  kp.uptime_ms = now;
  kp.activeBubbleNodes = (uint8_t)constrain((tachyonProphecyRx > 0 ? 1 : 0) + (janusAudioTxEnabled ? 1 : 0) + (colonyMasterPresent ? 1 : 0), 0, 8);
  kp.virtualNodes = JANUS_SWARM_MEMORY_SLOTS;
  kp.worldFlags = ((uint32_t)kp.flags) | ((uint32_t)getMinerBestBitsSafe() << 8) | ((uint32_t)(janusMoodCode & 0x0F) << 24);
  kp.sector = swarmVirtualSector;
  kp.predictedSector = swarmPredictedSector;
  kp.jobState = swarmJobState;
  kp.priority = (uint8_t)constrain((int)(swarmFutureStress * 55.0f + swarmProphecyConfidence * 80.0f + (janusAudioTxEnabled ? 30 : 0)), 0, 255);
  kp.rssi = (WiFi.status() == WL_CONNECTED) ? (int8_t)WiFi.RSSI() : 0;
  kp.entropy = swarmLocalEntropy + janusPersonalEntropy * 2.0f;
  kp.activity = swarmGameSurprise + swarmMicRms / 1500.0f;
  kp.confidence = swarmProphecyConfidence;
  kp.values[0] = swarmMicRms;
  kp.values[1] = swarmPressureHpa;
  kp.values[2] = swarmTempC;
  kp.values[3] = swarmGameSurprise;
  kp.values[4] = swarmPredictionError;
  kp.values[5] = janusMood;
  if (esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&kp, sizeof(kp)) == ESP_OK) {
    kenshiBubbleTx++;
    kenshiLastTxMs = now;
  }
}

void tachyonProphecyTick() {
  updateSwarmTachyonPrediction();
  sendSwarmTachyonProphecyPacket(false);
  sendSwarmKenshiPacket(false);
  saveSwarmMemoryState(false);
}

void janusColonyEnsurePeer() {
#if JANUS_ENABLE_COLONY
  uint8_t primary = 0;
  wifi_second_chan_t second = WIFI_SECOND_CHAN_NONE;
  esp_wifi_get_channel(&primary, &second);
  if (primary == 0 && WiFi.status() == WL_CONNECTED) primary = WiFi.channel();
  if (primary == 0) primary = 1;

  if (esp_now_is_peer_exist(JANUS_BROADCAST_MAC)) {
    esp_now_del_peer(JANUS_BROADCAST_MAC);
  }

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, JANUS_BROADCAST_MAC, 6);
  peerInfo.channel = primary;   // must match Wi-Fi home channel, otherwise ESP-NOW send fails
  peerInfo.encrypt = false;
  esp_err_t r = esp_now_add_peer(&peerInfo);
  if (r != ESP_OK) {
    Serial.printf("[COLONY] peer add failed ch=%u err=%d\n", primary, (int)r);
  }
#endif
}

void janusColonyBegin() {
#if JANUS_ENABLE_COLONY
  esp_now_deinit();
  if (esp_now_init() != ESP_OK) {
    Serial.println("[COLONY] ESP-NOW init failed");
    return;
  }
  esp_now_register_recv_cb(onColonyRecv);
  janusColonyEnsurePeer();
  Serial.printf("[COLONY] ready node=%s channel=%d\n", JANUS_NODE_ID, WiFi.channel());
#endif
}

void janusColonyTick() {
#if JANUS_ENABLE_COLONY
  uint32_t now = millis();

  if (colonyMasterPresent && now - colonyLastMasterMs > JANUS_MASTER_TIMEOUT_MS) {
    colonyMasterPresent = false;
    setRemoteJobActive(false);
  }

  if (now - colonyLastTxMs >= JANUS_COLONY_PULSE_MS) {
    colonyLastTxMs = now;
    janusColonyEnsurePeer();

    JanusColonyPacket pkt = {};
    memcpy(pkt.magic, "JANUS", 6);
    strlcpy(pkt.nodeId, JANUS_NODE_ID, sizeof(pkt.nodeId));
    strlcpy(pkt.role, "GroundOps", sizeof(pkt.role));
    pkt.seq = ++colonySeq;
    pkt.hashRate = max(minerRemoteHashrate, stratumConnected ? minerRealHashrate : minerLocalHashrate);
    pkt.shares = getMinerSharesSafe() + colonyAgentShareRewardsRx;  // real pool ACCEPTs only: local accepts + Buzz-confirmed remote accepts
    pkt.rejects = getMinerRejectsSafe();
    pkt.bestBits = getMinerBestBitsSafe();
    pkt.diff = (float)minerCurrentDiff;
    pkt.targetBits = minerShareTargetBits;
    pkt.aiBatch = getAdaptiveMiningBatch();
    if (colonyAgentLastRewardMs && now - colonyAgentLastRewardMs < 30000UL && colonyAgentShareRewardsRx > 0) {
      pkt.aiHint = 3;  // recent real pool ACCEPT confirmed by Buzz; Core2 can treat this as Janus progress
    } else {
      pkt.aiHint = getMinerRejectsSafe() > getMinerSharesSafe() + 2 ? 2 : (getRemoteJobActive() ? 3 : 1);
    }
    pkt.jobAgeMs = minerLastJobMs ? (now - minerLastJobMs) : (getRemoteJobActive() ? now - remoteJobRxMs : 0);
    pkt.rssi = (WiFi.status() == WL_CONNECTED) ? (int8_t)WiFi.RSSI() : 0;
    pkt.uptime = now / 1000;

    esp_err_t r = esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&pkt, sizeof(pkt));
    if (r != ESP_OK) {
      colonyTxFail++;
      Serial.printf("[COLONY] heartbeat err=%d ch=%d fail=%lu\n", (int)r, WiFi.channel(), (unsigned long)colonyTxFail);
    } else {
      colonyTxOk++;
    }
  }

  if (now - colonyLastEntropyMs >= JANUS_COLONY_ENTROPY_MS) {
    colonyLastEntropyMs = now;
    EntropyReport er = {};
    er.magic[0] = 'E'; er.magic[1] = 'R';
    er.worker_id = swarmWorkerId();
    er.local_entropy = swarmLocalEntropy;
    er.sensor_flags = 0x0F;
    er.values[0] = swarmMicRms;
    er.values[1] = swarmPressureHpa;
    er.values[2] = swarmGameSurprise;
    er.values[3] = swarmPredictionError;
    esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&er, sizeof(er));

    float pEntropy, pMood, pFatigue, pVigor;
    uint8_t pMoodCode;
    janusPersonalSnapshot(pEntropy, pMood, pFatigue, pVigor, pMoodCode);

    EntropyReportV2 er2 = {};
    er2.magic[0] = 'E'; er2.magic[1] = '2';
    er2.worker_id = swarmWorkerId();
    // Keep the semantic slot compatible with Core2's SWARM/ATOM detector.
    strlcpy(er2.nodeId, JANUS_NODE_ID, sizeof(er2.nodeId));
    er2.local_entropy = swarmLocalEntropy + pEntropy * 2.0f + pFatigue * 0.55f;
    er2.prediction_error = swarmPredictionError + pEntropy * 0.12f + pFatigue * 0.10f;
    er2.sync_hint = janusClampF((1.0f / (1.0f + swarmPredictionError)) * 0.58f + pMood * 0.24f + pVigor * 0.18f - pFatigue * 0.08f, 0.0f, 1.5f);
    er2.fit = janusClampF(0.40f + pMood * 0.34f + pVigor * 0.24f - pFatigue * 0.18f + min(0.28f, swarmLocalEntropy * 0.015f), 0.0f, 1.5f);
    er2.sensor_flags = 0x3F;  // mic + env + game + prediction + personal-agent state
    er2.values[0] = swarmMicRms;
    er2.values[1] = swarmPressureHpa;
    er2.values[2] = swarmTempC;
    er2.values[3] = swarmGameSurprise + pEntropy;
    er2.values[4] = er2.prediction_error;
    er2.values[5] = stratumConnected ? minerRealHashrate : (minerRemoteHashrate ? minerRemoteHashrate : minerLocalHashrate);
    er2.values[6] = getMinerBestBitsSafe();
    er2.values[7] = pMood * 100.0f;
    er2.uptime_ms = now;
    esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&er2, sizeof(er2));

    // v8.22C Core2 compatibility bridge:
    // The main packet above keeps ATOM_SWARM_TRON in the SWARM/GroundOps slot.
    // Old Core2 AUDIO page expects a separate E2 node whose id contains EchoMic/Audio/Mic.
    // Send a lightweight mirror packet so EchoBase microphone telemetry again appears as AUDIO ON.
    EntropyReportV2 mic2 = {};
    mic2.magic[0] = 'E'; mic2.magic[1] = '2';
    mic2.worker_id = swarmWorkerId();
    strlcpy(mic2.nodeId, "EchoMic", sizeof(mic2.nodeId));
    mic2.local_entropy = swarmLocalEntropy;
    mic2.prediction_error = swarmPredictionError;
    mic2.sync_hint = er2.sync_hint;
    mic2.fit = janusClampF(0.35f + min(0.55f, swarmMicRms / 1800.0f) - min(0.25f, (float)swarmMicFails / 200.0f), 0.0f, 1.0f);
    mic2.sensor_flags = 0x03;  // mic + env/BPS; keeps Core2 AUDIO semantic slot alive
    mic2.values[0] = swarmMicRms;
    mic2.values[1] = swarmPressureHpa;
    mic2.values[2] = swarmTempC;
    mic2.values[3] = swarmMicPeak;
    mic2.values[4] = (float)swarmMicFails;
    mic2.values[5] = (float)swarmMicFrames;
    mic2.values[6] = 0.0f;
    mic2.values[7] = pMood * 100.0f;
    mic2.uptime_ms = now;
    esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&mic2, sizeof(mic2));

    static uint32_t lastMicDbg = 0;
    if (now - lastMicDbg > 5000) {
      lastMicDbg = now;
      Serial.printf("[ECHO-MIC] rms=%.1f entropy=%.2f pressure=%.1f temp=%.1f\n",
                    swarmMicRms, swarmLocalEntropy, swarmPressureHpa, swarmTempC);
    }
  }
#endif
}

void janusColonyAITick() {
#if JANUS_ENABLE_COLONY
  static uint32_t lastAiMs = 0;
  uint32_t now = millis();
  if (now - lastAiMs < 3000) return;
  lastAiMs = now;

  // Mode 0 observe, 1 stabilize, 2 learn-from-peer, 3 push.
  if (getMinerRejectsSafe() > 0) {
    colonyAIMode = 1;
    if (getColonyMiningBatch() > 65) adjustColonyMiningBatch(-5);
    if (colonyConfidence > 5) colonyConfidence -= 2;
  } else if (colonyLastRxMs && (now - colonyLastRxMs < 10000) && colonyBestPeerBits >= getMinerBestBitsSafe()) {
    colonyAIMode = 2;
    if (getColonyMiningBatch() < 700) adjustColonyMiningBatch(5);
    if (colonyConfidence < 95) colonyConfidence++;
  } else if (stratumConnected && minerLastJobMs > 0) {
    colonyAIMode = 3;
    if ((minerRealHashrate > 0 || minerRemoteHashrate > 0) && getMinerRejectsSafe() == 0 && getColonyMiningBatch() < 520) adjustColonyMiningBatch(5);
  } else {
    colonyAIMode = 0;
  }

