Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  setColonyMiningBatch(getColonyMiningBatch());
#endif
}


String extranonce1 = "";
int extranonce2_size = 0;
uint32_t extranonce2 = 0;

void initSwarmWorkerName() {
  uint64_t mac = ESP.getEfuseMac();
  uint32_t chip = (uint32_t)(mac & 0xFFFFFF);
  snprintf(BTC_WORKER, sizeof(BTC_WORKER), "Swarm_%06lX", (unsigned long)chip);
  snprintf(JANUS_NODE_ID, sizeof(JANUS_NODE_ID), "%s", BTC_WORKER);
  snprintf(MINER_USER, sizeof(MINER_USER), "%s.%s", BTC_WALLET, BTC_WORKER);
}

String minerUserString() {
  if (MINER_USER[0] == '\0') initSwarmWorkerName();
  return String(MINER_USER);
}

void hexStringToBytes(String hex, uint8_t *bytes) {
  for (int i = 0; i < hex.length(); i += 2) {
    String byteString = hex.substring(i, i + 2);
    bytes[i / 2] = (uint8_t)strtol(byteString.c_str(), NULL, 16);
  }
}

void reverse_bytes(uint8_t *data, int len) {
  for(int i=0; i<len/2; i++) {
    uint8_t t = data[i]; 
    data[i] = data[len-1-i]; 
    data[len-1-i] = t;
  }
}

// Exact NerdMiner prevhash transform: byte-swap inside every 32-bit word.
void reverse_word_bytes(uint8_t *data, int len) {
  for (int off = 0; off + 3 < len; off += 4) {
    uint8_t t0 = data[off + 0];
    uint8_t t1 = data[off + 1];
    data[off + 0] = data[off + 3];
    data[off + 1] = data[off + 2];
    data[off + 2] = t1;
    data[off + 3] = t0;
  }
}

// Extranonce2 must be little-endian hex exactly like NerdMiner/Buzz.
void formatExtranonce2LE(uint64_t value, uint8_t sizeBytes, char* out, size_t outSize) {
  if (!out || outSize == 0) return;
  out[0] = '\0';
  if (sizeBytes == 0) return;
  if (sizeBytes > 8) sizeBytes = 8;
  size_t need = (size_t)sizeBytes * 2 + 1;
  if (outSize < need) return;
  for (uint8_t i = 0; i < sizeBytes; ++i) {
    uint8_t b = (uint8_t)((value >> (8 * i)) & 0xFF);
    snprintf(out + i * 2, outSize - i * 2, "%02x", b);
  }
  out[sizeBytes * 2] = '\0';
}

uint16_t countLeadingZeroBits(const uint8_t h[32]) {
  uint16_t bits = 0;
  for (int i = 0; i < 32; i++) {
    uint8_t b = h[i];
    if (b == 0) { bits += 8; continue; }
    for (int k = 7; k >= 0; k--) {
      if ((b & (1 << k)) == 0) bits++;
      else return bits;
    }
  }
  return bits;
}

void writeLE32(uint8_t* p, uint32_t v) {
  p[0] = v & 0xFF;
  p[1] = (v >> 8) & 0xFF;
  p[2] = (v >> 16) & 0xFF;
  p[3] = (v >> 24) & 0xFF;
}

void hashToShareOrder(const uint8_t in[32], uint8_t out[32]) {
  // Buzz/NerdMiner-compatible gate:
  // SHA256d output is reversed into display/share order, then compared with BE target.
  for (int i = 0; i < 32; ++i) out[i] = in[31 - i];
}

// Bitcoin difficulty-1 share target, big-endian:
// 00000000FFFF0000000000000000000000000000000000000000000000000000
const uint8_t BTC_DIFF1_TARGET[32] = {
  0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,
  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};

void setShareTargetFromDifficulty(double diff) {
  if (diff <= 0.0) diff = 1.0;
  memset(minerShareTarget, 0, sizeof(minerShareTarget));

  // Exact share target used for local prefiltering:
  //   target = BTC_DIFF1_TARGET / difficulty
  // For fractional low-diff pools (0.0001, 0.001, ...), this is a multiplication
  // by round(1/diff). That is enough for public-pool/NerdMiner-style low diff values.
  if (diff < 1.0) {
    uint32_t mul = (uint32_t)(1.0 / diff + 0.5);
    if (mul < 1) mul = 1;
    uint32_t carry = 0;
    for (int i = 31; i >= 0; --i) {
      uint64_t val = (uint64_t)BTC_DIFF1_TARGET[i] * mul + carry;
      minerShareTarget[i] = (uint8_t)(val & 0xFF);
      carry = (uint32_t)(val >> 8);
    }
    if (carry) memset(minerShareTarget, 0xFF, sizeof(minerShareTarget));
  } else {
    uint32_t div = (uint32_t)(diff + 0.5);
    if (div < 1) div = 1;
    uint64_t rem = 0;
    for (int i = 0; i < 32; i++) {
      uint64_t cur = (rem << 8) | BTC_DIFF1_TARGET[i];
      minerShareTarget[i] = (uint8_t)(cur / div);
      rem = cur % div;
    }
  }
  minerShareTargetBits = countLeadingZeroBits(minerShareTarget);
}

bool hashMeetsShareTarget(const uint8_t hash[32]) {
  // Exact 256-bit big-endian comparison: hash <= target.
  // Leading-zero-bit checks are only approximate and were the source of false submits.
  for (int i = 0; i < 32; i++) {
    if (hash[i] < minerShareTarget[i]) return true;
    if (hash[i] > minerShareTarget[i]) return false;
  }
  return true;
}


bool runRemoteColonyMining(mbedtls_sha256_context* ctx,
                           uint8_t hash1[32],
                           uint8_t hash2[32],
                           uint32_t& hashesThisSecond) {
#if JANUS_ENABLE_COLONY
  if (!colonyMasterPresent || !getRemoteJobActive()) return false;
  if (millis() - remoteJobRxMs > JANUS_REMOTE_JOB_TTL_MS) {
    setRemoteJobActive(false);
    return false;
  }

  uint16_t rawBatch = getAdaptiveMiningBatch();
  uint16_t batch = janusAudioTxEnabled ? constrain(rawBatch, (uint16_t)16, (uint16_t)120)
                                       : constrain(rawBatch, (uint16_t)60, (uint16_t)700);
  uint8_t header[80];
  uint8_t jobId[8];
  uint8_t target[32];
  uint8_t shareHash[32];
  uint32_t localEnd;

  memcpy(header, remoteHeader, 80);
  memcpy(jobId, remoteJobId, 8);
  memcpy(target, remoteTarget, 32);
  localEnd = remoteRangeEnd;

  for (uint16_t i = 0; i < batch; i++) {
    if (remoteNonce == localEnd) {
      setRemoteJobActive(false);
      return true;
    }

    uint32_t n = remoteNonce++;
    writeLE32(header + 76, n);

    mbedtls_sha256_starts(ctx, 0); mbedtls_sha256_update(ctx, header, 80); mbedtls_sha256_finish(ctx, hash1);
    mbedtls_sha256_starts(ctx, 0); mbedtls_sha256_update(ctx, hash1, 32); mbedtls_sha256_finish(ctx, hash2);

    hashesThisSecond++;
    minerTotalHashes++;

    // v8.15B: remote Buzz worker mirrors Buzz verification exactly.
    // raw SHA256d -> reversed/display hash -> BE target.
    hashToShareOrder(hash2, shareHash);
    uint16_t bits = countLeadingZeroBits(shareHash);
    updateMinerBestBitsSafe(bits);

    if ((bits >= countLeadingZeroBits(target)) && hashMeetsTargetBytes(shareHash, target)) {
      ShareResponse sr = {};
      sr.magic[0] = 'S'; sr.magic[1] = 'R';
      memcpy(sr.job_id, jobId, 8);
      sr.nonce = n;
      sr.worker_id = swarmWorkerId();
      esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&sr, sizeof(sr));
      remoteSharesSent++;
      minerLastSubmitMs = millis();
      janusMinerGameReward(1, bits);  // praise/ticket only; no buff until Buzz returns A/R with deltaShares>0 after pool ACCEPT
      Serial.printf("[REMOTE] share sent nonce=%08lx bits=%u total=%lu\n",
                    (unsigned long)n, bits, (unsigned long)remoteSharesSent);
    }
  }

