Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  minerLocalFallback = false;
  setMinerStatus("REMOTE");
  return true;
#else
  return false;
#endif
}

// ============================================================
// CORE 0: VAULT (TRUE STRATUM MINER V25)
// ============================================================
void microMinerTask(void *pvParameters) {
  WiFiClient client;
  client.setTimeout(80);

  mbedtls_sha256_context ctx;
  mbedtls_sha256_init(&ctx);

  uint32_t hashesThisSecond = 0;
  uint32_t localHashesThisSecond = 0;
  uint32_t lastHashTick = millis();

  uint8_t blockHeader[80];
  uint8_t localHeader[80];
  uint8_t hash1[32];
  uint8_t hash2[32];
  uint8_t shareHash2[32];

  String currentJobId = "";
  String ntimeHex = "";
  char en2Hex[17] = "";
  uint32_t nonce = 0;
  uint32_t localNonce = esp_random();
  bool jobReady = false;
  bool subscribed = false;
  bool authorized = false;
  uint32_t connectedAtMs = 0;
  setShareTargetFromDifficulty(minerCurrentDiff);

  // Seed local real hash header with wallet/device/time.
  memset(localHeader, 0, sizeof(localHeader));
  writeLE32(localHeader + 0, 0x20000000UL);
  uint8_t seed[160];
  snprintf((char*)seed, sizeof(seed), "JANUS_LOCAL_PREV|%s|%08lx|%lu",
           BTC_WALLET, (unsigned long)(uint32_t)ESP.getEfuseMac(), (unsigned long)millis());
  mbedtls_sha256(seed, strlen((char*)seed), localHeader + 4, 0);
  snprintf((char*)seed, sizeof(seed), "JANUS_LOCAL_MERKLE|%s|%s|%lu",
           BTC_WALLET, BTC_WORKER, (unsigned long)millis());
  mbedtls_sha256(seed, strlen((char*)seed), localHeader + 36, 0);
  writeLE32(localHeader + 72, 0x1e0ffff0UL);

  while(true) {
    // REMOTE colony mode has priority when Buzz master broadcasts work.
    // Local Stratum socket is closed while we work on master's ranges.
    if (colonyMasterPresent && getRemoteJobActive() && remoteJobFresh()) {
      if (client.connected()) client.stop();
      stratumConnected = false;
      jobReady = false;
      subscribed = false;
      authorized = false;
      if (runRemoteColonyMining(&ctx, hash1, hash2, hashesThisSecond)) {
        uint32_t now = millis();
        if (now - lastHashTick >= 1000) {
          minerRemoteHashrate = hashesThisSecond;
          minerLocalHashrate = 0;
          minerRealHashrate = 0;
          hashesThisSecond = 0;
          localHashesThisSecond = 0;
          lastHashTick = now;
        }
        vTaskDelay(pdMS_TO_TICKS(1));
        continue;
      }
    }

    // Single-mode policy: no parallel local/pool farming while Buzz is between fresh jobs.
    if (shouldStayRemoteMode() && !remoteJobFresh()) {
      if (client.connected()) client.stop();
      stratumConnected = false;
      jobReady = false;
      subscribed = false;
      authorized = false;
      minerRemoteHashrate = 0;
      minerLocalHashrate = 0;
      minerRealHashrate = 0;
      setMinerStatus("REMOTE_WAIT");
      vTaskDelay(pdMS_TO_TICKS(80));
      continue;
    }

    if(WiFi.status() != WL_CONNECTED) {
      if (client.connected()) client.stop();
      stratumConnected = false;
      jobReady = false;
      subscribed = false;
      authorized = false;
      minerLocalFallback = true;
      setMinerStatus("WIFI");
      uint32_t nowMs = millis();
      if (nowMs - lastWifiKickMs > 5000) {
        lastWifiKickMs = nowMs;
        minerWifiReconnects++;
        Serial.printf("[MINER] WiFi reconnect #%lu to SSID: %s\n", (unsigned long)minerWifiReconnects, WIFI_SSID);
        WiFi.disconnect(false, false);
        WiFi.begin(WIFI_SSID, WIFI_PASS);
      }
      vTaskDelay(pdMS_TO_TICKS(250));
    } else if(!client.connected()) {
      stratumConnected = false;
      jobReady = false;
      subscribed = false;
      authorized = false;
      minerLocalFallback = true;

      if(client.connect(POOL_HOST, POOL_PORT)) {
        stratumConnected = true;
        minerLastPoolConnectMs = millis();
        setMinerStatus("AUTH");
        Serial.printf("[MINER] Pool connected: %s:%u as %s\n", POOL_HOST, POOL_PORT, MINER_USER);
        client.setTimeout(80);
        connectedAtMs = millis();
        // NerdMiner V2 handshake path for public-pool TCP stratum.
        client.print("{\"id\":10,\"method\":\"mining.suggest_difficulty\",\"params\":[0.0001]}\n");
        client.print("{\"id\":1,\"method\":\"mining.subscribe\",\"params\":[\"NerdMinerV2\"]}\n");
        Serial.println("[MINER] Subscribe sent as NerdMinerV2");
      } else {
        vTaskDelay(pdMS_TO_TICKS(400));
      }
    }

    uint8_t linesPerTick = 0;
    while(client.connected() && client.available() && linesPerTick < 4) {
      linesPerTick++;
      String line = client.readStringUntil('\n');
      line.trim();
      if (!line.length()) continue;

      StaticJsonDocument<3072> doc;
      DeserializationError err = deserializeJson(doc, line);
      if (err) continue;

      if (doc["id"] == 1 && doc["result"].is<JsonArray>()) {
        extranonce1 = doc["result"][1].as<String>();
        extranonce2_size = doc["result"][2].as<int>();
        if (extranonce2_size <= 0 || extranonce2_size > 8) extranonce2_size = 4;
        subscribed = true;
        Serial.printf("[MINER] Subscribed extranonce2_size=%d extranonce1=%s\n", extranonce2_size, extranonce1.c_str());
        String loginStr = String("{\"id\":2,\"method\":\"mining.authorize\",\"params\":[\"") + minerUserString() + "\",\"x\"]}\n";
        client.print(loginStr);
        Serial.printf("[MINER] Authorize sent: %s\n", MINER_USER);
      }

      if (doc["id"] == 2) {
        if (doc["result"] == true) {
          authorized = true;
          setMinerStatus("AUTH OK");
          Serial.println("[MINER] AUTH OK");
        } else {
          authorized = false;
          setMinerStatus("AUTH ERR");
          const char* errText = doc["error"][1] | "authorize failed";
          Serial.printf("[MINER] AUTH REJECT err=%s\n", errText);
        }
      }

      const char* method = doc["method"] | "";
      if (!strcmp(method, "mining.set_difficulty")) {
        minerCurrentDiff = doc["params"][0].as<double>();
        if (minerCurrentDiff <= 0.0) minerCurrentDiff = 1.0;
        setShareTargetFromDifficulty(minerCurrentDiff);
        Serial.printf("[MINER] Pool difficulty=%.8f targetBits=%u\n", minerCurrentDiff, minerShareTargetBits);
      }

      if (!strcmp(method, "mining.notify")) {
        JsonArray params = doc["params"];
        if (params.size() < 8) continue;

        currentJobId = params[0].as<String>();
        String prevhashHex = params[1].as<String>();
        String coinb1Hex = params[2].as<String>();
        String coinb2Hex = params[3].as<String>();
        JsonArray merkleBranch = params[4];
        String versionHex = params[5].as<String>();
        String nbitsHex = params[6].as<String>();
        ntimeHex = params[7].as<String>();

        if (!extranonce2_size) extranonce2_size = 4;
        extranonce2++;
        formatExtranonce2LE((uint64_t)extranonce2, (uint8_t)extranonce2_size, en2Hex, sizeof(en2Hex));

        String coinbase = coinb1Hex + extranonce1 + String(en2Hex) + coinb2Hex;
        if ((coinbase.length() & 1) || coinbase.length() > 768) continue;
        if (ntimeHex.length() != 8 || nbitsHex.length() != 8 || versionHex.length() != 8 || prevhashHex.length() != 64) continue;
        int cbLen = coinbase.length() / 2;
        if (cbLen <= 0 || cbLen > 384) continue;

