Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
        uint8_t cbBytes[384];
        hexStringToBytes(coinbase, cbBytes);

        uint8_t mRoot[32];
        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, cbBytes, cbLen); mbedtls_sha256_finish(&ctx, mRoot);
        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, mRoot, 32); mbedtls_sha256_finish(&ctx, mRoot);

        for (JsonVariant v : merkleBranch) {
          String branchHex = v.as<String>();
          if (branchHex.length() != 64) continue;
          uint8_t branchBytes[32];
          hexStringToBytes(branchHex, branchBytes);
          uint8_t concat[64];
          memcpy(concat, mRoot, 32);
          memcpy(concat + 32, branchBytes, 32);
          mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, concat, 64); mbedtls_sha256_finish(&ctx, mRoot);
          mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, mRoot, 32); mbedtls_sha256_finish(&ctx, mRoot);
        }

        memset(blockHeader, 0, 80);
        hexStringToBytes(versionHex, blockHeader);
        reverse_bytes(blockHeader, 4);

        // v8.12 direct miner uses the same proven Buzz/NerdMiner layout:
        // prevhash = word byte-swap, merkle = mbedtls SHA256d bytes without final reverse,
        // ntime/nbits = little-endian, nonce = little-endian in header.
        hexStringToBytes(prevhashHex, blockHeader + 4);
        reverse_word_bytes(blockHeader + 4, 32);

        memcpy(blockHeader + 36, mRoot, 32);

        uint8_t ntimeLE[4];
        uint8_t nbitsLE[4];
        hexStringToBytes(ntimeHex, ntimeLE); reverse_bytes(ntimeLE, 4);
        hexStringToBytes(nbitsHex, nbitsLE); reverse_bytes(nbitsLE, 4);
        memcpy(blockHeader + 68, ntimeLE, 4);
        memcpy(blockHeader + 72, nbitsLE, 4);

        nonce = esp_random();
        jobReady = true;
        minerLocalFallback = false;
        minerLastJobMs = millis();
        setMinerStatus("HASH");
        Serial.printf("[MINER] Job %s ready, hashing...\n", currentJobId.c_str());
      }

      if (doc["id"] == 4) {
        if (doc["result"] == true) {
          uint32_t sharesNow = incMinerSharesSafe();
          minerLastAcceptMs = millis();
          janusMinerGameReward(3, (uint16_t)getMinerBestBitsSafe());
          setMinerStatus("ACCEPT");
          Serial.printf("[MINER] ACCEPT share=%lu reject=%lu\n", (unsigned long)sharesNow, (unsigned long)getMinerRejectsSafe());
        } else {
          uint32_t rejectsNow = incMinerRejectsSafe();
          setMinerStatus("REJECT");
          janusPersonalNudge(6, 0);
          const char* errText = doc["error"][1] | "unknown";
          Serial.printf("[MINER] REJECT attempts=%lu rejects=%lu err=%s\n", (unsigned long)minerSubmitAttempts, (unsigned long)rejectsNow, errText);
        }
      }
    }

    if (client.connected() && (!subscribed || !authorized) && connectedAtMs && millis() - connectedAtMs > 12000) {
      Serial.println("[MINER] Handshake timeout, reconnecting");
      client.stop();
      stratumConnected = false;
      jobReady = false;
      subscribed = false;
      authorized = false;
      vTaskDelay(pdMS_TO_TICKS(250));
      continue;
    }

    if (jobReady && client.connected()) {
      uint16_t localBatch = getAdaptiveMiningBatch();
      for(int batch = 0; batch < localBatch; batch++) {
        nonce++;
        writeLE32(blockHeader + 76, nonce);

        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, blockHeader, 80); mbedtls_sha256_finish(&ctx, hash1);
        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, hash1, 32); mbedtls_sha256_finish(&ctx, hash2);
        hashesThisSecond++;
        minerTotalHashes++;

        // v8.15B: same share-order gate as the working Buzz/Core2 worker path.
        hashToShareOrder(hash2, shareHash2);
        uint16_t bits = countLeadingZeroBits(shareHash2);
        updateMinerBestBitsSafe(bits);

        // Submit only when reversed/display hash <= pool share target.
        if ((bits >= minerShareTargetBits) && hashMeetsShareTarget(shareHash2)) {
          if (ntimeHex.length() != 8 || currentJobId.length() == 0) continue;
          char n_hex[9];
          snprintf(n_hex, sizeof(n_hex), "%08lx", (unsigned long)nonce);
          String submitMsg = String("{\"id\":4,\"method\":\"mining.submit\",\"params\":[\"") +
                             minerUserString() + "\",\"" + currentJobId + "\",\"" +
                             String(en2Hex) + "\",\"" + ntimeHex + "\",\"" + String(n_hex) + "\"]}";
          client.println(submitMsg);
          minerSubmitAttempts++;
          minerLastSubmitMs = millis();
          janusMinerGameReward(2, bits);
          Serial.printf("[MINER] Submit #%lu nonce=%s bits=%u target=%u best=%u H=%lu\n",
                        (unsigned long)minerSubmitAttempts, n_hex, bits, minerShareTargetBits, getMinerBestBitsSafe(), (unsigned long)minerRealHashrate);
        }
      }
    } else {
      minerLocalFallback = true;
      writeLE32(localHeader + 68, 1700000000UL + millis() / 1000UL);
      for (int batch = 0; batch < 180; batch++) {
        writeLE32(localHeader + 76, localNonce++);
        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, localHeader, 80); mbedtls_sha256_finish(&ctx, hash1);
        mbedtls_sha256_starts(&ctx, 0); mbedtls_sha256_update(&ctx, hash1, 32); mbedtls_sha256_finish(&ctx, hash2);
        localHashesThisSecond++;
        minerTotalHashes++;

        hashToShareOrder(hash2, shareHash2);
        uint16_t bits = countLeadingZeroBits(shareHash2);
        updateMinerBestBitsSafe(bits);
        static uint32_t lastLocalOmenMs = 0;
        if (bits >= 22 && millis() - lastLocalOmenMs > 7000UL) {
          lastLocalOmenMs = millis();
          janusMinerGameReward(4, bits);
        }
      }
    }

    uint32_t now = millis();
    if (now - lastHashTick >= 1000) {
      minerRealHashrate = hashesThisSecond;
      minerRemoteHashrate = 0;
      minerLocalHashrate = localHashesThisSecond;
      hashesThisSecond = 0;
      localHashesThisSecond = 0;
      lastHashTick = now;
    }

    vTaskDelay(pdMS_TO_TICKS(1));
  }
}


QMP6988 qmp;
M5Canvas canvas(&M5.Display);

M5EchoBase echobase;
static uint8_t echoMicBuf[1024];
bool echoBaseReady = false;
uint32_t echoMicReadOk = 0;
uint32_t echoMicReadFail = 0;
uint32_t lastEchoMicPollMs = 0;
uint32_t lastShockwaveMicMs = 0;
float micNoiseFloor = 180.0f;
float micSignal = 0.0f;

#if JANUS_AUDIO_LIVE_TX_ENABLE
static int16_t janusAudioTxPcm16[JANUS_AUDIO_TX_PCM_SAMPLES];
static int16_t janusAudioTxDown8k[JANUS_AUDIO_FRAME_SAMPLES];

static const int16_t janusAdpcmStepTable[89] = {
  7,8,9,10,11,12,13,14,16,17,19,21,23,25,28,31,34,37,41,45,
  50,55,60,66,73,80,88,97,107,118,130,143,157,173,190,209,230,253,279,307,
  337,371,408,449,494,544,598,658,724,796,876,963,1060,1166,1282,1411,1552,1707,1878,2066,
  2272,2499,2749,3024,3327,3660,4026,4428,4871,5358,5894,6484,7132,7845,8630,9493,10442,11487,
  12635,13899,15289,16818,18500,20350,22385,24623,27086,29794,32767
};
static const int8_t janusAdpcmIndexTable[16] = {
  -1,-1,-1,-1,2,4,6,8,-1,-1,-1,-1,2,4,6,8
};

