Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
int16_t janusAudioSoftClip32(int32_t v) {
  if (v > 27000) return 27000;
  if (v < -27000) return -27000;
  return (int16_t)v;
}

uint8_t janusPcm16ToULaw(int16_t sample) {
  const int16_t BIAS = 0x84;
  const int16_t CLIP = 32635;
  uint8_t sign = 0;
  int16_t pcm = sample;
  if (pcm < 0) {
    if (pcm == INT16_MIN) pcm = -32767;
    pcm = -pcm;
    sign = 0x80;
  }
  if (pcm > CLIP) pcm = CLIP;
  pcm += BIAS;

  uint8_t exponent = 7;
  for (int16_t expMask = 0x4000; (pcm & expMask) == 0 && exponent > 0; expMask >>= 1) exponent--;
  uint8_t mantissa = (uint8_t)((pcm >> (exponent + 3)) & 0x0F);
  return (uint8_t)(~(sign | (exponent << 4) | mantissa));
}

uint8_t janusAdpcmEncodeNibble(int16_t sample) {
  int step = janusAdpcmStepTable[janusAudioTxAdpcmIndex];
  int diff = (int)sample - (int)janusAudioTxAdpcmPredictor;
  uint8_t code = 0;
  if (diff < 0) { code = 8; diff = -diff; }

  int delta = step >> 3;
  if (diff >= step) { code |= 4; diff -= step; delta += step; }
  if (diff >= (step >> 1)) { code |= 2; diff -= (step >> 1); delta += (step >> 1); }
  if (diff >= (step >> 2)) { code |= 1; delta += (step >> 2); }

  int pred = janusAudioTxAdpcmPredictor;
  if (code & 8) pred -= delta;
  else pred += delta;
  if (pred > 32767) pred = 32767;
  if (pred < -32768) pred = -32768;
  janusAudioTxAdpcmPredictor = (int16_t)pred;

  int idx = (int)janusAudioTxAdpcmIndex + janusAdpcmIndexTable[code & 0x0F];
  if (idx < 0) idx = 0;
  if (idx > 88) idx = 88;
  janusAudioTxAdpcmIndex = (uint8_t)idx;
  return code & 0x0F;
}


#if JANUS_AUDIO_SNAPSHOT_MODE
void janusAudioTxSnapshotReset() {
  janusAudioSnapCaptureIdx = 0;
  janusAudioSnapSendIdx = 0;
  janusAudioSnapReadyFrames = 0;
  janusAudioSnapSending = false;
  janusAudioSnapLastSendMs = 0;
}

void janusAudioTxSnapshotSendTick(uint32_t now) {
  if (!janusAudioSnapSending) return;
  if (janusAudioSnapSendIdx >= janusAudioSnapReadyFrames) {
    janusAudioTxSnapshotReset();
    return;
  }
  if (now - janusAudioSnapLastSendMs < JANUS_AUDIO_SNAPSHOT_SEND_GAP_MS) return;
  janusAudioSnapLastSendMs = now;

  uint8_t idx = janusAudioSnapSendIdx;
  uint16_t payloadBytes = janusAudioSnapPayload[idx];
  if (payloadBytes == 0 || payloadBytes > JANUS_AUDIO_FRAME_MAX_BYTES) {
    janusAudioSnapSendIdx++;
    return;
  }

  JanusAudioFramePacket af{};
  af.magic[0] = 'A';
  af.magic[1] = 'F';
  af.version = 1;
  af.codec = JANUS_AUDIO_CODEC_ULAW;
  af.seq = ++janusAudioTxSeq;
  af.sampleRate = JANUS_AUDIO_SAMPLE_RATE;
  af.samples = janusAudioSnapSamples[idx] ? janusAudioSnapSamples[idx] : JANUS_AUDIO_FRAME_SAMPLES;
  af.predictor = 0;
  af.stepIndex = 0;
  af.flags = janusAudioSnapFlags[idx];
  memcpy(af.data, janusAudioSnapData[idx], payloadBytes);

  const uint16_t headerLen = sizeof(JanusAudioFramePacket) - JANUS_AUDIO_FRAME_MAX_BYTES;
  esp_err_t err = esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&af, headerLen + payloadBytes);
  if (err == ESP_OK) janusAudioTxFrames++;
  else janusAudioTxSendFail++;

  janusAudioSnapSendIdx++;
  if (janusAudioSnapSendIdx >= janusAudioSnapReadyFrames) {
    janusAudioSnapClips++;
    janusAudioTxSnapshotReset();
  }
}
#endif

void janusAudioTxTick() {
  uint32_t now = millis();

  if (janusAudioTxEnabled && (now - janusAudioTxLastControlMs > JANUS_AUDIO_CONTROL_TIMEOUT_MS)) {
    janusAudioTxEnabled = false;
    janusAudioTxAdpcmReady = false;
#if JANUS_AUDIO_SNAPSHOT_MODE
    janusAudioTxSnapshotReset();
#endif
    Serial.println("[AUDIO-TX] timeout: Core2 AC pulse lost, stream stopped");
  }

  if (!janusAudioTxEnabled) return;
#if JANUS_AUDIO_SNAPSHOT_MODE
  if (janusAudioSnapSending) {
    janusAudioTxSnapshotSendTick(now);
    return;
  }
#endif
  if (!echoBaseReady) {
    janusAudioTxReadFail++;
    if (now - janusAudioTxLastLogMs > 5000UL) {
      janusAudioTxLastLogMs = now;
      Serial.printf("[AUDIO-TX] EchoBase not ready, ctrl=%lu readFail=%lu\n",
                    (unsigned long)janusAudioTxControlsRx, (unsigned long)janusAudioTxReadFail);
    }
    return;
  }
  if (now - janusAudioTxLastFrameMs < JANUS_AUDIO_FRAME_MS) return;
  janusAudioTxLastFrameMs = now;

  // Exact cadence: 20 ms at 16 kHz = 320 PCM samples = 640 bytes.
  // We downsample to 8 kHz and encode 160 samples into 160 u-law bytes.
  bool ok = echobase.record((uint8_t*)janusAudioTxPcm16, sizeof(janusAudioTxPcm16));
  if (!ok) {
    janusAudioTxReadFail++;
    return;
  }

  // First pass: 16 kHz -> 8 kHz speech decimator + voice-formant cleanup.
  // Keyboard clicks were already clear; speech was "utrobnyy" because low-frequency body
  // dominated the u-law stream. This pass cuts mud below voice range and lifts consonants.
  int64_t sumAbsIn = 0;
  int32_t peakIn = 0;
  for (uint16_t i = 0; i < JANUS_AUDIO_FRAME_SAMPLES; ++i) {
    uint16_t p = i * 2;
    int32_t s0 = janusAudioTxPcm16[p];
    int32_t s1 = janusAudioTxPcm16[p + 1];
    int32_t raw = (s0 + s1) >> 1;

    // Very slow DC removal: only offset, not speech bass.
    janusAudioTxDc = janusAudioTxDc * 0.9990f + (float)raw * 0.0010f;
    float centered = (float)raw - janusAudioTxDc;

    // Speech high-pass around the mud/body area. This is intentionally stronger than
    // the old DC-only filter: it removes the "barrel/uterus" tone but keeps voice rhythm.
    janusAudioTxSpeechLp = janusAudioTxSpeechLp * 0.86f + centered * 0.14f;
    float hp = centered - janusAudioTxSpeechLp;

    // Mild pre-emphasis for consonants. Strong values made clicks great but speech harsh;
    // 0.38 keeps syllables readable on Core2's tiny speaker.
    float shaped = hp + 0.38f * (hp - janusAudioTxPreemphPrev);
    janusAudioTxPreemphPrev = hp;

    // Tiny de-zipper: enough to calm single-sample spikes, not enough to muffle speech.
    shaped = shaped * 0.82f + janusAudioTxLastShaped * 0.18f;
    janusAudioTxLastShaped = shaped;

    int16_t shaped16 = janusAudioSoftClip32((int32_t)shaped);
    janusAudioTxDown8k[i] = shaped16;
    int32_t a = shaped16 < 0 ? -(int32_t)shaped16 : (int32_t)shaped16;
    sumAbsIn += a;
    if (a > peakIn) peakIn = a;
  }

  float avgAbsIn = (float)sumAbsIn / (float)JANUS_AUDIO_FRAME_SAMPLES;
  if (avgAbsIn < janusAudioTxNoiseFloor * 1.65f) {
    janusAudioTxNoiseFloor = janusAudioTxNoiseFloor * 0.990f + avgAbsIn * 0.010f;
  }
  janusAudioTxNoiseFloor = janusClampF(janusAudioTxNoiseFloor, 8.0f, 1200.0f);

  // v8.28 VOICEFORMANT:
  // Keep speech loud enough, but use peak-aware AGC so vowels do not become a monster growl.
  float speechFloor = max(180.0f, janusAudioTxNoiseFloor * 1.45f);
  float effective = max(0.0f, avgAbsIn - speechFloor * 0.25f);
  float desiredGain = JANUS_AUDIO_AGC_TARGET_ABS / (effective + 260.0f);
  if (peakIn > 2200) {
    float peakSafeGain = 23000.0f / ((float)peakIn + 160.0f);
    if (peakSafeGain < desiredGain) desiredGain = peakSafeGain;
  }
  desiredGain = janusClampF(desiredGain, JANUS_AUDIO_AGC_MIN_GAIN, JANUS_AUDIO_AGC_MAX_GAIN);
  float agcAlpha = (desiredGain < janusAudioTxAgcGain) ? 0.26f : 0.055f;
  janusAudioTxAgcGain = janusAudioTxAgcGain * (1.0f - agcAlpha) + desiredGain * agcAlpha;
  janusAudioTxAgcGain = janusClampF(janusAudioTxAgcGain, JANUS_AUDIO_AGC_MIN_GAIN, JANUS_AUDIO_AGC_MAX_GAIN);

  JanusAudioFramePacket af{};
  af.magic[0] = 'A';
  af.magic[1] = 'F';
  af.version = 2;
  af.codec = JANUS_AUDIO_CODEC_ACTIVE;
  af.seq = ++janusAudioTxSeq;
  af.sampleRate = JANUS_AUDIO_SAMPLE_RATE;
  af.samples = JANUS_AUDIO_FRAME_SAMPLES;
  af.flags = 0;

  int64_t sumAbsOut = 0;
  int32_t peakOut = 0;
  uint16_t payloadBytes = 0;

  if (JANUS_AUDIO_CODEC_ACTIVE == JANUS_AUDIO_CODEC_ADPCM4) {
    if (!janusAudioTxAdpcmReady) {
      janusAudioTxAdpcmPredictor = janusAudioTxDown8k[0];
      janusAudioTxAdpcmIndex = 0;
      janusAudioTxAdpcmReady = true;
    }
    af.predictor = janusAudioTxAdpcmPredictor;
    af.stepIndex = janusAudioTxAdpcmIndex;

    uint8_t packed = 0;
    for (uint16_t i = 0; i < JANUS_AUDIO_FRAME_SAMPLES; ++i) {
      int32_t centered = janusAudioTxDown8k[i];
      int32_t a = centered < 0 ? -centered : centered;

      // Very gentle gate: reduce room hiss but do not chop syllables.
      float gate = 1.0f;
      float gateEdge = max(JANUS_AUDIO_NOISE_GATE_ABS, janusAudioTxNoiseFloor * 1.20f);
      if ((float)a < gateEdge) gate = 0.35f + 0.65f * ((float)a / gateEdge);

      int32_t boosted = (int32_t)((float)centered * janusAudioTxAgcGain * gate);
      int16_t out = janusAudioSoftClip32(boosted);
      int32_t oa = out < 0 ? -(int32_t)out : (int32_t)out;
      sumAbsOut += oa;
      if (oa > peakOut) peakOut = oa;
      if (oa > (int32_t)(janusAudioTxNoiseFloor * 3.0f)) af.flags |= 0x01;

      uint8_t n = janusAdpcmEncodeNibble(out);
      if ((i & 1) == 0) packed = n;
      else {
        af.data[payloadBytes++] = (uint8_t)(packed | (n << 4));
        if (payloadBytes >= JANUS_AUDIO_FRAME_MAX_BYTES) break;
      }
    }
  } else {
    af.version = 1;
    af.codec = JANUS_AUDIO_CODEC_ULAW;
    af.samples = min((uint16_t)JANUS_AUDIO_FRAME_SAMPLES, (uint16_t)JANUS_AUDIO_FRAME_MAX_BYTES);
    af.predictor = 0;
    af.stepIndex = 0;
    for (uint16_t i = 0; i < af.samples; ++i) {
      int32_t centered = janusAudioTxDown8k[i];
      int32_t a0 = centered < 0 ? -centered : centered;

      // Do not hard-gate speech. Just attenuate tiny room rumble so endings of words survive.
      float gate = 1.0f;
      float gateEdge = max(JANUS_AUDIO_NOISE_GATE_ABS, janusAudioTxNoiseFloor * 0.85f);
      if ((float)a0 < gateEdge) gate = 0.62f + 0.38f * ((float)a0 / gateEdge);

      int32_t boosted = (int32_t)((float)centered * janusAudioTxAgcGain * gate);
      int32_t ab = boosted < 0 ? -boosted : boosted;
      if (ab > 21500) {
        int32_t sign = boosted < 0 ? -1 : 1;
        boosted = sign * (21500 + ((ab - 21500) >> 2));
      }
      int16_t out = janusAudioSoftClip32(boosted);
      int32_t oa = out < 0 ? -(int32_t)out : (int32_t)out;
      sumAbsOut += oa;
      if (oa > peakOut) peakOut = oa;
      if (oa > (int32_t)(janusAudioTxNoiseFloor * 1.50f)) af.flags |= 0x01;
      af.data[payloadBytes++] = janusPcm16ToULaw(out);
    }
  }

  float avgOut = (float)sumAbsOut / (float)max(1U, (unsigned)af.samples);
  swarmMicFrames++;
  echoMicReadOk++;
  swarmMicRms = swarmMicRms * 0.80f + avgOut * 0.20f;
  if ((float)peakOut > swarmMicPeak) swarmMicPeak = (float)peakOut;
  else swarmMicPeak *= 0.975f;
  micSignal = micSignal * 0.82f + avgOut * 0.18f;

