Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
#if JANUS_AUDIO_SNAPSHOT_MODE
  // v8.29: do not send every frame live. Store a clean speech clip in RAM,
  // then burst it to Core2 so Core2 can buffer before playback.
  if (payloadBytes > 0 && payloadBytes <= JANUS_AUDIO_FRAME_MAX_BYTES && janusAudioSnapCaptureIdx < JANUS_AUDIO_SNAPSHOT_FRAMES) {
    uint8_t si = janusAudioSnapCaptureIdx;
    memcpy(janusAudioSnapData[si], af.data, payloadBytes);
    janusAudioSnapPayload[si] = payloadBytes;
    janusAudioSnapSamples[si] = af.samples;
    janusAudioSnapFlags[si] = af.flags;
    janusAudioSnapCaptureIdx++;
    if (janusAudioSnapCaptureIdx >= JANUS_AUDIO_SNAPSHOT_FRAMES) {
      janusAudioSnapReadyFrames = janusAudioSnapCaptureIdx;
      janusAudioSnapSendIdx = 0;
      janusAudioSnapSending = true;
      janusAudioSnapLastSendMs = 0;
    }
  }
#else
  const uint16_t headerLen = sizeof(JanusAudioFramePacket) - JANUS_AUDIO_FRAME_MAX_BYTES;
  esp_err_t err = esp_now_send(JANUS_BROADCAST_MAC, (uint8_t*)&af, headerLen + payloadBytes);
  if (err == ESP_OK) janusAudioTxFrames++;
  else janusAudioTxSendFail++;
#endif

  if (now - janusAudioTxLastLogMs > 5000UL) {
    janusAudioTxLastLogMs = now;
    Serial.printf("[AUDIO-TX] radio=%d codec=%u tx=%lu fail=%lu readFail=%lu seq=%u samples=%u bytes=%u in=%.0f out=%.0f pin=%ld pout=%ld gain=%.2f nf=%.0f snap=%u/%u send=%u clips=%lu\n",
                  janusAudioTxEnabled ? 1 : 0, (unsigned)af.codec,
                  (unsigned long)janusAudioTxFrames,
                  (unsigned long)janusAudioTxSendFail,
                  (unsigned long)janusAudioTxReadFail,
                  (unsigned)janusAudioTxSeq,
                  (unsigned)af.samples, (unsigned)payloadBytes,
                  avgAbsIn, avgOut, (long)peakIn, (long)peakOut, janusAudioTxAgcGain, janusAudioTxNoiseFloor,
                  (unsigned)janusAudioSnapCaptureIdx, (unsigned)JANUS_AUDIO_SNAPSHOT_FRAMES,
                  janusAudioSnapSending ? 1 : 0, (unsigned long)janusAudioSnapClips);
  }
}
#else
void janusAudioTxTick() {}
#endif

class NeuralSwarm {
private:
  Base bases[2];
  Unit units[Config::MAX_UNITS];
  Resource resources[Config::MAX_RESOURCES];
  Particle particles[Config::MAX_PARTICLES];
  SpitFX spits[Config::MAX_SPITS];
  BgDrop bgDrops[15];
  SwarmMicroAI ai;

  GameState state;
  float gameOverTimer;
  uint32_t lastTick;
  float fixedAccumulator = 0.0f;
  uint32_t nextSoundTime;
  uint32_t runStartMs;
  uint32_t survivalMs;
  uint32_t lastSaveMs;
  uint32_t lastAutoBuyMs;

  uint8_t brightLevels[5] = {255, 150, 70, 20, 0};
  int brightIdx = 0;
  bool soundEnabled = true;
  float avgFps = 60.0f;
  float shockwaveRadius = 0.0f;
  int gridHead[64];
  int gridNext[Config::MAX_UNITS];
  bool spatialReady = false;

  uint16_t playerColor = 0;
  uint16_t enemyColor = 0;
  uint32_t gold = 0;
  uint32_t xp = 0;
  uint16_t level = 1;
  uint16_t wave = 0;
  uint16_t enemiesLeftToSpawn = 0;
  uint16_t enemiesKilledThisWave = 0;
  float waveSpawnTimer = 0.0f;
  float betweenWaveTimer = 4.0f;
  float throneCooldown = 0.0f;

  // Visual survival layer: fixed day/night cycle + lightweight procedural weather.
  float dayPhase = 0.18f;
  uint8_t weatherMode = 0;      // 0 clear, 1 rain, 2 storm, 3 fog, 4 heat haze
  float weatherStrength = 0.0f;
  uint32_t lastWeatherShiftMs = 0;

  // Per-wave random sensor boons. Reset at every wave start; not saved.
  float waveDamageMul = 1.0f;
  float waveFireMul = 1.0f;
  float waveLootMul = 1.0f;
  float waveShieldMul = 1.0f;
  char waveBoostLine[28] = "B:NONE";

  uint8_t dmgLv = 0;
  uint8_t fireLv = 0;
  uint8_t throneLv = 0;
  uint8_t unitLv = 0;
  uint8_t towerLv = 0;
  uint8_t repairLv = 0;
  uint8_t towerCount = 0;
  uint8_t heroLimit = 1;
  char heroLine[32] = "MECH L1";
  int cachedHeroIdx = -1;
  uint32_t cachedHeroUntilMs = 0;
  uint16_t modelId = 1;

  // v8.16 GroundOps: Core2 commands planetary sectors, Stick delivers/pilots mechs,
  // this ATOM-SWARM-TRON executes the ground layer.
  // 0 = base/throne defense; 1 = hero/mecha raid / sabotage operation.
  uint8_t groundMode = 0;
  uint8_t groundStyle = 0;      // 0=RTS base hold, 1=hero sabotage raid, 2=throne siege
  uint8_t groundSector = 0;
  uint8_t groundPriority = 0;
  uint8_t groundBiome = 0;      // procedural planet skin
  uint8_t groundFaction = 0;
  uint16_t groundFlags = 0;
  uint32_t groundSeed = 0x1138A11FUL;
  uint32_t groundMissionId = 1;
  uint32_t groundBannerUntilMs = 0;
  float raidFocusX = 98.0f;
  float raidFocusY = 30.0f;
  char groundMissionLine[32] = "BASE HOLD";
  char groundPlanetLine[32] = "JANUS ARK";
  char groundObjectiveLine[32] = "DERZHAT TRON";
  uint32_t lastGroundOrderSeq = 0;

  // v8.18: Core2 orders are mission contracts, not instant background swaps.
  // Latest Core2 G/O packet is queued and committed only on a clean wave boundary.
  bool pendingGroundOrder = false;
  uint32_t pendingGroundOrderSeq = 0;
  uint8_t pendingGroundMode = 0;
  uint8_t pendingGroundSector = 0;
  uint8_t pendingGroundPriority = 0;
  uint16_t pendingGroundFlags = 0;
  uint32_t pendingGroundMission = 0;
  char pendingGroundTarget[16] = "BASE_HOLD";
  uint32_t groundToastUntilMs = 0;
  uint32_t groundMissionStartMs = 0;
  uint8_t activeMissionWave = 0;
  char groundToastLine[32] = "CORE2 ORDER READY";

  // v8.22: mining luck and personal agent state form a positive gameplay loop. Shares/accepts/Buzz Agent rewards become
  // station morale, wave boons, particles and small resource rewards.
  uint8_t miningLuckCharges = 0;
  float miningLuckPower = 0.0f;
  uint32_t miningToastUntilMs = 0;
  char miningToastLine[32] = "HASH LUCK";

  uint32_t bestMs[4] = {0,0,0,0};
  uint16_t bestWave[4] = {0,0,0,0};
  uint16_t bestColor[4] = {0,0,0,0};
  uint16_t bestModel[4] = {0,0,0,0};
  bool recordsLoaded = false;
  uint32_t recordsToastUntilMs = 0;

  struct SaveRec {
    uint32_t magic;
    uint16_t version;
    uint16_t crc;
    uint32_t bestMs[4];
    uint16_t bestWave[4];
    uint16_t bestColor[4];
    uint16_t bestModel[4];
    uint16_t nextModel;
  };

