Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  float distSq(float x1, float y1, float x2, float y2) const {
    return (x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1);
  }

  uint16_t crc16(const uint8_t* data, size_t n) {
    uint16_t c = 0xA55A;
    for (size_t i = 0; i < n; i++) c = (uint16_t)((c << 5) ^ (c >> 11) ^ data[i]);
    return c;
  }

  uint16_t dimColor(uint16_t c, float k) {
    k = constrain(k, 0.0f, 1.0f);
    uint8_t r = ((c >> 11) & 0x1F) * 255 / 31;
    uint8_t g = ((c >> 5) & 0x3F) * 255 / 63;
    uint8_t b = (c & 0x1F) * 255 / 31;
    return canvas.color565((uint8_t)(r*k), (uint8_t)(g*k), (uint8_t)(b*k));
  }

  uint16_t brightenColor(uint16_t c, float add) {
    add = constrain(add, 0.0f, 1.0f);
    int r = ((c >> 11) & 0x1F) * 255 / 31;
    int g = ((c >> 5) & 0x3F) * 255 / 63;
    int b = (c & 0x1F) * 255 / 31;
    r = r + (int)((255 - r) * add);
    g = g + (int)((255 - g) * add);
    b = b + (int)((255 - b) * add);
    return canvas.color565(r, g, b);
  }

  uint16_t getNeonColor() {
    uint8_t r = (esp_random() % 156) + 100;
    uint8_t g = (esp_random() % 156) + 100;
    uint8_t b = (esp_random() % 156) + 100;
    if (r <= g && r <= b) r /= 3;
    else if (g <= r && g <= b) g /= 3;
    else b /= 3;
    return canvas.color565(r, g, b);
  }

  uint16_t tournamentColor(uint16_t id) {
    // Larger deterministic color ladder for the endless survival tournament.
    static const uint8_t pal[][3] = {
      { 80,255,150},{255, 72,120},{ 86,190,255},{255,190, 72},
      {205, 96,255},{ 92,255,230},{255,120, 70},{170,255, 90},
      {255,105,210},{120,145,255},{255,230, 90},{ 70,230,120},
      {240,130,255},{ 95,220,255},{255,150,120},{185,255,180},
      {255, 90, 90},{120,255,190},{180,120,255},{255,210,140},
      {110,210,120},{140,235,255},{255,135,185},{210,235, 95},
      {105,170,255},{255,170, 95},{180,255,235},{230,110,170},
      {150,255,105},{115,255,255},{255,245,130},{200,160,255}
    };
    const uint8_t n = sizeof(pal) / sizeof(pal[0]);
    uint8_t idx = (uint8_t)((id - 1) % n);
    uint8_t cycle = (uint8_t)(((id - 1) / n) % 4);
    int r = pal[idx][0], g = pal[idx][1], b = pal[idx][2];
    if (cycle == 1) { r = (r * 4) / 5; g = min(255, (g * 11) / 10); b = min(255, (b * 11) / 10); }
    else if (cycle == 2) { r = min(255, (r * 11) / 10); g = (g * 4) / 5; b = min(255, (b * 11) / 10); }
    else if (cycle == 3) { r = min(255, (r * 11) / 10); g = min(255, (g * 11) / 10); b = (b * 4) / 5; }
    return canvas.color565((uint8_t)r, (uint8_t)g, (uint8_t)b);
  }

  const char* compactK(uint32_t v) {
    static char buf[4][12];
    static uint8_t idx = 0;
    char* b = buf[idx++ & 3];
    if (v < 1000UL) snprintf(b, 12, "%lu", (unsigned long)v);
    else if (v < 1000000UL) snprintf(b, 12, "%luk", (unsigned long)(v / 1000UL));
    else if (v < 1000000000UL) snprintf(b, 12, "%lukk", (unsigned long)(v / 1000000UL));
    else snprintf(b, 12, "%lukkk", (unsigned long)(v / 1000000000UL));
    return b;
  }

  const char* fmtTime(uint32_t ms) {
    static char b[12];
    uint32_t s = ms / 1000UL;
    uint32_t m = s / 60UL;
    s %= 60UL;
    snprintf(b, sizeof(b), "%02lu:%02lu", (unsigned long)m, (unsigned long)s);
    return b;
  }

  const char* weatherName() const {
    switch (weatherMode) {
      case 1: return "RAIN";
      case 2: return "STORM";
      case 3: return "FOG";
      case 4: return "HEAT";
      default: return "CLEAR";
    }
  }

  const char* dayName() const {
    // Day phase 0.00..0.49 = day, 0.50..0.99 = night.
    return (dayPhase < 0.50f) ? "DAY" : "NIGHT";
  }

  uint32_t groundMix32(uint32_t x) const {
    x ^= x >> 16; x *= 0x7feb352dUL;
    x ^= x >> 15; x *= 0x846ca68bUL;
    x ^= x >> 16;
    return x;
  }

  const char* groundBiomeName() const {
    switch (groundBiome % 8) {
      case 0: return "ARK MEADOW";
      case 1: return "DUNE RUINS";
      case 2: return "TOXIC SWAMP";
      case 3: return "ICE VAULT";
      case 4: return "EMBER HIVE";
      case 5: return "OCEAN MOON";
      case 6: return "CRYSTAL FIELD";
      default: return "VOID DUST";
    }
  }

  const char* groundFactionName() const {
    switch (groundFaction % 6) {
      case 0: return "THG";
      case 1: return "PIR";
      case 2: return "CORP";
      case 3: return "MERC";
      case 4: return "WILD";
      default: return "XENO";
    }
  }

  const char* groundStyleName() const {
    if (groundStyle == 1) return "HERO RAID";
    if (groundStyle == 2) return "TRON DEF";
    return "RTS HOLD";
  }

  const char* groundModeName() const {
    return groundStyleName();
  }

  uint16_t groundBiomeColor(float dl) const {
    uint8_t light = (uint8_t)constrain((int)(dl * 90.0f), 20, 95);
    switch (groundBiome % 8) {
      case 0: return canvas.color565(5 + light/5, 20 + light/3, 10 + light/6);
      case 1: return canvas.color565(32 + light/2, 22 + light/3, 8 + light/8);
      case 2: return canvas.color565(8 + light/8, 24 + light/3, 18 + light/5);
      case 3: return canvas.color565(10 + light/6, 18 + light/3, 36 + light/2);
      case 4: return canvas.color565(42 + light/3, 9 + light/8, 4 + light/12);
      case 5: return canvas.color565(4 + light/10, 12 + light/4, 34 + light/2);
      case 6: return canvas.color565(20 + light/4, 10 + light/5, 32 + light/2);
      default: return canvas.color565(5 + light/12, 5 + light/12, 12 + light/4);
    }
  }

  uint8_t inferGroundStyle(uint8_t rawMode, const char* target, uint32_t mission, uint8_t prio, uint16_t flags) const {
    if (rawMode >= 2) return rawMode % 3;
    if (target) {
      if (strstr(target, "RAID") || strstr(target, "SAB") || strstr(target, "HERO")) return 1;
      if (strstr(target, "TRON") || strstr(target, "THRONE") || strstr(target, "SIEGE")) return 2;
    }
    if (rawMode == 1) return 1;
    if (flags & 0x0002) return 2;
    if (prio >= 230) return ((mission ^ groundSector) & 1) ? 2 : 1;
    if ((mission % 11UL) == 3UL) return 1;
    if ((mission % 7UL) == 2UL) return 2;
    return 0;
  }

  void configureGroundWorld(uint8_t sector, uint8_t prio, uint32_t mission, uint16_t flags, const char* target) {
    groundSector = sector & 31;
    groundPriority = prio;
    groundFlags = flags;
    if (mission) groundMissionId = mission;
    groundSeed = groundMix32(0x4A414E55UL ^ ((uint32_t)groundSector << 24) ^ groundMissionId ^ ((uint32_t)prio << 9) ^ flags);
    groundBiome = (uint8_t)(groundMix32(groundSeed ^ 0xB10B10UL) % 8);
    groundFaction = (uint8_t)(groundMix32(groundSeed ^ 0xFA0700UL) % 6);
    groundStyle = inferGroundStyle(janusGroundOrderMode, target, groundMissionId, prio, flags);
    groundMode = (groundStyle == 1) ? 1 : 0;

    const char* st = groundStyleName();
    snprintf(groundMissionLine, sizeof(groundMissionLine), "%s S%02u", st, (unsigned)groundSector);
    snprintf(groundPlanetLine, sizeof(groundPlanetLine), "%s/%s", groundBiomeName(), groundFactionName());
    if (groundStyle == 1) snprintf(groundObjectiveLine, sizeof(groundObjectiveLine), "DIVERSIYA BAZY");
    else if (groundStyle == 2) snprintf(groundObjectiveLine, sizeof(groundObjectiveLine), "ZASHITA TRONA");
    else snprintf(groundObjectiveLine, sizeof(groundObjectiveLine), "BAZA I RESURS");

    uint32_t r = groundMix32(groundSeed ^ 0xC0FFEEUL);
    raidFocusX = 16.0f + (float)(r % 96);
    raidFocusY = 16.0f + (float)((r >> 8) % 96);
    groundBannerUntilMs = millis() + 8000UL;

    // Planet seed influences the living world immediately.
    weatherMode = (groundBiome == 3) ? 3 : (groundBiome == 4 ? 4 : (groundBiome == 2 ? 1 : (uint8_t)(r % 5)));
    weatherStrength = 0.25f + (float)((r >> 16) & 0x3F) / 90.0f;
    enemyColor = (groundFaction == 0) ? canvas.color565(210,40,220) :
                 (groundFaction == 1) ? canvas.color565(230,70,70) :
                 (groundFaction == 2) ? canvas.color565(220,160,60) :
                 (groundFaction == 3) ? canvas.color565(120,180,240) :
                 (groundFaction == 4) ? canvas.color565(80,220,110) : canvas.color565(210,230,80);
  }

  void updateRaidFocus() {
    if (groundStyle != 1) return;
    uint32_t now = millis();
    float t = (now * 0.00045f) + (float)(groundSeed & 1023) * 0.01f;
    raidFocusX = 64.0f + cosf(t * 1.7f) * 42.0f + sinf(t * 0.31f) * 10.0f;
    raidFocusY = 64.0f + sinf(t * 1.3f) * 42.0f + cosf(t * 0.27f) * 10.0f;
    raidFocusX = constrain(raidFocusX, 10.0f, 118.0f);
    raidFocusY = constrain(raidFocusY, 10.0f, 118.0f);
  }

  void drawGroundTiles(uint32_t now, float dl) {
    uint16_t base = groundBiomeColor(dl);
    uint16_t line = dimColor(base, 0.68f);
    uint8_t step = 16;
    int scrollX = (groundStyle == 1) ? (int)((now / 80 + (groundSeed & 31)) % step) : (int)((groundSeed >> 3) & 15);
    int scrollY = (groundStyle == 1) ? (int)((now / 110 + ((groundSeed >> 8) & 31)) % step) : (int)((groundSeed >> 12) & 15);
    for (int y = -scrollY; y < Config::SCREEN_H; y += step) {
      for (int x = -scrollX; x < Config::SCREEN_W; x += step) {
        uint32_t n = groundMix32(groundSeed ^ (uint32_t)(x + 300) * 73UL ^ (uint32_t)(y + 500) * 197UL);
        uint16_t c = (n & 1) ? dimColor(base, 0.72f) : dimColor(base, 0.58f);
        canvas.fillRect(x, y, step, step, c);
        if ((n & 7) == 0) canvas.drawPixel(x + (n & 15), y + ((n >> 4) & 15), brightenColor(c, 0.40f));
      }
    }
    for (int i = 0; i < 6; ++i) {
      int x = (int)((groundMix32(groundSeed ^ (uint32_t)i * 99UL) + now / (groundStyle == 1 ? 18 : 90)) & 127);
      int y = (int)((groundMix32(groundSeed ^ (uint32_t)i * 177UL) + now / (groundStyle == 1 ? 23 : 130)) & 127);
      canvas.drawLine(x - 3, y, x + 3, y, line);
      canvas.drawLine(x, y - 3, x, y + 3, line);
    }
    if (groundStyle == 1) {
      canvas.drawCircle((int)raidFocusX, (int)raidFocusY, 5, TFT_RED);
      canvas.drawLine((int)raidFocusX - 6, (int)raidFocusY, (int)raidFocusX + 6, (int)raidFocusY, TFT_RED);
      canvas.drawLine((int)raidFocusX, (int)raidFocusY - 6, (int)raidFocusX, (int)raidFocusY + 6, TFT_RED);
    }
  }

  void drawGroundMissionOverlay(uint32_t now) {
    // Temporary compact toast only. Persistent objective text stays in the tiny HUD line,
    // so the fight view remains clean.
    if (!groundBannerUntilMs || now > groundBannerUntilMs) return;
    uint16_t frame = (groundStyle == 1) ? canvas.color565(255, 140, 40) : (groundStyle == 2 ? TFT_RED : playerColor);
    canvas.drawRoundRect(3, 23, 122, 15, 3, dimColor(frame, 0.78f));
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(brightenColor(frame, 0.18f), TFT_TRANSPARENT);
    canvas.drawString(groundMissionLine, 6, 25);
    canvas.setTextDatum(TR_DATUM);
    canvas.setTextColor(TFT_SILVER, TFT_TRANSPARENT);
    canvas.drawString(groundStyle == 1 ? "SAB" : (groundStyle == 2 ? "DEF" : "HOLD"), 121, 25);
    canvas.setTextDatum(TL_DATUM);
  }

