Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void drawGroundToast(uint32_t now) {
    if (!groundToastUntilMs || now > groundToastUntilMs) return;
    uint16_t c = pendingGroundOrder ? canvas.color565(255, 190, 80) : dimColor(playerColor, 0.90f);
    canvas.drawRoundRect(5, 39, 118, 12, 3, dimColor(c, 0.65f));
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(c, TFT_TRANSPARENT);
    canvas.drawString(groundToastLine, 8, 41);
  }

  bool canCommitGroundOrder() const {
    return state == GameState::BETWEEN_WAVES && enemiesLeftToSpawn == 0 && aliveEnemies() == 0;
  }

  void commitPendingGroundOrder() {
    if (!pendingGroundOrder) return;
    uint8_t oldMode = janusGroundOrderMode;
    janusGroundOrderMode = pendingGroundMode;
    configureGroundWorld(pendingGroundSector, pendingGroundPriority,
                         pendingGroundMission ? pendingGroundMission : (groundMissionId + 1),
                         pendingGroundFlags, pendingGroundTarget);
    janusGroundOrderMode = oldMode;
    pendingGroundOrder = false;
    groundBannerUntilMs = millis() + 4200UL;
    groundToastUntilMs = millis() + 2200UL;
    snprintf(groundToastLine, sizeof(groundToastLine), "CORE2 START S%02u", (unsigned)groundSector);

    if (groundStyle == 1 && aliveHeroes() < 1) {
      if (gold < 30) gold += 30;
      gold = (gold > 30) ? (gold - 30) : 0;
      spawnUnit(0, Role::HERO, bases[0].x, bases[0].y - 12);
      playBeep(1450, 70);
    } else if (groundStyle == 2) {
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + 30.0f);
      shockwaveRadius = max(shockwaveRadius, 12.0f);
      spawnParticle(bases[0].x, bases[0].y, TFT_RED, 14);
      playBeep(360, 70);
    } else {
      spawnParticle(bases[0].x, bases[0].y, playerColor, 9);
      playBeep(650, 35);
    }
  }

  void applyGroundOrders() {
    uint32_t seq = janusGroundOrderSeq;
    if (seq != 0 && seq != lastGroundOrderSeq) {
      lastGroundOrderSeq = seq;
      pendingGroundOrder = true;
      pendingGroundOrderSeq = seq;
      pendingGroundMode = janusGroundOrderMode ? 1 : 0;
      pendingGroundSector = janusGroundOrderSector;
      pendingGroundPriority = janusGroundOrderPriority;
      pendingGroundMission = janusGroundOrderMission ? janusGroundOrderMission : (groundMissionId + 1);
      pendingGroundFlags = janusGroundOrderFlags;
      strlcpy(pendingGroundTarget, janusGroundOrderTarget[0] ? janusGroundOrderTarget : "BASE_HOLD", sizeof(pendingGroundTarget));
      groundToastUntilMs = millis() + 5200UL;
      snprintf(groundToastLine, sizeof(groundToastLine), "CORE2 QUEUE S%02u", (unsigned)(pendingGroundSector & 31));
      if (state == GameState::BETWEEN_WAVES) betweenWaveTimer = max(betweenWaveTimer, 1.2f);
      playBeep(880, 24);
    }

    if (pendingGroundOrder && canCommitGroundOrder()) commitPendingGroundOrder();
  }

  float dayLight() const {
    // 0.35 at night, 1.0 at noon; one sin call per frame, not per-pixel.
    float v = 0.5f + 0.5f * sinf(dayPhase * 6.2831853f);
    return 0.35f + v * 0.65f;
  }

  float enemyWeatherSpeedMul() const {
    float m = 1.0f;
    if (weatherMode == 1) m -= 0.05f + weatherStrength * 0.05f;      // rain mud
    else if (weatherMode == 2) m -= 0.08f + weatherStrength * 0.07f; // storm pressure
    else if (weatherMode == 3) m -= 0.03f;                           // fog hesitation
    else if (weatherMode == 4) m += 0.02f + weatherStrength * 0.03f; // heat frenzy
    if (dayPhase >= 0.50f) m += 0.035f;                              // night mobs push harder
    return constrain(m, 0.78f, 1.12f);
  }

  void resetWaveBoosts() {
    waveDamageMul = 1.0f;
    waveFireMul = 1.0f;
    waveLootMul = 1.0f;
    waveShieldMul = 1.0f;
    strlcpy(waveBoostLine, "B:NONE", sizeof(waveBoostLine));
  }

  void applySensorWaveBoost() {
    resetWaveBoosts();
    uint32_t r = esp_random() % 100;

    // Real sensor bias comes first; random fallback keeps every wave slightly different.
    if (swarmPressureHpa > 0.1f && swarmPressureHpa < 1007.0f) {
      waveShieldMul = 0.88f;
      waveLootMul = 1.08f;
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + 18.0f + wave * 1.5f);
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:LOWP");
    } else if (swarmPressureHpa > 1022.0f) {
      gold += 18 + wave * 2;
      waveLootMul = 1.10f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:HIGHP");
    } else if (swarmTempC > 29.5f) {
      waveDamageMul = 1.16f;
      waveFireMul = 1.10f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:HEAT");
    } else if (swarmTempC > 0.1f && swarmTempC < 18.0f) {
      waveFireMul = 1.14f;
      waveLootMul = 1.12f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:COLD");
    } else if (weatherMode == 2) {
      waveDamageMul = 1.08f;
      waveShieldMul = 0.94f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:STORM");
    } else if (weatherMode == 1 || weatherMode == 3) {
      waveLootMul = 1.14f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), weatherMode == 1 ? "B:RAIN" : "B:FOG");
    } else if (r < 22) {
      gold += 12 + wave;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:GOLD");
    } else if (r < 44) {
      waveDamageMul = 1.10f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:DMG");
    } else if (r < 66) {
      waveFireMul = 1.10f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:FIRE");
    } else if (r < 84) {
      waveLootMul = 1.12f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:LOOT");
    } else {
      waveShieldMul = 0.92f;
      snprintf(waveBoostLine, sizeof(waveBoostLine), "B:WARD");
    }

    // Personal agent state is not a fake share. It only shapes how well the same wave boon is used.
    float pEntropy, pMood, pFatigue, pVigor;
    uint8_t pMoodCode;
    janusPersonalSnapshot(pEntropy, pMood, pFatigue, pVigor, pMoodCode);
    float personalUse = constrain(0.84f + pMood * 0.18f + pVigor * 0.16f - pFatigue * 0.18f - pEntropy * 0.05f, 0.70f, 1.18f);
    waveDamageMul = constrain(waveDamageMul * personalUse, 0.72f, 1.65f);
    waveFireMul = constrain(waveFireMul * (0.90f + pVigor * 0.16f - pFatigue * 0.06f), 0.75f, 1.55f);
    waveLootMul = constrain(waveLootMul * (0.92f + pMood * 0.18f), 0.80f, 1.90f);
    if (pFatigue > 0.74f) waveShieldMul = min(1.08f, waveShieldMul + 0.04f);

    // Tiny visual/audio confirmation, cheap and readable.
    spawnParticle(bases[0].x, bases[0].y, playerColor, 10);
    playBeep(720, 28);
  }

  void playBeep(int freq, int duration) {
    if (!soundEnabled) return;
    uint32_t now = millis();
    if (now >= nextSoundTime) {
      M5.Speaker.tone(freq, duration);
      nextSoundTime = now + duration;
    }
  }

  void drawSpark(int x, int y, uint16_t col) {
    canvas.drawPixel(x, y, col);
    canvas.drawPixel(x - 1, y, dimColor(col, 0.65f));
    canvas.drawPixel(x + 1, y, dimColor(col, 0.65f));
    canvas.drawPixel(x, y - 1, dimColor(col, 0.65f));
    canvas.drawPixel(x, y + 1, dimColor(col, 0.65f));
  }

  void addBeam(float x1, float y1, float x2, float y2, uint16_t color, float life = 0.18f) {
    for (auto& s : spits) {
      if (!s.active) {
        s.active = true;
        s.startX = x1; s.startY = y1; s.endX = x2; s.endY = y2;
        s.color = color; s.life = life; s.maxLife = life;
        return;
      }
    }
  }

  void spawnParticle(float x, float y, uint16_t color, int count) {
    for (int i = 0; i < count; i++) {
      for (auto& p : particles) {
        if (!p.active) {
          p.active = true;
          p.x = x; p.y = y;
          float angle = (float)(esp_random() % 628) * 0.01f;
          float speed = (float)((esp_random() % 45) + 10);
          p.vx = cosf(angle) * speed;
          p.vy = sinf(angle) * speed;
          p.life = ((esp_random() % 24) + 10) * 0.012f;
          p.color = color;
          break;
        }
      }
    }
  }

