Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void spawnLoot(float x, float y, uint16_t amount) {
    for (auto& r : resources) {
      if (!r.active) {
        r.active = true;
        r.x = constrain(x + (int)(esp_random() % 13) - 6, 3.0f, (float)Config::SCREEN_W - 3.0f);
        r.y = constrain(y + (int)(esp_random() % 13) - 6, 3.0f, (float)Config::SCREEN_H - 3.0f);
        r.amount = amount;
        return;
      }
    }
  }

  void absorbLootToThrone(float x, float y, uint16_t amount) {
    // v8.15B: mob drops no longer clutter the map.
    // The throne absorbs loot immediately as gold/xp/resources.
    if (amount == 0) amount = 1;
    gold += amount;
    xp += max(1, (int)amount / 2);
    bases[0].resources += amount;

    addBeam(x, y, bases[0].x, bases[0].y, TFT_YELLOW, 0.18f);
    spawnParticle(x, y, TFT_YELLOW, 4);
    spawnParticle(bases[0].x, bases[0].y, TFT_YELLOW, 9);

    if (xp >= level * 70UL) {
      xp -= level * 70UL;
      level++;
      gold += 18 + level * 4;
      spawnParticle(bases[0].x, bases[0].y, playerColor, 12);
      playBeep(1450, 35);
    }
  }

  int aliveEnemies() const {
    int n = 0;
    for (int i = 0; i < Config::MAX_UNITS; i++) if (units[i].active && units[i].team == 1) n++;
    return n;
  }

  int aliveFriendlies() const {
    int n = 0;
    for (int i = 0; i < Config::MAX_UNITS; i++) if (units[i].active && units[i].team == 0 && units[i].role != Role::TOWER) n++;
    return n;
  }

  int aliveTowers() const {
    int n = 0;
    for (int i = 0; i < Config::MAX_UNITS; i++) if (units[i].active && units[i].team == 0 && units[i].role == Role::TOWER) n++;
    return n;
  }

  int aliveHeroes() const {
    int n = 0;
    for (int i = 0; i < Config::MAX_UNITS; i++) if (units[i].active && units[i].team == 0 && units[i].role == Role::HERO) n++;
    return n;
  }

  enum HeroSkillBits : uint16_t {
    SK_HOOK   = 1 << 0,
    SK_FIRE   = 1 << 1,
    SK_SHIELD = 1 << 2,
    SK_LASER  = 1 << 3,
    SK_NOVA   = 1 << 4,
    SK_CHAIN  = 1 << 5,
    SK_BLINK  = 1 << 6,
    SK_FROST  = 1 << 7,
    SK_POISON = 1 << 8,
    SK_TOTEM  = 1 << 9,
    SK_METEOR = 1 << 10
  };

  const char* heroClassName(uint8_t c) const {
    static const char* names[] = {"VANGUARD", "PYRO-MECH", "PSION", "PAL-MECH", "SABOTEUR", "ENGINEER"};
    return names[c % 6];
  }

  const char* heroClassShort(uint8_t c) const {
    static const char* names[] = {"VNG", "PYM", "PSI", "PLM", "SAB", "ENG"};
    return names[c % 6];
  }

  uint8_t heroSkillCount(uint16_t m) const {
    uint8_t n = 0;
    while (m) { n += (m & 1); m >>= 1; }
    return n;
  }

  uint16_t randomSkillBit() const {
    return (uint16_t)(1u << (esp_random() % 11));
  }

  uint16_t pickRandomOwnedSkill(uint16_t mask) const {
    uint16_t owned[12];
    uint8_t n = 0;
    for (uint8_t i = 0; i < 11; ++i) {
      uint16_t b = (uint16_t)(1u << i);
      if (mask & b) owned[n++] = b;
    }
    if (!n) return 0;
    return owned[esp_random() % n];
  }

  uint16_t nextSkillBit(uint16_t cur) const {
    for (uint8_t i = 0; i < 11; ++i) {
      uint16_t b = (uint16_t)(1u << i);
      if (cur == b) return (i == 10) ? 0 : (uint16_t)(1u << (i + 1));
    }
    return 0;
  }

  uint8_t skillIndex(uint16_t bit) const {
    for (uint8_t i = 0; i < 11; ++i) {
      if (bit == (uint16_t)(1u << i)) return i;
    }
    return 255;
  }

  uint8_t heroSkillManaCost(uint16_t bit, uint8_t heroLv) const {
    uint8_t base = 8;
    if (bit == SK_HOOK || bit == SK_BLINK) base = 6;
    else if (bit == SK_FIRE || bit == SK_POISON || bit == SK_CHAIN) base = 10;
    else if (bit == SK_SHIELD || bit == SK_FROST || bit == SK_LASER) base = 12;
    else if (bit == SK_NOVA || bit == SK_TOTEM) base = 16;
    else if (bit == SK_METEOR) base = 18;
    uint8_t discount = min((uint8_t)4, (uint8_t)(heroLv / 3));
    return max((int)4, (int)base - (int)discount);
  }

  uint16_t pickReadyOwnedSkill(const Unit& u) const {
    uint16_t ready[12];
    uint8_t n = 0;
    for (uint8_t i = 0; i < 11; ++i) {
      uint16_t b = (uint16_t)(1u << i);
      if (!(u.skillMask & b)) continue;
      if (u.skillCd[i] > 0.05f) continue;
      if (u.mana + 0.01f < (float)heroSkillManaCost(b, u.heroLv)) continue;
      ready[n++] = b;
    }
    if (!n) return 0;
    return ready[esp_random() % n];
  }

  bool heroHasReadySkill(const Unit& u) const {
    return pickReadyOwnedSkill(u) != 0;
  }

  void tickHeroManaAndSkillCooldowns(Unit& u, float dt) {
    if (u.role != Role::HERO) {
      if (u.skillCooldown > 0) u.skillCooldown -= dt;
      return;
    }

    if (u.maxMana <= 1.0f) {
      u.maxMana = 42.0f + u.heroLv * 5.0f;
      u.mana = u.maxMana;
    }

    float minCd = 999.0f;
    bool anyCd = false;
    for (uint8_t i = 0; i < 11; ++i) {
      if (u.skillCd[i] > 0.0f) {
        u.skillCd[i] = max(0.0f, u.skillCd[i] - dt);
        if (u.skillCd[i] > 0.0f) {
          anyCd = true;
          if (u.skillCd[i] < minCd) minCd = u.skillCd[i];
        }
      }
    }

    float regen = 3.2f + u.heroLv * 0.38f + repairLv * 0.12f;
    if (state == GameState::BETWEEN_WAVES) regen *= 1.6f;
    u.mana = min(u.maxMana, u.mana + regen * dt);

    // Legacy aggregate is only used as a tiny visual pulse. It no longer blocks every skill.
    u.skillCooldown = anyCd ? minCd : 0.0f;
  }

  uint16_t heroClassColor(uint8_t c) {
    switch (c % 6) {
      case 0: return canvas.color565(230, 214, 150); // knight
      case 1: return canvas.color565(255, 118, 54);  // pyro
      case 2: return canvas.color565(160, 92, 255);  // arcane
      case 3: return canvas.color565(112, 242, 190); // paladin
      case 4: return canvas.color565(80, 180, 255);  // rogue
      default: return canvas.color565(230, 230, 255); // tech
    }
  }

  uint16_t randomHeroSkills(uint8_t heroClass) {
    uint16_t m = 0;
    switch (heroClass % 6) {
      case 0: m = SK_HOOK | SK_SHIELD | SK_NOVA; break;
      case 1: m = SK_FIRE | SK_METEOR | SK_NOVA; break;
      case 2: m = SK_CHAIN | SK_LASER | SK_FROST; break;
      case 3: m = SK_SHIELD | SK_TOTEM | SK_CHAIN; break;
      case 4: m = SK_HOOK | SK_BLINK | SK_POISON; break;
      default: m = SK_LASER | SK_FIRE | SK_TOTEM; break;
    }
    uint8_t extra = 1 + (esp_random() % 3);
    while (extra--) m |= randomSkillBit();
    return m;
  }

  Role randomFriendlyRole() {
    uint8_t r = esp_random() % 100;
    if (r < 22) return Role::GUARD;
    if (r < 44) return Role::ARCHER;
    if (r < 60) return Role::MAGE;
    if (r < 72) return Role::BRUTE;
    if (r < 86) return Role::HEALER;
    return Role::REPAIR;
  }

  void announceHero(Unit& u) {
    snprintf(heroLine, sizeof(heroLine), "MECH %s L%u", heroClassName(u.heroClass), u.heroLv);
    cachedHeroUntilMs = 0;
  }

  int focusHeroIndex() {
    uint32_t now = millis();
    if (cachedHeroIdx >= 0 && cachedHeroIdx < Config::MAX_UNITS && now < cachedHeroUntilMs) {
      Unit& h = units[cachedHeroIdx];
      if (h.active && h.team == 0 && h.role == Role::HERO) return cachedHeroIdx;
    }
    int best = -1;
    int score = -1;
    for (int i = 0; i < Config::MAX_UNITS; ++i) {
      if (!units[i].active || units[i].team != 0 || units[i].role != Role::HERO) continue;
      int s = (int)units[i].heroLv * 1000 + (int)units[i].heroXp;
      if (s > score) { score = s; best = i; }
    }
    cachedHeroIdx = best;
    cachedHeroUntilMs = now + 500;
    return best;
  }

  int tdPathCount() const { return 10; }

