Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void tdPathPoint(int idx, float& x, float& y) const {
    // Hand-made Atom S3R maze: mobs enter from upper-left and snake to edge throne.
    switch (idx) {
      case 0: x = 6;   y = 18; break;
      case 1: x = 32;  y = 18; break;
      case 2: x = 32;  y = 50; break;
      case 3: x = 14;  y = 50; break;
      case 4: x = 14;  y = 82; break;
      case 5: x = 56;  y = 82; break;
      case 6: x = 56;  y = 34; break;
      case 7: x = 86;  y = 34; break;
      case 8: x = 86;  y = 78; break;
      default: x = bases[0].x - 13; y = bases[0].y; break;
    }
  }

  void tdPathStart(float& x, float& y) const {
    tdPathPoint(0, x, y);
  }

  void tdAdvanceEnemyWaypoint(Unit& u, float& tx, float& ty) {
    int wp = u.targetResId;
    if (wp < 0) wp = 0;
    if (wp >= tdPathCount()) {
      tx = bases[0].x;
      ty = bases[0].y;
      u.targetResId = tdPathCount();
      return;
    }

    tdPathPoint(wp, tx, ty);
    if (distSq(u.x, u.y, tx, ty) < 42.0f) {
      wp++;
      u.targetResId = wp;
      if (wp >= tdPathCount()) {
        tx = bases[0].x;
        ty = bases[0].y;
      } else {
        tdPathPoint(wp, tx, ty);
      }
    }
  }

  void drawMazePath() {
    uint16_t wall = canvas.color565(31, 38, 52);
    uint16_t path = canvas.color565(10, 14, 22);
    uint16_t edge = dimColor(playerColor, 0.28f);
    float x1, y1, x2, y2;
    tdPathPoint(0, x1, y1);
    canvas.fillCircle((int)x1, (int)y1, 5, canvas.color565(26, 14, 18));
    canvas.drawCircle((int)x1, (int)y1, 6, dimColor(enemyColor, 0.55f));
    for (int i = 1; i < tdPathCount(); ++i) {
      tdPathPoint(i, x2, y2);
      canvas.drawLine((int)x1, (int)y1 - 4, (int)x2, (int)y2 - 4, wall);
      canvas.drawLine((int)x1, (int)y1 + 4, (int)x2, (int)y2 + 4, wall);
      canvas.drawLine((int)x1, (int)y1, (int)x2, (int)y2, path);
      canvas.drawLine((int)x1, (int)y1 - 1, (int)x2, (int)y2 - 1, dimColor(path, 0.85f));
      canvas.drawLine((int)x1, (int)y1 + 1, (int)x2, (int)y2 + 1, dimColor(path, 0.85f));
      canvas.drawCircle((int)x2, (int)y2, 3, edge);
      x1 = x2;
      y1 = y2;
    }
    canvas.setTextSize(1);
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(dimColor(enemyColor, 0.75f), TFT_TRANSPARENT);
    canvas.drawString(groundMode ? "DROP" : "INV", 2, 6);
  }

  void spawnUnit(uint8_t team, Role role, float x, float y) {
    // v8.15B: the throne can command only one living hero at a time.
    if (team == 0 && role == Role::HERO && aliveHeroes() >= 1) return;

    for (auto& u : units) {
      if (!u.active) {
        u = Unit{};
        u.active = true;
        u.team = team;
        u.role = role;
        u.x = constrain(x + (int)(esp_random() % 9) - 4, 2.0f, (float)Config::SCREEN_W - 2.0f);
        u.y = constrain(y + (int)(esp_random() % 9) - 4, 2.0f, (float)Config::SCREEN_H - 2.0f);
        u.targetResId = -1;
        u.carrying = false;
        u.cooldown = 0;
        u.skillCooldown = 0;
        u.skillCooldownMax = 0;
        for (uint8_t si = 0; si < 11; ++si) { u.skillCd[si] = 0.0f; u.skillCdMax[si] = 0.0f; }
        u.lastSkillUsed = 0;
        u.idleTime = 0;
        u.heroXp = 0;
        u.heroLv = 1;
        u.heroClass = esp_random() % 6;
        u.maxMana = 0.0f;
        u.mana = 0.0f;
        u.visualSeed = esp_random() & 0xFF;
        u.skillMask = 0;
        if (team == 0 && role == Role::HERO) {
          u.skillMask = randomHeroSkills(u.heroClass);
          announceHero(u);
        } else if (team == 0 && role != Role::SCAVENGER && role != Role::TOWER && role != Role::REPAIR) {
          // Procedural non-hero defenders sometimes get one small cliché ability.
          if ((esp_random() % 100) < 34) u.skillMask = randomSkillBit();
        }

        if (team == 0) {
          switch (role) {
            case Role::SCAVENGER: u.maxHp = 16 + unitLv * 3; u.speed = 24.0f; u.dmg = 0; u.rangeSq = 0; break;
            case Role::REPAIR:    u.maxHp = 20 + repairLv * 4; u.speed = 18.0f; u.dmg = 0; u.rangeSq = 0; break;
            case Role::HEALER:    u.maxHp = 26 + unitLv * 4 + repairLv * 3; u.speed = 17.0f; u.dmg = 0; u.rangeSq = 560.0f; break;
            case Role::HERO:
              u.maxHp = 64 + unitLv * 7 + u.heroLv * 9;
              u.maxMana = 42.0f + u.heroLv * 5.0f;
              u.mana = u.maxMana;
              u.speed = 15.5f + (u.heroClass == 4 ? 2.0f : 0.0f);
              u.dmg = 10 + dmgLv * 2.0f + u.heroLv * 2.2f;
              u.rangeSq = 650.0f + u.heroLv * 34.0f;
              break;
            case Role::ARCHER:    u.maxHp = 24 + unitLv * 4; u.speed = 16.0f; u.dmg = 6 + dmgLv * 1.8f; u.rangeSq = 520.0f; break;
            case Role::MAGE:      u.maxHp = 20 + unitLv * 3; u.speed = 13.0f; u.dmg = 10 + dmgLv * 2.2f; u.rangeSq = 700.0f; break;
            case Role::BRUTE:     u.maxHp = 70 + unitLv * 8; u.speed = 8.0f;  u.dmg = 12 + dmgLv * 2.0f; u.rangeSq = 120.0f; break;
            case Role::TOWER:     u.maxHp = 70 + towerLv * 20; u.speed = 0.0f; u.dmg = 8 + towerLv * 2.5f + dmgLv; u.rangeSq = 780.0f; break;
            default:              u.maxHp = 30 + unitLv * 5; u.speed = 15.0f; u.dmg = 7 + dmgLv * 1.5f; u.rangeSq = 170.0f; break;
          }
        } else {
          float w = max(1, (int)wave);
          switch (role) {
            case Role::ARCHER: u.maxHp = 18 + w * 3; u.speed = 13.5f; u.dmg = 5 + w * 0.75f; u.rangeSq = 460.0f; break;
            case Role::MAGE:   u.maxHp = 16 + w * 2.5f; u.speed = 11.0f; u.dmg = 8 + w * 0.9f;  u.rangeSq = 620.0f; break;
            case Role::BRUTE:  u.maxHp = 70 + w * 8; u.speed = 7.0f; u.dmg = 11 + w * 1.1f; u.rangeSq = 110.0f; break;
            default:           u.maxHp = 24 + w * 4; u.speed = 13.0f + min(6.0f, w * 0.18f); u.dmg = 6 + w * 0.8f; u.rangeSq = 130.0f; break;
          }
        }
        u.hp = u.maxHp;
        return;
      }
    }
  }

  void spawnEnemy() {
    // v8.15B: back to original swarm — enemies enter from all screen edges.
    int side = esp_random() % 4;
    float x = 0, y = 0;
    if (side == 0) { x = esp_random() % Config::SCREEN_W; y = 1; }
    else if (side == 1) { x = Config::SCREEN_W - 2; y = esp_random() % Config::SCREEN_H; }
    else if (side == 2) { x = esp_random() % Config::SCREEN_W; y = Config::SCREEN_H - 2; }
    else { x = 1; y = esp_random() % Config::SCREEN_H; }

    uint32_t r = esp_random() % 100;
    Role role = Role::GUARD;
    uint8_t mageChance = min(26, 6 + (int)wave);
    uint8_t bruteChance = min(22, 5 + (int)wave / 2);
    if (r < bruteChance) role = Role::BRUTE;
    else if (r < bruteChance + mageChance) role = Role::MAGE;
    else if (r < bruteChance + mageChance + 28) role = Role::ARCHER;
    else role = Role::GUARD;
    spawnUnit(1, role, x, y);
  }

