Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  int findNearestEnemy(float x, float y, float maxSq) {
    int best = -1;
    float bd = maxSq;
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      int rad = constrain((int)(sqrtf(maxSq) / 16.0f) + 1, 1, 7);
      for (int yy = max(0, cy - rad); yy <= min(7, cy + rad); yy++) {
        for (int xx = max(0, cx - rad); xx <= min(7, cx + rad); xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1) {
            if (units[j].active && units[j].team == 1) {
              float d = distSq(x, y, units[j].x, units[j].y);
              if (d < bd) { bd = d; best = j; }
            }
            j = gridNext[j];
          }
        }
      }
      return best;
    }
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active || units[i].team != 1) continue;
      float d = distSq(x, y, units[i].x, units[i].y);
      if (d < bd) { bd = d; best = i; }
    }
    return best;
  }

  int findNearestFriendlyTarget(float x, float y) {
    int best = -1;
    float bd = 800.0f;
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      for (int yy = max(0, cy - 2); yy <= min(7, cy + 2); yy++) {
        for (int xx = max(0, cx - 2); xx <= min(7, cx + 2); xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1) {
            if (units[j].active && units[j].team == 0) {
              float d = distSq(x, y, units[j].x, units[j].y);
              if (!(units[j].role == Role::SCAVENGER && d > 400.0f) && d < bd) { bd = d; best = j; }
            }
            j = gridNext[j];
          }
        }
      }
      return best;
    }
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active || units[i].team != 0) continue;
      float d = distSq(x, y, units[i].x, units[i].y);
      if (units[i].role == Role::SCAVENGER && d > 400.0f) continue;
      if (d < bd) { bd = d; best = i; }
    }
    return best;
  }

  void damageThrone(float dmg) {
    bases[0].hp -= dmg;
    spawnParticle(bases[0].x, bases[0].y, enemyColor, 2);
  }

  bool insertRecord(uint32_t ms, uint16_t w, uint16_t col, uint16_t mid) {
    int pos = -1;
    for (int i = 0; i < 4; i++) {
      if (ms > bestMs[i]) { pos = i; break; }
    }
    if (pos < 0) return false;
    for (int i = 3; i > pos; i--) {
      bestMs[i] = bestMs[i-1]; bestWave[i] = bestWave[i-1]; bestColor[i] = bestColor[i-1]; bestModel[i] = bestModel[i-1];
    }
    bestMs[pos] = ms; bestWave[pos] = w; bestColor[pos] = col; bestModel[pos] = mid;
    recordsToastUntilMs = millis() + 10000UL;
    return true;
  }

  void loadRecords() {
    if (recordsLoaded) return;
    recordsLoaded = true;
    Preferences p;
    if (!p.begin("tdsurv", true)) return;
    SaveRec rec = {};
    size_t got = p.getBytes("rec", &rec, sizeof(rec));
    p.end();
    if (got != sizeof(rec) || rec.magic != 0x54445356UL || rec.version != 1) return;
    uint16_t old = rec.crc;
    rec.crc = 0;
    if (crc16((uint8_t*)&rec, sizeof(rec)) != old) return;
    memcpy(bestMs, rec.bestMs, sizeof(bestMs));
    memcpy(bestWave, rec.bestWave, sizeof(bestWave));
    memcpy(bestColor, rec.bestColor, sizeof(bestColor));
    memcpy(bestModel, rec.bestModel, sizeof(bestModel));
    modelId = max((uint16_t)1, rec.nextModel);
  }

  void saveRecords() {
    SaveRec rec = {};
    rec.magic = 0x54445356UL;
    rec.version = 1;
    memcpy(rec.bestMs, bestMs, sizeof(bestMs));
    memcpy(rec.bestWave, bestWave, sizeof(bestWave));
    memcpy(rec.bestColor, bestColor, sizeof(bestColor));
    memcpy(rec.bestModel, bestModel, sizeof(bestModel));
    rec.nextModel = modelId;
    rec.crc = 0;
    rec.crc = crc16((uint8_t*)&rec, sizeof(rec));
    Preferences p;
    if (p.begin("tdsurv", false)) {
      p.putBytes("rec", &rec, sizeof(rec));
      p.end();
    }
  }

  uint32_t upgradeCost(uint8_t lv, uint16_t base) const {
    return (uint32_t)base + (uint32_t)lv * (uint32_t)(base / 2 + 15) + (uint32_t)wave * 3UL;
  }

  uint32_t heroBuyCost() const {
    // v8.15B: only one hero may exist. If he dies, Janus can buy a new body with gold.
    return 105UL + (uint32_t)wave * 4UL + (uint32_t)level * 8UL;
  }

  void buildTower() {
    if (towerCount >= 8) return;
    float a = (float)towerCount * 0.785398f + 0.35f;
    float r = 22.0f + (towerCount & 1) * 10.0f;
    float x = bases[0].x + cosf(a) * r;
    float y = bases[0].y + sinf(a) * r;
    spawnUnit(0, Role::TOWER, x, y);
    towerCount++;
  }

  void janusAutoUpgrade() {
    uint32_t now = millis();
    if (now - lastAutoBuyMs < 900) return;
    lastAutoBuyMs = now;

    if (bases[0].hp < bases[0].maxHp * 0.55f && gold >= 18) {
      uint32_t repairBudget = (uint32_t)(34 + repairLv * 3);
      uint32_t spend = (gold < repairBudget) ? gold : repairBudget;
      gold -= spend;
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + (float)spend * (1.4f + repairLv * 0.18f));
      return;
    }

    if (aliveHeroes() < 1 && gold >= heroBuyCost()) {
      // v8.15B: hero death does not hurt the throne and does not restart the run.
      // Janus buys exactly one new hero body when enough gold is available.
      gold -= heroBuyCost();
      spawnUnit(0, Role::HERO, bases[0].x, bases[0].y - 12);
      playBeep(1200, 80);
      return;
    }

    if (aliveFriendlies() < 3 + unitLv && gold >= 22) {
      gold -= 22;
      spawnUnit(0, randomFriendlyRole(), bases[0].x, bases[0].y);
      return;
    }
    if (repairLv > 0 && aliveFriendlies() < 5 + unitLv && gold >= 28 && (esp_random() % 100) < 34) {
      gold -= 28;
      spawnUnit(0, Role::REPAIR, bases[0].x, bases[0].y);
      return;
    }
    if (gold >= 80 + towerCount * 28 && towerCount < 2 + towerLv) {
      gold -= 80 + towerCount * 28;
      buildTower();
      playBeep(900, 35);
      return;
    }

    uint8_t choice = esp_random() % 7;
    if (choice == 0 && gold >= upgradeCost(dmgLv, 55)) { gold -= upgradeCost(dmgLv, 55); dmgLv++; }
    else if (choice == 1 && gold >= upgradeCost(fireLv, 50)) { gold -= upgradeCost(fireLv, 50); fireLv++; }
    else if (choice == 2 && gold >= upgradeCost(throneLv, 70)) { gold -= upgradeCost(throneLv, 70); throneLv++; bases[0].maxHp += 80; bases[0].hp += 80; }
    else if (choice == 3 && gold >= upgradeCost(unitLv, 58)) { gold -= upgradeCost(unitLv, 58); unitLv++; spawnUnit(0, Role::ARCHER, bases[0].x, bases[0].y); }
    else if (choice == 4 && gold >= upgradeCost(towerLv, 90)) { gold -= upgradeCost(towerLv, 90); towerLv++; }
    else if (choice == 5 && aliveHeroes() < 1 && gold >= heroBuyCost()) { gold -= heroBuyCost(); spawnUnit(0, Role::HERO, bases[0].x, bases[0].y - 12); }
    else if (gold >= upgradeCost(repairLv, 62)) { gold -= upgradeCost(repairLv, 62); repairLv++; spawnUnit(0, Role::HEALER, bases[0].x, bases[0].y); }
  }

  void applyMiningLuckWaveBoost() {
    if (miningLuckCharges == 0 && miningLuckPower <= 0.03f) return;
    float pEntropy, pMood, pFatigue, pVigor;
    uint8_t pMoodCode;
    janusPersonalSnapshot(pEntropy, pMood, pFatigue, pVigor, pMoodCode);
    float personalLuckUse = constrain(0.72f + pMood * 0.24f + pVigor * 0.22f - pFatigue * 0.14f, 0.58f, 1.24f);
    float p = constrain(miningLuckPower * personalLuckUse, 0.10f, 2.45f);
    waveLootMul = min(1.90f, waveLootMul + 0.08f + p * 0.055f);
    waveDamageMul = min(1.62f, waveDamageMul + p * 0.030f);
    waveShieldMul = max(0.68f, waveShieldMul - p * 0.024f);
    gold += 4 + (uint32_t)(p * 7.0f);
    bases[0].hp = min(bases[0].maxHp, bases[0].hp + 4.0f + p * 5.0f);
    if (miningLuckCharges > 0) miningLuckCharges--;
    miningLuckPower *= 0.72f;
    snprintf(waveBoostLine, sizeof(waveBoostLine), "B:HASH+%u", (unsigned)miningLuckCharges);
  }

