Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void startWave() {
    if (pendingGroundOrder) commitPendingGroundOrder();
    state = GameState::PLAYING;
    wave++;
    groundMissionStartMs = millis();
    activeMissionWave = (uint8_t)min(255, (int)wave);
    snprintf(groundMissionLine, sizeof(groundMissionLine), "%s S%02u", groundStyleName(), (unsigned)groundSector);
    enemiesKilledThisWave = 0;
    if (groundStyle == 1) enemiesLeftToSpawn = 5 + wave * 2 + min(18, (int)wave);
    else if (groundStyle == 2) enemiesLeftToSpawn = 9 + wave * 4 + min(34, (int)wave * 2);
    else enemiesLeftToSpawn = 7 + wave * 3 + min(26, (int)wave * 2);
    waveSpawnTimer = 0.0f;
    applySensorWaveBoost();
    applyMiningLuckWaveBoost();
    groundBannerUntilMs = millis() + 2800UL;
    playBeep(420 + wave * 10, 50);
  }

  void startBetweenWaves() {
    state = GameState::BETWEEN_WAVES;
    betweenWaveTimer = pendingGroundOrder ? 3.0f : 5.0f;
    uint32_t reward = 25 + wave * 8;
    gold += reward;
    xp += reward / 2;
    janusPersonalNudge(7, (uint16_t)min(96, (int)wave + 16));
    if (xp >= level * 70UL) { xp -= level * 70UL; level++; gold += 30 + level * 5; if ((esp_random() % 100) < 45) spawnUnit(0, randomFriendlyRole(), bases[0].x, bases[0].y); }
    groundToastUntilMs = millis() + 3200UL;
    snprintf(groundToastLine, sizeof(groundToastLine), "MISSION DONE W%u", (unsigned)wave);
    // v8.15B: no free/extra hero between waves; a dead hero is bought with gold by janusAutoUpgrade().
    playBeep(1000, 70);
  }

  void startNewRun() {
    loadRecords();
    state = GameState::BETWEEN_WAVES;
    gameOverTimer = 0.0f;
    betweenWaveTimer = 3.0f;
    runStartMs = millis();
    survivalMs = 0;
    wave = 0;
    gold = 45;
    xp = 0;
    level = 1;
    dmgLv = fireLv = throneLv = unitLv = towerLv = repairLv = 0;
    towerCount = 0;
    heroLimit = 1; // v8.15B: hard cap, only one living hero for the throne.
    snprintf(heroLine, sizeof(heroLine), "MECH L1");
    enemiesLeftToSpawn = 0;
    enemiesKilledThisWave = 0;
    throneCooldown = 0;
    shockwaveRadius = 0;
    nextSoundTime = 0;
    resetWaveBoosts();
    janusPersonalReset();
    playerColor = tournamentColor(modelId);
    enemyColor = canvas.color565(230, 72, 98);
    configureGroundWorld(janusGroundOrderSector, janusGroundOrderPriority,
                         janusGroundOrderMission ? janusGroundOrderMission : modelId,
                         janusGroundOrderFlags, janusGroundOrderTarget);
    // v8.15B: throne restored to center; mob loot is absorbed automatically.
    bases[0] = {Config::SCREEN_W * 0.5f, Config::SCREEN_H * 0.5f, 520, 520, 0, 0, playerColor, 0.0f};
    bases[1] = {0, 0, 0, 0, 0, 1, enemyColor, 0.0f};

    for (auto& u : units) u.active = false;
    for (auto& r : resources) r.active = false;
    for (auto& p : particles) p.active = false;
    for (auto& s : spits) s.active = false;
    spatialReady = false;
    cachedHeroUntilMs = 0;

    spawnUnit(0, Role::SCAVENGER, bases[0].x - 6, bases[0].y + 8);
    spawnUnit(0, Role::SCAVENGER, bases[0].x + 6, bases[0].y + 8);
    spawnUnit(0, Role::GUARD, bases[0].x - 9, bases[0].y - 5);
    spawnUnit(0, Role::ARCHER, bases[0].x + 9, bases[0].y - 5);
    spawnUnit(0, Role::HEALER, bases[0].x + 10, bases[0].y + 8);
    spawnUnit(0, Role::HERO, bases[0].x, bases[0].y - 12);
    buildTower();
    lastTick = millis();
    fixedAccumulator = 0.0f;
  }

  void finishRun() {
    survivalMs = millis() - runStartMs;
    bool recChanged = insertRecord(survivalMs, wave, playerColor, modelId);
    modelId++;
    saveRecords();
    if (recChanged) recordsToastUntilMs = millis() + 10000UL;
    spawnParticle(bases[0].x, bases[0].y, TFT_WHITE, 120);
    spawnParticle(bases[0].x, bases[0].y, playerColor, 80);
    state = GameState::GAME_OVER;
    gameOverTimer = 3.0f;
    playBeep(90, 500);
  }

  void handleInput() {
    M5.update();

    // ATOM S3R: short press on the screen button cycles backlight including full OFF.
    // Long hold toggles sound without also stepping brightness on release.
    static bool holdConsumed = false;
    if (M5.BtnA.wasHold()) {
      soundEnabled = !soundEnabled;
      holdConsumed = true;
      if (soundEnabled) M5.Speaker.tone(1000, 100);
    } else if (M5.BtnA.wasReleased()) {
      if (!holdConsumed) {
        brightIdx = (brightIdx + 1) % 5;
        M5.Display.setBrightness(brightLevels[brightIdx]);
      }
      holdConsumed = false;
    }
  }

  void updateEchoBaseMicRms() {
    uint32_t now = millis();
    if (now - lastEchoMicPollMs < 50) return;
    lastEchoMicPollMs = now;

#if JANUS_AUDIO_LIVE_TX_ENABLE
    // During live audio, janusAudioTxTick() is the single owner of EchoBase.record().
    // Double-reading the I2S mic caused gaps and underruns on Core2.
    if (janusAudioTxEnabled) return;
#endif

    if (!echoBaseReady) {
      swarmMicFails++;
      echoMicReadFail++;
      swarmMicRms *= 0.985f;
      swarmMicPeak *= 0.992f;
      return;
    }

    bool ok = echobase.record(echoMicBuf, sizeof(echoMicBuf));
    if (!ok) {
      swarmMicFails++;
      echoMicReadFail++;
      swarmMicRms *= 0.985f;
      swarmMicPeak *= 0.992f;
      return;
    }

    int samples = sizeof(echoMicBuf) / 2;
    int16_t* pcm = (int16_t*)echoMicBuf;
    int64_t sum = 0;
    int16_t minV = 32767, maxV = -32768;
    for (int i = 0; i < samples; i++) {
      int16_t v = pcm[i];
      sum += v;
      if (v < minV) minV = v;
      if (v > maxV) maxV = v;
    }
    float mean = (float)sum / (float)samples;
    float sumSq = 0.0f;
    for (int i = 0; i < samples; i++) {
      float centered = (float)pcm[i] - mean;
      sumSq += centered * centered;
    }
    float rmsRaw = sqrtf(sumSq / (float)samples);
    float pp = (float)(maxV - minV);
    if (pp < 2.0f) {
      swarmMicFails++;
      echoMicReadFail++;
      swarmMicRms *= 0.985f;
      swarmMicPeak *= 0.992f;
      return;
    }

    swarmMicFrames++;
    echoMicReadOk++;
    if (rmsRaw < micNoiseFloor * 1.8f) micNoiseFloor = micNoiseFloor * 0.995f + rmsRaw * 0.005f;
    micNoiseFloor = constrain(micNoiseFloor, 80.0f, 650.0f);
    float gated = rmsRaw - micNoiseFloor * 1.35f;
    if (gated < 0.0f) gated = 0.0f;
    micSignal = micSignal * 0.80f + gated * 0.20f;
    swarmMicRms = swarmMicRms * 0.84f + micSignal * 0.16f;
    if (gated > swarmMicPeak) swarmMicPeak = gated;
    else swarmMicPeak *= 0.975f;

    if ((swarmMicRms > 720.0f || swarmMicPeak > 2600.0f) && (now - lastShockwaveMicMs > 30000UL)) {
      lastShockwaveMicMs = now;
      triggerShockwave();
    }
  }

  void triggerShockwave() {
    if (shockwaveRadius > 0.0f) return;
    playBeep(150, 150);
    shockwaveRadius = 1.0f;
    float cx = bases[0].x;
    float cy = bases[0].y;
    for (auto& u : units) {
      if (!u.active || u.team != 1) continue;
      float dx = u.x - cx;
      float dy = u.y - cy;
      float d = sqrtf(dx*dx + dy*dy) + 0.1f;
      float force = 1250.0f / d;
      u.vx += (dx / d) * force;
      u.vy += (dy / d) * force;
      u.hp -= 4.0f + wave * 0.15f;
      spawnParticle(u.x, u.y, TFT_CYAN, 3);
    }
  }

