Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void updateEffects(float dt) {
    for (auto& p : particles) {
      if (!p.active) continue;
      p.x += p.vx * dt; p.y += p.vy * dt; p.life -= dt;
      if (p.life <= 0) p.active = false;
    }
    for (auto& s : spits) {
      if (!s.active) continue;
      s.life -= dt;
      if (s.life <= 0) s.active = false;
    }
    if (shockwaveRadius > 0.0f) {
      shockwaveRadius += 120.0f * dt;
      if (shockwaveRadius > 70.0f) shockwaveRadius = 0.0f;
    }
  }

  void updateThrone(float dt) {
    if (throneCooldown > 0) throneCooldown -= dt;
    if (throneCooldown > 0) return;
    int target = findNearestEnemy(bases[0].x, bases[0].y, 1500.0f + fireLv * 120.0f);
    if (target < 0) return;
    float dmg = (11.0f + dmgLv * 2.2f + throneLv * 1.5f) * waveDamageMul;
    units[target].hp -= dmg;
    addBeam(bases[0].x, bases[0].y, units[target].x, units[target].y, brightenColor(playerColor, 0.35f), 0.13f);
    spawnParticle(units[target].x, units[target].y, TFT_WHITE, 3);
    throneCooldown = max(0.08f, (0.42f - fireLv * 0.025f) / waveFireMul);
    if (units[target].hp <= 0) killEnemy(target);
  }

  void killEnemy(int idx) {
    if (idx < 0 || idx >= Config::MAX_UNITS || !units[idx].active) return;
    float x = units[idx].x, y = units[idx].y;
    uint16_t loot = 8 + (esp_random() % (8 + max(1, (int)wave)));
    if (units[idx].role == Role::BRUTE) loot += 16 + wave;
    if (units[idx].role == Role::MAGE) loot += 8;
    loot = (uint16_t)max(1, (int)((float)loot * waveLootMul));
    units[idx].active = false;
    enemiesKilledThisWave++;
    grantHeroXp((uint16_t)(3 + (loot / 5)));
    absorbLootToThrone(x, y, loot);
    spawnParticle(x, y, enemyColor, 10);
    spawnParticle(x, y, TFT_WHITE, 5);
    playBeep(300, 24);
  }

  void updateWave(float dt) {
    if (state == GameState::BETWEEN_WAVES) {
      betweenWaveTimer -= dt;
      if (betweenWaveTimer <= 0.0f) startWave();
      return;
    }
    if (state != GameState::PLAYING) return;

    if (enemiesLeftToSpawn > 0) {
      waveSpawnTimer -= dt;
      float rate = max(0.12f, 0.72f - wave * 0.018f);
      if (waveSpawnTimer <= 0.0f) {
        spawnEnemy();
        enemiesLeftToSpawn--;
        waveSpawnTimer = rate;
      }
    } else if (aliveEnemies() == 0) {
      startBetweenWaves();
    }
  }

  int findHurtFriendly(float x, float y, float maxSq) {
    int best = -1;
    float bd = maxSq;
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active || units[i].team != 0 || units[i].role == Role::TOWER) continue;
      if (units[i].hp >= units[i].maxHp * 0.92f) continue;
      float d = distSq(x, y, units[i].x, units[i].y);
      if (d < bd) { bd = d; best = i; }
    }
    return best;
  }

  void grantHeroXp(uint16_t amount) {
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active || units[i].team != 0 || units[i].role != Role::HERO) continue;
      Unit& h = units[i];
      h.heroXp += amount;
      uint16_t need = 36 + h.heroLv * 24;
      if (h.heroXp >= need && h.heroLv < 9) {
        h.heroXp -= need;
        h.heroLv++;
        h.maxHp += 11;
        h.hp = min(h.maxHp, h.hp + 22.0f);
        h.maxMana += 7.0f;
        h.mana = min(h.maxMana, h.mana + 18.0f);
        h.dmg += 2.4f;
        h.rangeSq += 35.0f;
        if ((esp_random() % 100) < 55) h.skillMask |= randomSkillBit();
        announceHero(h);
        spawnParticle(h.x, h.y, heroClassColor(h.heroClass), 12);
        playBeep(1400, 45);
      }
    }
  }

  void heroAoE(float x, float y, float radiusSq, float dmg, uint16_t c) {
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      int rad = constrain((int)(sqrtf(radiusSq) / 16.0f) + 1, 1, 7);
      for (int yy = max(0, cy - rad); yy <= min(7, cy + rad); yy++) {
        for (int xx = max(0, cx - rad); xx <= min(7, cx + rad); xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1) {
            int cur = j;
            j = gridNext[j];
            if (!units[cur].active || units[cur].team != 1) continue;
            if (distSq(x, y, units[cur].x, units[cur].y) > radiusSq) continue;
            units[cur].hp -= dmg;
            addBeam(x, y, units[cur].x, units[cur].y, c, 0.12f);
            spawnParticle(units[cur].x, units[cur].y, c, 2);
            if (units[cur].hp <= 0) killEnemy(cur);
          }
        }
      }
      return;
    }
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active || units[i].team != 1) continue;
      if (distSq(x, y, units[i].x, units[i].y) > radiusSq) continue;
      units[i].hp -= dmg;
      addBeam(x, y, units[i].x, units[i].y, c, 0.12f);
      spawnParticle(units[i].x, units[i].y, c, 2);
      if (units[i].hp <= 0) killEnemy(i);
    }
  }


  int heroChainGrid(float x, float y, float radiusSq, float dmg, uint16_t c, float fromX, float fromY, int maxHits) {
    int hits = 0;
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      int rad = constrain((int)(sqrtf(radiusSq) / 16.0f) + 1, 1, 7);
      for (int yy = max(0, cy - rad); yy <= min(7, cy + rad) && hits < maxHits; yy++) {
        for (int xx = max(0, cx - rad); xx <= min(7, cx + rad) && hits < maxHits; xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1 && hits < maxHits) {
            int cur = j;
            j = gridNext[j];
            if (!units[cur].active || units[cur].team != 1) continue;
            if (distSq(x, y, units[cur].x, units[cur].y) > radiusSq) continue;
            units[cur].hp -= dmg;
            addBeam(hits == 0 ? fromX : x, hits == 0 ? fromY : y, units[cur].x, units[cur].y, c, 0.13f);
            if (units[cur].hp <= 0) killEnemy(cur);
            hits++;
          }
        }
      }
      return hits;
    }
    for (int i = 0; i < Config::MAX_UNITS && hits < maxHits; i++) {
      if (!units[i].active || units[i].team != 1) continue;
      if (distSq(x, y, units[i].x, units[i].y) > radiusSq) continue;
      units[i].hp -= dmg;
      addBeam(hits == 0 ? fromX : x, hits == 0 ? fromY : y, units[i].x, units[i].y, c, 0.13f);
      if (units[i].hp <= 0) killEnemy(i);
      hits++;
    }
    return hits;
  }

  void heroFrostGrid(float x, float y, float radiusSq, float dmg) {
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      int rad = constrain((int)(sqrtf(radiusSq) / 16.0f) + 1, 1, 7);
      for (int yy = max(0, cy - rad); yy <= min(7, cy + rad); yy++) {
        for (int xx = max(0, cx - rad); xx <= min(7, cx + rad); xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1) {
            int cur = j;
            j = gridNext[j];
            if (!units[cur].active || units[cur].team != 1) continue;
            if (distSq(x, y, units[cur].x, units[cur].y) > radiusSq) continue;
            units[cur].hp -= dmg;
            units[cur].x += (bases[0].x - units[cur].x) * -0.05f;
            units[cur].y += (bases[0].y - units[cur].y) * -0.05f;
            spawnParticle(units[cur].x, units[cur].y, TFT_CYAN, 3);
            if (units[cur].hp <= 0) killEnemy(cur);
          }
        }
      }
      return;
    }
    for (int i = 0; i < Config::MAX_UNITS; ++i) {
      if (!units[i].active || units[i].team != 1) continue;
      if (distSq(x,y,units[i].x,units[i].y) > radiusSq) continue;
      units[i].hp -= dmg;
      units[i].x += (bases[0].x - units[i].x) * -0.05f;
      units[i].y += (bases[0].y - units[i].y) * -0.05f;
      spawnParticle(units[i].x, units[i].y, TFT_CYAN, 3);
      if (units[i].hp <= 0) killEnemy(i);
    }
  }

  void heroTotemGrid(float x, float y, float radiusSq, float heal) {
    if (spatialReady) {
      int cx = constrain((int)x / 16, 0, 7);
      int cy = constrain((int)y / 16, 0, 7);
      int rad = constrain((int)(sqrtf(radiusSq) / 16.0f) + 1, 1, 7);
      for (int yy = max(0, cy - rad); yy <= min(7, cy + rad); yy++) {
        for (int xx = max(0, cx - rad); xx <= min(7, cx + rad); xx++) {
          int j = gridHead[xx + yy * 8];
          while (j != -1) {
            int cur = j;
            j = gridNext[j];
            if (!units[cur].active || units[cur].team != 0) continue;
            if (distSq(x,y,units[cur].x,units[cur].y) > radiusSq) continue;
            units[cur].hp = min(units[cur].maxHp, units[cur].hp + heal);
          }
        }
      }
      return;
    }
    for (int i = 0; i < Config::MAX_UNITS; ++i) {
      if (!units[i].active || units[i].team != 0) continue;
      if (distSq(x,y,units[i].x,units[i].y) > radiusSq) continue;
      units[i].hp = min(units[i].maxHp, units[i].hp + heal);
    }
  }

  void castHeroSkill(Unit& u, int targetIdx) {
    if (u.role != Role::HERO || targetIdx < 0 || !units[targetIdx].active) return;

    uint16_t chosen = pickReadyOwnedSkill(u);
    if (!chosen) return;

