Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
    uint8_t idx = skillIndex(chosen);
    if (idx >= 11) return;

    uint8_t manaCost = heroSkillManaCost(chosen, u.heroLv);
    if (u.mana + 0.01f < (float)manaCost) return;
    u.mana = max(0.0f, u.mana - (float)manaCost);

    Unit& e = units[targetIdx];
    uint16_t c = heroClassColor(u.heroClass);
    float cd = 2.0f;

    if (chosen == SK_HOOK) {
      e.x += (u.x - e.x) * 0.45f;
      e.y += (u.y - e.y) * 0.45f;
      e.hp -= 7.0f + u.heroLv * 2.0f;
      addBeam(u.x, u.y, e.x, e.y, TFT_ORANGE, 0.18f);
      cd = 1.8f;
    } else if (chosen == SK_FIRE) {
      heroAoE(e.x, e.y, 170.0f, 10.0f + u.heroLv * 3.0f + dmgLv, TFT_ORANGE);
      spawnParticle(e.x, e.y, TFT_ORANGE, 16);
      cd = 2.4f;
    } else if (chosen == SK_SHIELD) {
      u.hp = min(u.maxHp, u.hp + 22.0f + u.heroLv * 8.0f);
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + 9.0f + u.heroLv * 2.0f);
      spawnParticle(u.x, u.y, TFT_CYAN, 14);
      cd = 3.0f;
    } else if (chosen == SK_LASER) {
      e.hp -= 20.0f + u.heroLv * 5.0f + dmgLv * 2.0f;
      addBeam(u.x, u.y, e.x, e.y, TFT_CYAN, 0.22f);
      addBeam(u.x + 1, u.y, e.x + 1, e.y, TFT_WHITE, 0.12f);
      cd = 2.2f;
    } else if (chosen == SK_NOVA) {
      heroAoE(u.x, u.y, 520.0f, 9.0f + u.heroLv * 2.6f, c);
      spawnParticle(u.x, u.y, c, 20);
      cd = 2.7f;
    } else if (chosen == SK_CHAIN) {
      heroChainGrid(e.x, e.y, 780.0f, 8.0f + u.heroLv * 2.5f, canvas.color565(180, 100, 255), u.x, u.y, 4);
      cd = 2.0f;
    } else if (chosen == SK_BLINK) {
      float dx = e.x - u.x, dy = e.y - u.y;
      float inv = 1.0f / sqrtf(dx*dx + dy*dy + 0.001f);
      u.x = constrain(e.x - dx*inv*8.0f, 4.0f, (float)Config::SCREEN_W - 4.0f);
      u.y = constrain(e.y - dy*inv*8.0f, 4.0f, (float)Config::SCREEN_H - 4.0f);
      heroAoE(u.x, u.y, 200.0f, 8.0f + u.heroLv * 2.3f, brightenColor(c,0.3f));
      spawnParticle(u.x, u.y, brightenColor(c,0.4f), 18);
      cd = 1.6f;
    } else if (chosen == SK_FROST) {
      heroFrostGrid(e.x, e.y, 420.0f, 4.0f + u.heroLv * 1.8f);
      cd = 2.5f;
    } else if (chosen == SK_POISON) {
      e.hp -= 10.0f + u.heroLv * 2.2f;
      heroAoE(e.x, e.y, 210.0f, 4.0f + u.heroLv * 1.4f, canvas.color565(80,255,90));
      cd = 2.1f;
    } else if (chosen == SK_TOTEM) {
      heroTotemGrid(u.x, u.y, 650.0f, 8.0f + u.heroLv * 1.8f);
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + 16.0f + u.heroLv * 3.0f);
      spawnParticle(u.x, u.y, canvas.color565(112,242,190), 20);
      cd = 3.4f;
    } else if (chosen == SK_METEOR) {
      heroAoE(e.x, e.y, 330.0f, 15.0f + u.heroLv * 3.6f, canvas.color565(255,120,40));
      addBeam(e.x, 0, e.x, e.y, canvas.color565(255,190,100), 0.12f);
      spawnParticle(e.x, e.y, canvas.color565(255,140,50), 22);
      cd = 3.2f;
    }

    u.lastSkillUsed = chosen;
    u.skillCd[idx] = cd;
    u.skillCdMax[idx] = cd;
    // Legacy fields remain as visual hints only. Other skills keep their own cooldowns.
    u.skillCooldownMax = cd;
    u.skillCooldown = cd;
  }

  void updateFriendly(Unit& u, float dt) {
    float tx = bases[0].x;
    float ty = bases[0].y;
    float speed = u.speed;

    if (u.role == Role::SCAVENGER) {
      if (!u.carrying) {
        if (u.targetResId < 0 || !resources[u.targetResId].active) {
          float best = 999999.0f;
          u.targetResId = -1;
          for (int r = 0; r < Config::MAX_RESOURCES; r++) {
            if (!resources[r].active) continue;
            float d = distSq(u.x, u.y, resources[r].x, resources[r].y);
            if (d < best) { best = d; u.targetResId = r; }
          }
        }
        if (u.targetResId >= 0) {
          tx = resources[u.targetResId].x;
          ty = resources[u.targetResId].y;
          if (distSq(u.x, u.y, tx, ty) < Config::PICKUP_DIST_SQ) {
            u.carrying = true;
            u.idleTime = resources[u.targetResId].amount;
            resources[u.targetResId].active = false;
            u.targetResId = -1;
            playBeep(1900, 10);
          }
        } else {
          float a = (millis() * 0.001f) + (float)((uintptr_t)&u & 15);
          tx = bases[0].x + cosf(a) * 18.0f;
          ty = bases[0].y + sinf(a) * 18.0f;
        }
      } else {
        tx = bases[0].x;
        ty = bases[0].y;
        if (distSq(u.x, u.y, tx, ty) < Config::BASE_UNLOAD_DIST_SQ) {
          uint32_t val = (uint32_t)u.idleTime;
          gold += val;
          xp += (val / 2 > 0) ? (val / 2) : 1;
          u.carrying = false;
          u.idleTime = 0;
          playBeep(1500, 10);
        }
      }
    } else if (u.role == Role::HEALER) {
      int h = findHurtFriendly(u.x, u.y, u.rangeSq + 260.0f);
      if (h >= 0) {
        tx = units[h].x; ty = units[h].y;
        if (distSq(u.x, u.y, tx, ty) <= u.rangeSq && u.cooldown <= 0) {
          units[h].hp = min(units[h].maxHp, units[h].hp + 9.0f + repairLv * 2.5f + unitLv);
          addBeam(u.x, u.y, tx, ty, TFT_GREEN, 0.16f);
          spawnParticle(tx, ty, TFT_GREEN, 3);
          u.cooldown = max(0.32f, 0.90f - repairLv * 0.05f);
          speed = 0.0f;
        }
      } else {
        float a = (millis() * 0.0007f) + (float)((uintptr_t)&u & 31);
        tx = bases[0].x + cosf(a) * 15.0f;
        ty = bases[0].y + sinf(a) * 15.0f;
      }
    } else if (u.role == Role::REPAIR) {
      Unit* repairTarget = nullptr;
      float best = 999999.0f;
      for (int i = 0; i < Config::MAX_UNITS; i++) {
        if (!units[i].active || units[i].team != 0 || units[i].role != Role::TOWER) continue;
        if (units[i].hp >= units[i].maxHp * 0.98f) continue;
        float d = distSq(u.x, u.y, units[i].x, units[i].y);
        if (d < best) { best = d; repairTarget = &units[i]; }
      }
      if (bases[0].hp < bases[0].maxHp * 0.96f && distSq(u.x,u.y,bases[0].x,bases[0].y) < best) repairTarget = nullptr;
      if (repairTarget) { tx = repairTarget->x; ty = repairTarget->y; }
      if (!repairTarget) { tx = bases[0].x; ty = bases[0].y; }
      if (distSq(u.x, u.y, tx, ty) < 36.0f && u.cooldown <= 0) {
        if (repairTarget) repairTarget->hp = min(repairTarget->maxHp, repairTarget->hp + 8.0f + repairLv * 2.0f);
        else bases[0].hp = min(bases[0].maxHp, bases[0].hp + 7.0f + repairLv * 2.0f);
        spawnParticle(tx, ty, TFT_GREEN, 2);
        u.cooldown = 0.45f;
      }
    } else {
      int e = findNearestEnemy(u.x, u.y, u.rangeSq + 900.0f);
      if (e >= 0) {
        tx = units[e].x; ty = units[e].y;
        float d = distSq(u.x, u.y, tx, ty);
        if (d <= u.rangeSq && u.cooldown <= 0) {
          units[e].hp -= u.dmg * waveDamageMul;
          uint16_t c = (u.role == Role::MAGE) ? TFT_CYAN : (u.role == Role::HERO ? heroClassColor(u.heroClass) : playerColor);
          addBeam(u.x, u.y, tx, ty, brightenColor(c, 0.25f), 0.15f);
          spawnParticle(tx, ty, TFT_WHITE, 2);
          if (u.role == Role::HERO) castHeroSkill(u, e);
          float baseCd = (u.role == Role::TOWER) ? max(0.18f, 0.70f - towerLv * 0.05f) : (u.role == Role::HERO ? max(0.20f, 0.78f - u.heroLv * 0.035f - fireLv * 0.025f) : max(0.22f, 0.95f - fireLv * 0.04f));
          u.cooldown = baseCd / waveFireMul;
          if (e >= 0 && e < Config::MAX_UNITS && units[e].active && units[e].hp <= 0) killEnemy(e);
          if (u.role != Role::BRUTE) speed = 0.0f;
        }
      } else {
        if (u.role == Role::HERO && groundStyle == 1) {
          tx = raidFocusX;
          ty = raidFocusY;
        } else if (u.role == Role::HERO && groundStyle == 2) {
          float a = (millis() * 0.0015f) + (float)(groundSeed & 31);
          tx = bases[0].x + cosf(a) * 10.0f;
          ty = bases[0].y + sinf(a) * 10.0f;
        } else {
          float a = (millis() * 0.0008f) + (float)((uintptr_t)&u & 31);
          tx = bases[0].x + cosf(a) * (u.role == Role::TOWER ? 0.0f : 18.0f);
          ty = bases[0].y + sinf(a) * (u.role == Role::TOWER ? 0.0f : 18.0f);
        }
      }
    }

    if (u.role == Role::TOWER) return;
    float dx = tx - u.x;
    float dy = ty - u.y;
    float ls = dx*dx + dy*dy;
    if (ls > 0.01f) {
      float inv = 1.0f / (sqrtf(ls) + 0.0001f);
      dx *= inv; dy *= inv;
    }
    u.vx += (dx * speed - u.vx) * 4.2f * dt;
    u.vy += (dy * speed - u.vy) * 4.2f * dt;
  }

