Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void updateEnemy(Unit& u, float dt) {
    int ft = findNearestFriendlyTarget(u.x, u.y);
    float tx = (ft >= 0) ? units[ft].x : bases[0].x;
    float ty = (ft >= 0) ? units[ft].y : bases[0].y;
    float d = distSq(u.x, u.y, tx, ty);
    if (d <= u.rangeSq && u.cooldown <= 0) {
      uint16_t c = (u.role == Role::MAGE) ? canvas.color565(190, 80, 255) : enemyColor;
      addBeam(u.x, u.y, tx, ty, c, 0.15f);
      spawnParticle(tx, ty, c, 2);
      if (ft >= 0) {
        units[ft].hp -= u.dmg * waveShieldMul;
        if (units[ft].hp <= 0) {
          spawnParticle(units[ft].x, units[ft].y, playerColor, 8);
          units[ft].active = false;
        }
      } else {
        damageThrone(u.dmg * waveShieldMul);
      }
      u.cooldown = (u.role == Role::BRUTE) ? 1.25f : ((u.role == Role::MAGE) ? 1.1f : 0.82f);
    }
    if (d > u.rangeSq * 0.72f) {
      float dx = tx - u.x;
      float dy = ty - u.y;
      float ls = dx*dx + dy*dy;
      if (ls > 0.01f) { float inv = 1.0f / (sqrtf(ls) + 0.0001f); dx *= inv; dy *= inv; }
      float wm = enemyWeatherSpeedMul();
      u.vx += (dx * u.speed * wm - u.vx) * 4.6f * dt;
      u.vy += (dy * u.speed * wm - u.vy) * 4.6f * dt;
    } else {
      u.vx *= 0.86f;
      u.vy *= 0.86f;
    }
  }

  void buildSpatialGrid() {
    memset(gridHead, -1, sizeof(gridHead));
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active) continue;
      int cx = constrain((int)units[i].x / 16, 0, 7);
      int cy = constrain((int)units[i].y / 16, 0, 7);
      int cell = cx + cy * 8;
      gridNext[i] = gridHead[cell];
      gridHead[cell] = i;
    }
    spatialReady = true;
  }

  void updateUnits(float dt) {
    buildSpatialGrid();
    for (int i = 0; i < Config::MAX_UNITS; i++) {
      if (!units[i].active) continue;
      Unit& u = units[i];
      if (u.cooldown > 0) u.cooldown -= dt;
      tickHeroManaAndSkillCooldowns(u, dt);
      if (u.team == 0) updateFriendly(u, dt);
      else updateEnemy(u, dt);

      int cx = constrain((int)u.x / 16, 0, 7);
      int cy = constrain((int)u.y / 16, 0, 7);
      for (int ny = max(0, cy - 1); ny <= min(7, cy + 1); ny++) {
        for (int nx = max(0, cx - 1); nx <= min(7, cx + 1); nx++) {
          int cell = nx + ny * 8;
          int j = gridHead[cell];
          while (j != -1) {
            if (i != j && units[j].active) {
              float sepDist = distSq(u.x, u.y, units[j].x, units[j].y);
              if (sepDist < Config::SEPARATION_DIST_SQ && sepDist > 0.1f) {
                u.vx += (u.x - units[j].x) * 1.7f * dt;
                u.vy += (u.y - units[j].y) * 1.7f * dt;
              }
            }
            j = gridNext[j];
          }
        }
      }
      u.x = constrain(u.x + u.vx * dt, 2.0f, (float)Config::SCREEN_W - 2.0f);
      u.y = constrain(u.y + u.vy * dt, 2.0f, (float)Config::SCREEN_H - 2.0f);
    }
  }

  void updateTelemetry() {
    static uint32_t lastQmpMs = 0;
    uint32_t now = millis();
    if (now - lastQmpMs > 150) {
      lastQmpMs = now;
      qmp.update();
      swarmTempC = qmp.cTemp;
      swarmPressureHpa = qmp.pressure / 100.0f;
    }
    static float predPres = 1013.0f;
    static float predTemp = 24.0f;
    float errP = fabsf(predPres - swarmPressureHpa) * 0.02f;
    float errT = fabsf(predTemp - swarmTempC) * 0.05f;
    predPres = predPres * 0.985f + swarmPressureHpa * 0.015f;
    predTemp = predTemp * 0.985f + swarmTempC * 0.015f;
    swarmGameSurprise = (float)aliveEnemies() * 0.04f + shockwaveRadius * 0.01f + (float)wave * 0.03f;
    swarmPredictionError = errP + errT + swarmGameSurprise * 0.12f;
    swarmLocalEntropy = constrain(swarmMicRms * 0.0008f + fabsf(swarmPressureHpa - 1013.25f) * 0.006f + fabsf(swarmTempC - 24.0f) * 0.035f + swarmGameSurprise + swarmPredictionError, 0.01f, 9999.0f);
  }

  void updateWeather(float dt) {
    uint32_t now = millis();
    dayPhase += dt / 96.0f; // full day/night loop around 96 seconds.
    if (dayPhase >= 1.0f) dayPhase -= 1.0f;

    if (lastWeatherShiftMs == 0 || now - lastWeatherShiftMs > 28000UL) {
      lastWeatherShiftMs = now;
      uint32_t r = esp_random() % 100;
      // Sensor bias: low pressure nudges toward storm/fog, high temp nudges toward heat.
      if (swarmPressureHpa > 0.1f && swarmPressureHpa < 1007.0f && r < 55) weatherMode = 2;
      else if (swarmTempC > 29.5f && r < 50) weatherMode = 4;
      else if (r < 36) weatherMode = 0;
      else if (r < 58) weatherMode = 1;
      else if (r < 72) weatherMode = 2;
      else if (r < 88) weatherMode = 3;
      else weatherMode = 4;
      weatherStrength = 0.35f + (float)(esp_random() % 65) * 0.01f;
    }
  }

  void drawWeatherLayer(uint32_t now) {
    if (weatherMode == 1 || weatherMode == 2) {
      int drops = (weatherMode == 2) ? 22 : 14;
      uint16_t rc = (weatherMode == 2) ? canvas.color565(70, 110, 150) : canvas.color565(48, 82, 122);
      for (int i = 0; i < drops; i++) {
        int x = (i * 17 + now / 8) & 127;
        int y = (i * 31 + now / 5) & 127;
        canvas.drawLine(x, y, x - 2, y + 4, dimColor(rc, 0.65f));
      }
      if (weatherMode == 2 && ((now / 420) & 15) == 0) {
        canvas.drawFastHLine(0, 18 + ((now / 97) & 31), 128, dimColor(TFT_CYAN, 0.35f));
      }
    } else if (weatherMode == 3) {
      for (int i = 0; i < 7; i++) {
        int x = (i * 25 + now / 23) & 127;
        int y = 22 + ((i * 13 + now / 31) & 63);
        canvas.drawFastHLine(x, y, 18, canvas.color565(18, 22, 28));
      }
    } else if (weatherMode == 4) {
      for (int i = 0; i < 10; i++) {
        int x = (i * 19 + now / 19) & 127;
        int y = 18 + ((i * 29 + now / 37) & 80);
        canvas.drawPixel(x, y, canvas.color565(58, 34, 18));
        canvas.drawPixel(x + 1, y, canvas.color565(46, 28, 14));
      }
    }
  }

public:
  void drawAgentStateMini(uint32_t now) {
    (void)now;
    float pEntropy, pMood, pFatigue, pVigor;
    uint8_t pMoodCode;
    janusPersonalSnapshot(pEntropy, pMood, pFatigue, pVigor, pMoodCode);
    uint16_t c = TFT_SILVER;
    if (pMoodCode == 0) c = canvas.color565(140, 140, 160);
    else if (pMoodCode == 4) c = canvas.color565(255, 110, 80);
    else if (pMoodCode == 5) c = canvas.color565(255, 220, 90);
    else if (pMoodCode == 3) c = canvas.color565(110, 220, 255);
    else if (pMoodCode == 2) c = canvas.color565(120, 230, 150);
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(c, TFT_TRANSPARENT);
    char b[28];
    snprintf(b, sizeof(b), "%s F%02d V%02d", janusMoodName(pMoodCode), (int)(pFatigue * 100.0f), (int)(pVigor * 100.0f));
    canvas.drawString(b, 2, 20);
  }

  void init() {
    loadRecords();
    for (int i=0; i<15; i++) {
      bgDrops[i].x = esp_random() % Config::SCREEN_W;
      bgDrops[i].y = esp_random() % Config::SCREEN_H;
      bgDrops[i].radius = (esp_random() % 4) + 2;
      bgDrops[i].speed = ((esp_random() % 10) + 5) * 0.35f;
      bgDrops[i].phase = (esp_random() % 100) / 10.0f;
    }
    lastWeatherShiftMs = 0;
    weatherMode = 0;
    weatherStrength = 0.35f;
    startNewRun();
  }

  void drawMiningLuckToast(uint32_t now) {
    if (!miningToastUntilMs || now > miningToastUntilMs) return;
    uint16_t c = canvas.color565(236, 178, 44);
    canvas.drawRoundRect(5, 53, 118, 12, 3, dimColor(c, 0.70f));
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(c, TFT_TRANSPARENT);
    canvas.drawString(miningToastLine, 8, 55);
  }

  void applyMinerRewardEvents() {
    static uint32_t seenSeq = 0;
    uint32_t seq;
    uint8_t kind;
    uint16_t bits;
    portENTER_CRITICAL(&minerGameRewardMux);
    seq = minerGameRewardSeq;
    kind = minerGameRewardKind;
    bits = minerGameRewardBits;
    portEXIT_CRITICAL(&minerGameRewardMux);

    if (seq == seenSeq || seq == 0) return;
    seenSeq = seq;

    uint16_t col = TFT_YELLOW;
    uint32_t bonusGold = 0;
    uint16_t bonusXp = 0;
    uint8_t luckAdd = 1;
    float luckPowerAdd = 0.08f + (float)min(64, (int)bits) * 0.004f;

    if (kind == 5) {        // Buzz-confirmed pool ACCEPT from a remote worker: real buff
      bonusGold = 130 + bits * 5;
      bonusXp = 72 + bits * 2;
      col = canvas.color565(255, 224, 92);
      luckAdd = 4 + min(3, (int)colonyAgentLevel);
      luckPowerAdd += 0.72f + 0.08f * (float)colonyAgentLevel;
      snprintf(heroLine, sizeof(heroLine), "BUZZ POOL ACCEPT B%u", bits);
      snprintf(miningToastLine, sizeof(miningToastLine), "REAL ACCEPT +%luG", (unsigned long)bonusGold);
      if (repairLv < 12) repairLv++;
      if (towerLv < 10) towerLv++;
      if (dmgLv < 14) dmgLv++;
    } else if (kind == 3) {        // direct/local pool accepted: rare, big positive event
      bonusGold = 110 + bits * 4;
      bonusXp = 60 + bits * 2;
      col = TFT_GREEN;
      luckAdd = 4;
      luckPowerAdd += 0.55f;
      snprintf(heroLine, sizeof(heroLine), "POOL ACCEPT B%u", bits);
      snprintf(miningToastLine, sizeof(miningToastLine), "POOL LUCK +%luG", (unsigned long)bonusGold);
      if (towerLv < 10) towerLv++;
      if (dmgLv < 14) dmgLv++;
    } else if (kind == 2) { // local pool candidate submitted: praise only until pool ACCEPT
      bonusGold = 0;
      bonusXp = 0;
      col = TFT_YELLOW;
      luckAdd = 0;
      luckPowerAdd = 0.0f;
      snprintf(heroLine, sizeof(heroLine), "POOL CAND B%u", bits);
      snprintf(miningToastLine, sizeof(miningToastLine), "POOL CAND WAIT");
    } else if (kind == 1) { // Buzz job share sent: real ticket, but no buff until Buzz reports pool ACCEPT
      bonusGold = 0;
      bonusXp = 0;
      col = TFT_ORANGE;
      luckAdd = 0;
      luckPowerAdd = 0.0f;
      snprintf(heroLine, sizeof(heroLine), "BUZZ TICKET B%u", bits);
      snprintf(miningToastLine, sizeof(miningToastLine), "BUZZ TICKET SENT");
    } else if (kind == 8) { // Buzz Agent praise only: visible morale, strictly no gameplay buff
      bonusGold = 0;
      bonusXp = 0;
      col = canvas.color565(110, 220, 255);
      luckAdd = 0;
      luckPowerAdd = 0.0f;
      snprintf(heroLine, sizeof(heroLine), "BUZZ PRAISE L%u", (unsigned)colonyAgentLevel);
      snprintf(miningToastLine, sizeof(miningToastLine), "PRAISE ONLY B%u", bits);
    } else {               // local fallback omen: praise only, not a fake share
      bonusGold = 0;
      bonusXp = 0;
      col = canvas.color565(180, 140, 40);
      luckAdd = 0;
      luckPowerAdd = 0.0f;
      snprintf(heroLine, sizeof(heroLine), "HASH OMEN B%u", bits);
      snprintf(miningToastLine, sizeof(miningToastLine), "HASH PRAISE ONLY");
    }

    bool realBuffEvent = (bonusGold > 0 || bonusXp > 0 || luckAdd > 0 || luckPowerAdd > 0.0f);
    if (realBuffEvent) {
      gold += bonusGold;
      xp += bonusXp;
      bases[0].hp = min(bases[0].maxHp, bases[0].hp + (float)(7 + bits / 2));
      bases[0].resources += (int)(bonusGold / 3);
      miningLuckCharges = (uint8_t)min(9, (int)miningLuckCharges + (int)luckAdd);
      miningLuckPower = constrain(miningLuckPower + luckPowerAdd, 0.0f, 2.60f);

      // Immediate current-wave morale, plus charges for future waves. This turns real accepted
      // mining success into visible good gameplay instead of only numbers on the miner HUD.
      waveLootMul = min(1.90f, waveLootMul + 0.035f * (float)luckAdd);
      waveDamageMul = min(1.60f, waveDamageMul + 0.018f * (float)luckAdd);
      grantHeroXp((uint16_t)(bonusXp / 2 + luckAdd * 3));
      if ((kind == 3 || kind == 5) && aliveFriendlies() < 8 + unitLv) spawnUnit(0, randomFriendlyRole(), bases[0].x, bases[0].y);
      shockwaveRadius = max(shockwaveRadius, 8.0f + (float)min(28, (int)bits));
      spawnParticle(bases[0].x, bases[0].y, col, (kind == 3 || kind == 5) ? 30 : 14);
    }

    miningToastUntilMs = millis() + ((kind == 3 || kind == 5) ? 6200UL : 2600UL);
    addBeam(bases[0].x, bases[0].y, bases[0].x + 1, bases[0].y - 1, col, realBuffEvent ? 0.25f : 0.10f);
    playBeep(realBuffEvent ? 2100 : 1200, realBuffEvent ? 55 : 18);
  }

  void fixedGameStep(float dt, uint32_t now) {
    updateEffects(dt);
    updateWeather(dt);
    applyMinerRewardEvents();
    janusPersonalMetabolism(now, minerRealHashrate + minerRemoteHashrate + minerLocalHashrate, state == GameState::PLAYING, swarmTempC, swarmGameSurprise);

    if (state == GameState::GAME_OVER) {
      gameOverTimer -= dt;
      if (gameOverTimer <= 0.0f) startNewRun();
      return;
    }

    survivalMs = now - runStartMs;
    for (int i=0; i<15; i++) {
      bgDrops[i].y -= bgDrops[i].speed * dt;
      if (bgDrops[i].y < -8) { bgDrops[i].y = Config::SCREEN_H + 8; bgDrops[i].x = esp_random() % Config::SCREEN_W; }
    }

