Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
    if (xp >= level * 70UL) { xp -= level * 70UL; level++; gold += 20 + level * 4; }
    updateWave(dt);
    janusAutoUpgrade();

    // Grid is now used for targeting before throne/tower/hero logic.
    buildSpatialGrid();
    updateThrone(dt);
    updateUnits(dt);

    if (bases[0].hp <= 0.0f) finishRun();
  }

  void update() {
    uint32_t now = millis();
    float frameDt = (now - lastTick) / 1000.0f;
    lastTick = now;
    if (frameDt < 0.001f) frameDt = 0.001f;
    if (frameDt > Config::MAX_FRAME_DT) frameDt = Config::MAX_FRAME_DT;
    avgFps = avgFps * 0.90f + (1.0f / frameDt) * 0.10f;

    handleInput();
    applyGroundOrders();
    updateRaidFocus();
    updateEchoBaseMicRms();
    updateTelemetry();

    fixedAccumulator += frameDt;
    uint8_t steps = 0;
    while (fixedAccumulator >= Config::FIXED_DT && steps < Config::MAX_CATCHUP_STEPS) {
      fixedGameStep(Config::FIXED_DT, now);
      fixedAccumulator -= Config::FIXED_DT;
      steps++;
    }
    if (steps == Config::MAX_CATCHUP_STEPS) fixedAccumulator = 0.0f;
  }

  void drawThrone() {
    int cx = (int)bases[0].x;
    int cy = (int)bases[0].y;
    uint16_t hot = brightenColor(playerColor, 0.35f);
    canvas.fillCircle(cx, cy, 8, dimColor(playerColor, 0.55f));
    canvas.drawCircle(cx, cy, 10, dimColor(playerColor, 0.65f));
    canvas.drawRect(cx - 6, cy - 6, 13, 13, hot);
    canvas.drawLine(cx - 10, cy, cx + 10, cy, dimColor(hot, 0.65f));
    canvas.drawLine(cx, cy - 10, cx, cy + 10, dimColor(hot, 0.65f));
    drawSpark(cx, cy, TFT_WHITE);
    int hpw = (int)((bases[0].hp / bases[0].maxHp) * 28.0f);
    canvas.fillRect(cx - 14, cy - 17, 28, 3, dimColor(playerColor, 0.18f));
    canvas.fillRect(cx - 14, cy - 17, hpw, 3, hot);
  }

  void drawUnit(const Unit& u) {
    int x = (int)u.x;
    int y = (int)u.y;
    uint16_t col = (u.team == 0) ? playerColor : enemyColor;
    if (u.team == 1 && u.role == Role::MAGE) col = canvas.color565(180, 80, 255);
    if (u.team == 1 && u.role == Role::BRUTE) col = canvas.color565(255, 110, 50);
    uint16_t hot = brightenColor(col, 0.25f);

    if (u.team == 1) {
      // v8.15B: enemies are never drawn with throne-unit silhouettes.
      // Dark outline + hostile glyph shapes keep them readable in the swarm.
      uint16_t shadow = canvas.color565(18, 0, 4);
      canvas.drawCircle(x, y, 6, shadow);
      canvas.drawFastHLine(x - 6, y, 13, shadow);
      canvas.drawFastVLine(x, y - 6, 13, shadow);

      if (u.role == Role::BRUTE) {
        canvas.fillCircle(x, y, 5, canvas.color565(255, 88, 30));
        canvas.drawCircle(x, y, 6, TFT_BLACK);
        canvas.drawFastHLine(x - 4, y, 9, TFT_WHITE);
      } else if (u.role == Role::MAGE) {
        uint16_t m = canvas.color565(190, 70, 255);
        canvas.fillTriangle(x, y - 6, x - 5, y, x, y + 6, m);
        canvas.fillTriangle(x, y - 6, x + 5, y, x, y + 6, dimColor(m, 0.75f));
        canvas.drawCircle(x, y, 3, TFT_WHITE);
      } else if (u.role == Role::ARCHER) {
        canvas.drawTriangle(x, y - 5, x - 5, y + 4, x + 5, y + 4, canvas.color565(255, 54, 84));
        canvas.drawFastVLine(x, y - 5, 10, TFT_WHITE);
      } else {
        canvas.fillRect(x - 4, y - 4, 9, 9, enemyColor);
        canvas.drawLine(x - 5, y - 5, x + 5, y + 5, TFT_BLACK);
        canvas.drawLine(x + 5, y - 5, x - 5, y + 5, TFT_BLACK);
        canvas.drawPixel(x, y, TFT_WHITE);
      }

      if (u.hp < u.maxHp) {
        int hpw = constrain((int)((u.hp / max(1.0f, u.maxHp)) * 9.0f), 0, 9);
        canvas.fillRect(x - 4, y - 8, 9, 2, canvas.color565(55, 0, 0));
        canvas.fillRect(x - 4, y - 8, hpw, 2, canvas.color565(255, 40, 40));
      }
      return;
    }

    if (u.role == Role::SCAVENGER) {
      canvas.fillCircle(x, y, 2, col);
      canvas.drawPixel(x, y, TFT_WHITE);
      if (u.carrying) drawSpark(x, y - 3, TFT_YELLOW);
    } else if (u.role == Role::REPAIR) {
      canvas.drawRect(x - 2, y - 2, 5, 5, col);
      canvas.drawFastHLine(x - 2, y, 5, TFT_GREEN);
      canvas.drawFastVLine(x, y - 2, 5, TFT_GREEN);
    } else if (u.role == Role::HEALER) {
      canvas.drawCircle(x, y, 3, TFT_GREEN);
      canvas.drawFastHLine(x - 2, y, 5, TFT_WHITE);
      canvas.drawFastVLine(x, y - 2, 5, TFT_WHITE);
    } else if (u.role == Role::HERO) {
      col = heroClassColor(u.heroClass);
      hot = brightenColor(col, 0.35f);
      uint8_t v = u.visualSeed & 3;
      if (v == 0) canvas.fillTriangle(x, y - 5, x - 4, y + 4, x + 4, y + 4, col);
      else if (v == 1) { canvas.fillCircle(x, y, 4, dimColor(col, 0.90f)); canvas.drawFastHLine(x - 5, y, 11, hot); }
      else if (v == 2) { canvas.drawRect(x - 4, y - 4, 9, 9, col); canvas.drawLine(x - 5, y + 4, x + 5, y - 4, hot); }
      else { canvas.fillRect(x - 3, y - 4, 7, 9, dimColor(col, 0.80f)); canvas.drawCircle(x, y, 5, hot); }
      canvas.drawPixel(x, y, TFT_WHITE);
      if (heroHasReadySkill(u)) drawSpark(x, y - 6, hot);
      if (u.heroLv > 1) canvas.drawFastHLine(x - 3, y + 6, min(7, (int)u.heroLv), hot);
    } else if (u.role == Role::TOWER) {
      canvas.fillRect(x - 3, y - 3, 7, 7, dimColor(col, 0.60f));
      canvas.drawRect(x - 4, y - 4, 9, 9, hot);
      canvas.drawPixel(x, y, TFT_WHITE);
    } else if (u.role == Role::BRUTE) {
      canvas.fillCircle(x, y, 5, dimColor(col, 0.88f));
      canvas.drawCircle(x, y, 5, hot);
      canvas.drawPixel(x, y, TFT_WHITE);
    } else if (u.role == Role::ARCHER) {
      canvas.drawRect(x - 2, y - 2, 5, 5, col);
      canvas.drawPixel(x, y, TFT_WHITE);
    } else if (u.role == Role::MAGE) {
      canvas.drawCircle(x, y, 3, col);
      canvas.fillCircle(x, y, 1, TFT_WHITE);
    } else {
      canvas.fillTriangle(x, y - 4, x - 3, y + 3, x + 3, y + 3, col);
      canvas.drawPixel(x, y, TFT_WHITE);
    }
  }

  void drawSkillIcon(int x, int y, uint16_t skillBit, uint16_t col, bool cooling, float cdFrac) {
    canvas.drawRect(x, y, 8, 8, dimColor(col, cooling ? 0.45f : 0.85f));
    uint16_t ic = cooling ? dimColor(col, 0.45f) : brightenColor(col, 0.30f);
    if (skillBit == SK_HOOK) { canvas.drawCircle(x + 3, y + 3, 2, ic); canvas.drawLine(x + 5, y + 5, x + 7, y + 7, ic); }
    else if (skillBit == SK_FIRE) { canvas.drawTriangle(x + 4, y + 1, x + 1, y + 6, x + 6, y + 6, ic); }
    else if (skillBit == SK_SHIELD) { canvas.drawRect(x + 2, y + 1, 4, 5, ic); }
    else if (skillBit == SK_LASER) { canvas.drawFastHLine(x + 1, y + 4, 6, ic); canvas.drawPixel(x + 6, y + 3, ic); }
    else if (skillBit == SK_NOVA) { canvas.drawCircle(x + 4, y + 4, 2, ic); canvas.drawPixel(x + 4, y + 1, ic); canvas.drawPixel(x + 4, y + 7, ic); }
    else if (skillBit == SK_CHAIN) { canvas.drawLine(x + 1, y + 6, x + 3, y + 3, ic); canvas.drawLine(x + 3, y + 3, x + 5, y + 5, ic); canvas.drawLine(x + 5, y + 5, x + 7, y + 2, ic); }
    else if (skillBit == SK_BLINK) { canvas.drawFastVLine(x + 4, y + 1, 5, ic); canvas.drawPixel(x + 2, y + 2, ic); canvas.drawPixel(x + 6, y + 5, ic); }
    else if (skillBit == SK_FROST) { canvas.drawPixel(x + 4, y + 1, ic); canvas.drawFastVLine(x + 4, y + 1, 6, ic); canvas.drawFastHLine(x + 1, y + 4, 6, ic); }
    else if (skillBit == SK_POISON) { canvas.drawCircle(x + 4, y + 4, 2, ic); canvas.drawPixel(x + 3, y + 3, ic); canvas.drawPixel(x + 5, y + 5, ic); }
    else if (skillBit == SK_TOTEM) { canvas.drawFastVLine(x + 4, y + 1, 6, ic); canvas.drawPixel(x + 2, y + 2, ic); canvas.drawPixel(x + 6, y + 2, ic); }
    else if (skillBit == SK_METEOR) { canvas.drawLine(x + 1, y + 6, x + 5, y + 2, ic); canvas.drawPixel(x + 6, y + 1, ic); }
    if (cooling) {
      canvas.drawCircle(x + 6, y + 1, 1, TFT_SILVER);
      canvas.drawPixel(x + 6, y + 1, TFT_SILVER);
      if (cdFrac > 0.66f) canvas.drawLine(x + 6, y + 1, x + 6, y - 1, TFT_SILVER);
      else if (cdFrac > 0.33f) canvas.drawLine(x + 6, y + 1, x + 7, y, TFT_SILVER);
      else canvas.drawLine(x + 6, y + 1, x + 5, y + 2, TFT_SILVER);
    }
  }

