Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
  void drawHeroHud() {
    // v8.15B: compact transparent hero HUD.
    // No opaque lower block: only thin outlines, tiny bars and transparent text.
    const int x = 2;
    const int w = 60;      // v8.15B: same width as right miner HUD
    const int hPanel = 21; // v8.15B: same height as right miner HUD
    const int goldY = Config::SCREEN_H - 34;
    const int y = Config::SCREEN_H - 22;
    uint16_t goldLine = canvas.color565(224, 168, 34);

    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(brightenColor(goldLine, 0.25f), TFT_TRANSPARENT);
    char gb[22];
    snprintf(gb, sizeof(gb), "G:%s", compactK(gold));
    canvas.drawString(gb, x + 1, goldY);

    int hi = focusHeroIndex();
    if (hi < 0) {
      canvas.drawRoundRect(x, y, w, hPanel, 3, dimColor(goldLine, 0.58f));
      canvas.setTextColor(TFT_SILVER, TFT_TRANSPARENT);
      canvas.drawString("NO MECH", x + 3, y + 3);
      char cb[24];
      snprintf(cb, sizeof(cb), "DROP %sG", compactK(heroBuyCost()));
      canvas.setTextColor(gold >= heroBuyCost() ? goldLine : TFT_DARKGREY, TFT_TRANSPARENT);
      canvas.drawString(cb, x + 3, y + 12);
      canvas.setTextDatum(TL_DATUM);
      return;
    }

    const Unit& h = units[hi];
    uint16_t hc = heroClassColor(h.heroClass);
    canvas.drawRoundRect(x, y, w, hPanel, 3, dimColor(hc, 0.62f));

    int ix = x + 3;
    int drawn = 0;
    for (uint16_t bit = 1; bit && drawn < 6 && (ix + 8) <= (x + w - 2); bit = nextSkillBit(bit)) {
      if (!(h.skillMask & bit)) continue;
      uint8_t si = skillIndex(bit);
      bool cooling = (si < 11) && h.skillCd[si] > 0.05f;
      bool enoughMana = h.mana + 0.01f >= (float)heroSkillManaCost(bit, h.heroLv);
      float frac = (si < 11 && h.skillCdMax[si] > 0.01f) ? (h.skillCd[si] / h.skillCdMax[si]) : 0.0f;
      drawSkillIcon(ix, y + 1, bit, enoughMana ? hc : dimColor(hc, 0.42f), cooling, frac);
      ix += 9;  // v8.15B: 6 icons fit inside 60 px without touching miner HUD
      drawn++;
    }

    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(hc, TFT_TRANSPARENT);
    canvas.drawString(heroClassShort(h.heroClass), x + 3, y + 10);

    char hb[18];
    snprintf(hb, sizeof(hb), "L%u", h.heroLv);
    canvas.setTextDatum(TR_DATUM);
    canvas.setTextColor(TFT_LIGHTGREY, TFT_TRANSPARENT);
    canvas.drawString(hb, x + w - 4, y + 10);

    int hpw = constrain((int)((h.hp / max(1.0f, h.maxHp)) * (float)(w - 8)), 0, w - 8);
    int mpw = constrain((int)((h.mana / max(1.0f, h.maxMana)) * (float)(w - 8)), 0, w - 8);

    // Tiny health/mana strips under the hero line.
    canvas.drawFastHLine(x + 4, y + 17, w - 8, canvas.color565(50, 0, 0));
    canvas.drawFastHLine(x + 4, y + 17, hpw, TFT_RED);
    canvas.drawFastHLine(x + 4, y + 19, w - 8, canvas.color565(0, 9, 40));
    canvas.drawFastHLine(x + 4, y + 19, mpw, canvas.color565(40, 120, 255));

    canvas.setTextDatum(TL_DATUM);
  }

  void drawRecords() {
    // Event-only record toast: shown only for a few seconds after the table changes.
    canvas.fillRect(2, 22, 68, 42, canvas.color565(0,0,0));
    canvas.drawRect(2, 22, 68, 42, dimColor(playerColor, 0.45f));
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextSize(1);
    canvas.setTextColor(TFT_SILVER, TFT_TRANSPARENT);
    canvas.drawString("RECORD", 5, 24);
    for (int i = 0; i < 4; i++) {
      if (!bestMs[i]) continue;
      canvas.setTextColor(bestColor[i] ? bestColor[i] : TFT_WHITE, TFT_TRANSPARENT);
      char b[34];
      snprintf(b, sizeof(b), "#%u %s W%u", bestModel[i], fmtTime(bestMs[i]), bestWave[i]);
      canvas.drawString(b, 5, 32 + i * 7);
    }
  }

  void draw() {
    uint32_t now = millis();
    float dl = dayLight();
    uint8_t bgR = (uint8_t)(3 + dl * 5);
    uint8_t bgG = (uint8_t)(5 + dl * 8);
    uint8_t bgB = (uint8_t)(10 + dl * 16);
    if (weatherMode == 2) { bgR = 3; bgG = 5; bgB = 13; }
    if (weatherMode == 3) { bgR += 4; bgG += 4; bgB += 4; }
    if (weatherMode == 4) { bgR += 8; bgG += 3; }
    canvas.fillRect(0, 0, Config::SCREEN_W, Config::SCREEN_H, canvas.color565(bgR, bgG, bgB));
    drawGroundTiles(now, dl);

    for (int i=0; i<15; i++) {
      uint16_t haze = canvas.color565(6 + (uint8_t)(dl * 6), 10 + (i & 3) * 2 + (uint8_t)(dl * 6), 18 + (i & 1) * 5 + (uint8_t)(dl * 8));
      canvas.fillCircle((int)bgDrops[i].x, (int)bgDrops[i].y, (int)bgDrops[i].radius + 2, dimColor(haze, weatherMode == 3 ? 0.95f : 0.75f));
    }
    for (int i = 0; i < 18; i++) canvas.drawPixel((i * 29 + now / 13) & 127, (i * 47 + now / 21) & 127, canvas.color565(18 + (uint8_t)(dl * 12), 22 + (uint8_t)(dl * 10), 30 + (uint8_t)(dl * 12)));
    drawWeatherLayer(now);
    // v8.15B: TD maze layer removed; swarm comes from all sides again.

    if (shockwaveRadius > 0.0f) {
      canvas.drawCircle((int)bases[0].x, (int)bases[0].y, (int)shockwaveRadius, TFT_CYAN);
      canvas.drawCircle((int)bases[0].x, (int)bases[0].y, (int)shockwaveRadius + 1, dimColor(TFT_CYAN, 0.35f));
    }

    for (auto& r : resources) {
      if (!r.active) continue;
      canvas.fillRect((int)r.x - 1, (int)r.y - 1, 3, 3, TFT_YELLOW);
      canvas.drawPixel((int)r.x, (int)r.y - 2, TFT_WHITE);
    }

    drawThrone();

    for (auto& s : spits) {
      if (!s.active) continue;
      float t = 1.0f - (s.life / s.maxLife);
      float cx = s.startX + (s.endX - s.startX) * t;
      float cy = s.startY + (s.endY - s.startY) * t;
      canvas.drawLine((int)s.startX, (int)s.startY, (int)cx, (int)cy, dimColor(s.color, 0.40f));
      canvas.drawLine((int)(s.startX + (s.endX - s.startX) * max(0.0f, t - 0.16f)), (int)(s.startY + (s.endY - s.startY) * max(0.0f, t - 0.16f)), (int)cx, (int)cy, brightenColor(s.color, 0.42f));
      drawSpark((int)cx, (int)cy, brightenColor(s.color, 0.45f));
    }

    for (int i=0; i<Config::MAX_UNITS; i++) if (units[i].active) drawUnit(units[i]);

    for (auto& p : particles) {
      if (!p.active) continue;
      if (p.life > 0.12f) drawSpark((int)p.x, (int)p.y, p.color);
      else canvas.drawPixel((int)p.x, (int)p.y, dimColor(p.color, p.life * 6.0f));
    }

    // HUD: FPS + weather left, throne survival timer top-center, wave/level + sensors top-right, gold bottom-right.
    canvas.setTextSize(1);
    canvas.setTextDatum(TL_DATUM);
    canvas.setTextColor(TFT_DARKGREY, TFT_TRANSPARENT);
    char fpsBuf[14]; snprintf(fpsBuf, sizeof(fpsBuf), "FPS:%02d", (int)avgFps);
    canvas.drawString(fpsBuf, 2, 2);
    char wBuf[16]; snprintf(wBuf, sizeof(wBuf), "%s", weatherName());
    canvas.drawString(wBuf, 2, 11);
    drawAgentStateMini(now);

