Hawkar-usls/janus-distributed-ai-swarm/firmware/esp32_swarm/ATOM_SWARM_TRON.ino
    canvas.setTextDatum(TC_DATUM);
    canvas.setTextColor(TFT_SILVER, TFT_TRANSPARENT);
    // This is the total time the throne survived in the current run; finishRun writes this exact value into records.
    canvas.drawString(fmtTime(survivalMs), Config::SCREEN_W / 2, 2);
    canvas.setTextColor(groundMode ? canvas.color565(255, 190, 80) : dimColor(playerColor, 0.75f), TFT_TRANSPARENT);
    canvas.drawString(groundMissionLine, Config::SCREEN_W / 2, 11);
    drawGroundMissionOverlay(now);
    drawGroundToast(now);
    drawMiningLuckToast(now);

    canvas.setTextDatum(TR_DATUM);
    canvas.setTextColor(TFT_LIGHTGREY, TFT_TRANSPARENT);
    char waveBuf[18]; snprintf(waveBuf, sizeof(waveBuf), "W%u L%u", wave, level);
    canvas.drawString(waveBuf, Config::SCREEN_W - 2, 2);
    char tBuf[16]; snprintf(tBuf, sizeof(tBuf), "%.1fC", swarmTempC);
    canvas.drawString(tBuf, Config::SCREEN_W - 2, 11);
    char pBuf[16]; snprintf(pBuf, sizeof(pBuf), "%.0fhP", swarmPressureHpa);
    canvas.drawString(pBuf, Config::SCREEN_W - 2, 20);
    drawHeroHud();
    if (recordsToastUntilMs && now < recordsToastUntilMs) drawRecords();

    // v8.15B compact transparent miner HUD on the right side.
    // No opaque gold capsule and no 36px bottom wall.
    uint32_t poolH = minerRealHashrate;
    uint32_t localH = minerLocalHashrate;
    uint32_t remoteH = minerRemoteHashrate;
    uint32_t totalH = poolH + localH + remoteH;
    uint32_t sharesNow = getMinerSharesSafe();
    uint32_t rejectsNow = getMinerRejectsSafe();
    uint32_t bestNow = getMinerBestBitsSafe();
    const char* mmode = remoteH ? "BUZ" : (poolH ? "POOL" : (localH ? "SELF" : "SEEK"));

    uint16_t goldLine = canvas.color565(224, 168, 34);
    const int panelW = 60; // v8.15B: equal to left hero HUD width
    const int panelH = 21; // v8.15B: equal to left hero HUD height
    const int panelX = Config::SCREEN_W - panelW - 2; // 66 on 128px screen, no overlap with left 2..62
    const int panelY = Config::SCREEN_H - panelH - 2;

    canvas.setTextDatum(TL_DATUM);
    canvas.drawRoundRect(panelX, panelY, panelW, panelH, 3, dimColor(goldLine, 0.72f));

    canvas.setTextColor(goldLine, TFT_TRANSPARENT);
    char mh1[24]; snprintf(mh1, sizeof(mh1), "%s H:%s", mmode, compactK(totalH));
    canvas.drawString(mh1, panelX + 3, panelY + 2);

    char mh2[26]; snprintf(mh2, sizeof(mh2), "S%s R%s B%lu/%u",
                           compactK(sharesNow + remoteSharesSent),
                           compactK(rejectsNow),
                           (unsigned long)bestNow,
                           (unsigned)minerShareTargetBits);
    canvas.setTextColor(brightenColor(goldLine, 0.28f), TFT_TRANSPARENT);
    canvas.drawString(mh2, panelX + 3, panelY + 11);

    canvas.setTextDatum(TC_DATUM);
    canvas.setTextColor(TFT_DARKGREY, TFT_TRANSPARENT);
    canvas.drawString(brightLevels[brightIdx] == 0 ? "LCD OFF" : (groundMode ? "RAID" : (shouldStayRemoteMode() ? "REMOTE" : "LOCAL")),
                      Config::SCREEN_W / 2, 2);

    if (!soundEnabled) {
      canvas.setTextDatum(TC_DATUM);
      canvas.setTextColor(TFT_SILVER, TFT_TRANSPARENT);
      canvas.drawString("MUTE", Config::SCREEN_W / 2, 11);
    }

    canvas.setTextDatum(TL_DATUM);
    canvas.pushSprite(0, 0);
  }
};


NeuralSwarm swarm;

void setup() {
  Serial.begin(115200);
  delay(200);
  auto cfg = M5.config();
  M5.begin(cfg);
  M5.Display.setBrightness(255);  // v8.10B compilefix: brightLevels lives inside NeuralSwarm
  canvas.createSprite(Config::SCREEN_W, Config::SCREEN_H);
  

  // EchoBase init first on official Wire SDA=38/SCL=39.
  // After codec/I2S setup, Wire is switched back to BPS SDA=2/SCL=1.
  Wire.end();
  delay(20);
  echoBaseReady = echobase.init(16000, 38, 39, 7, 6, 5, 8, Wire);
  if (echoBaseReady) {
    echobase.setSpeakerVolume(0);
    echobase.setMicGain(ES8311_MIC_GAIN_12DB);  // v8.28 VOICEFORMANT: middle gain, AGC handles loud/quiet speech
    echobase.setMute(true);
    Serial.println("[ECHO-MIC] EchoBase init OK on Wire SDA=38 SCL=39");
  } else {
    Serial.println("[ECHO-MIC] EchoBase init FAIL on Wire SDA=38 SCL=39");
  }
  delay(20);
  Wire.end();
  delay(20);

  Wire.begin(2, 1, 400000); 
  
  // Инициализация BPS с правильной сигнатурой
  if (!qmp.begin(&Wire, QMP6988_SLAVE_ADDRESS_L, 2, 1, 400000U)) {
    if (!qmp.begin(&Wire, 0x56, 2, 1, 400000U)) {
      Serial.println("BPS Sensor not found!");
    }
  }
  
  M5.Speaker.setVolume(0);
initSwarmWorkerName();
  Serial.printf("JANUS GROUNDOPS v8.30 KENSHI TACHYON AUDIOFIX worker: %s\n", MINER_USER);
  Serial.println("[COLONY] v8.30 ATOM S3R GROUNDOPS: EchoMic heartbeat + lower-latency audio snapshot + Kenshi/Tachyon prophecy bus + anti-H0 remote fallback.");

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  Serial.printf("WiFi connecting to SSID: %s\n", WIFI_SSID);
  Serial.printf("Pool endpoint: stratum+tcp://%s:%u\n", POOL_HOST, POOL_PORT);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  janusColonyBegin();

  xTaskCreatePinnedToCore(
    microMinerTask,
    "SwarmMiner",
    12288,
    NULL,
    1,
    &minerTaskHandle,
    0
  );

  randomSeed(esp_random());
  swarm.init();
}

void loop() {
  swarm.update();
  swarm.draw();
  janusColonyAITick();
  janusColonyTick();
  janusAudioTxTick();
  tachyonProphecyTick();
  static uint32_t lastTdLog = 0;
  if (millis() - lastTdLog > 5000) {
    lastTdLog = millis();
    char statusCopy[20];
    copyMinerStatus(statusCopy, sizeof(statusCopy));
    Serial.printf("[TD] mode=%s remoteH=%lu localH=%lu poolH=%lu mic=%.1f/%.1f floor=%.1f micFrames=%lu micFail=%lu echoOk=%lu echoFail=%lu echoReady=%d audio=%d audioTx=%lu audioFail=%lu shares=%lu remoteShares=%lu best=%lu status=%s agent=%s\n",
      shouldStayRemoteMode() ? "REMOTE" : "LOCAL",
      (unsigned long)minerRemoteHashrate,
      (unsigned long)minerLocalHashrate,
      (unsigned long)minerRealHashrate,
      swarmMicRms, swarmMicPeak, micNoiseFloor,
      (unsigned long)swarmMicFrames,
      (unsigned long)swarmMicFails,
      (unsigned long)echoMicReadOk,
      (unsigned long)echoMicReadFail,
      echoBaseReady ? 1 : 0,
      janusAudioTxEnabled ? 1 : 0,
      (unsigned long)janusAudioTxFrames,
      (unsigned long)janusAudioTxSendFail,
      (unsigned long)getMinerSharesSafe(),
      (unsigned long)remoteSharesSent,
      (unsigned long)getMinerBestBitsSafe(),
      statusCopy, janusPersonalLine, swarmMemoryLine);
  }
  delay(1); 
}